import { Fragment, useEffect, useMemo, useState } from "react";
import {
  BarChart, Bar, XAxis, YAxis, CartesianGrid, Tooltip,
  ResponsiveContainer, Cell, Legend, LabelList,
} from "recharts";
import { Search, FileText, Sun, Moon } from "lucide-react";
import CambodiaMap from "./components/CambodiaMap";
import ParticleBackground from "./components/ParticleBackground";


type Language = "km" | "en";
type Theme = "light" | "dark";

type LocalizedText = {
  km: string;
  en: string;
};

type CategoryDetail = {
  code: string;
  name: string;
  englishName: string;
  entityUsed?: string;
  description: string;
};


type EntityGlossaryItem = {
  shortcut: string;
  khmerName: string;
  englishName: string;
  description?: string;
};


type UserSiteCategoryDetail = {
  id: string;
  name: LocalizedText;
  sites?: number;
  users?: number;
  activeUsers?: number;
  inactiveUsers?: number;
};

type UserSiteCategory = {
  id: string;
  label: LocalizedText;
  /** Official number of sites/entities in this category. */
  siteCount: number;
  /** Optional category total before all detail rows are entered. */
  userCount?: number;
  details: UserSiteCategoryDetail[];
};

const categoryData: {
  id: string;
  name: string;
  reports: number;
  details: CategoryDetail[];
}[] = [
    {
      id: "financial",
      name: "របាយការណ៍ហិរញ្ញវត្ថុ - Financial Report",
      reports: 37,
      details: [
        {
          code: "R01",
          name: "តារាងតុល្យភាព",
          englishName: "Balance Sheet", entityUsed: "GDPS, GDNT, PT",
          description: "តារាងតុល្យភាព គឺជារបាយការណ៍ ស្តីពីការតាមដានតុល្យភាពគណនីថវិកាតាមក្រសួង-ស្ថាប័ន មន្ទីរជំនាញ និងរដ្ឋបាលថ្នាក់ក្រោមជាតិ ដែលផ្តល់លទ្ធភាពដល់អ្នកប្រើប្រាស់អាចតាមដានប្រចាំថ្ងៃ ប្រចាំខែ និងប្រចាំឆ្នាំ។ របាយការណ៍នេះបង្ហាញនូវសមតុល្យដើមគ្រា ចលនាក្នុងគ្រា សមតុល្យបូកយោងបន្ត និងសមតុល្យចុងគ្រាទៅតាមគណនីនីមួយៗ។​",
        },
        {
          code: "R02",
          name: "របាយការណ៍ចំណូលចំណាយថវិកា",
          englishName: "National Revenue Report", entityUsed: "GDNT, PT",
          description: "របាយការណ៍ចំណូលជាតិ គឺជារបាយការណ៍ស្តីពីចំណូលសម្រាប់ថ្នាក់ជាតិ ដែលផ្តល់ព័ត៌មានតាមសលាកបត្របង្វែរចំណូលប្រចាំខែ ត្រីមាស ឆមាស និងប្រចាំឆ្នាំ ។ អ្នកប្រើប្រាស់អាចទាញរបាយការណ៍តាមដានប្រតិបត្តិការចំណូលចរន្ត និងចំណូលមូលធនសម្រាប់ថ្នាក់ជាតិ ដើម្បីយកទិន្នន័យទៅប្រើប្រាស់ជារបាយការណ៍ផ្សេងៗ។ ចំពោះលក្ខខណ្ឌគឺទាល់តែប្រតិបត្តិការបានអនុម័ត និងបញ្ចូលក្នុងសៀវភៅធំដោយអគ្គនាយកដ្ឋានរតនាគារជាតិរួច។",
        },
        {
          code: "R05",
          name: "របាយការណ៍ធានាចំណាយ",
          englishName: "Report on Commitment", entityUsed: "GDB",
          description: "របាយការណ៍ធានាចំណាយ គឺជាការត្រួតពិនិត្យរបាយការណ៍ថវិកាលើការស្នើសុំធានាចំណាយតាមជំពូក គណនី និងអនុគណនីតាមក្រសួង-ស្ថាប័នដោយបង្ហាញនូវថវិកាដែលបានអនុម័តដោយអង្គភាពថវិកាអាណាប័កផ្ទេរសិទ្ធិពេញលេញ និងក្រសួងសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុ។",
        },
        {
          code: "R06",
          name: "របាយការណ៍ស្ថានភាពចលនាឥណទានថវិកា",
          englishName: "Budget Movement Report", entityUsed: "LM, GDNT, GDB, DEF, PT",
          description: "របាយការណ៍ស្ថានភាពចលនាឥណទានថវិកា គឺជាការត្រួតពិនិត្យរបាយការណ៍ចំណាយថ្នាក់ជាតិដែលមានដូចជាច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ឥណទានកែតម្រូវ ថវិកាអនុវត្ត និងឥណទាននៅសល់របស់អង្គភាពនីមួយៗដែលមានដូចជា បណ្តាក្រសួង-ស្ថាប័ន និងមន្ទីរជំនាញនីមួយៗ។",
        },
        {
          code: "R06SN",
          name: "របាយការណ៍ចលនាឥណទានថវិកា",
          englishName: "Sub-National Budget Movement Report", entityUsed: "DEF, GDSNAF, PV, DS",
          description: "របាយការណ៍ចលនាឥណទានថវិកា គឺជារបាយការណ៍ស្តីពីចំណាយថ្នាក់ក្រោមជាតិដែលមានដូចជាច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ឥណទានកែតម្រូវ ការអនុវត្តថវិកាអនុវត្តដែលបង្ហាញនូវធានាចំណាយបឋម ធានាចំណាយ ចំណាយជាក់ស្តែង ព្រមទាំងឥណទាននៅសល់របស់រដ្ឋបាលថ្នាក់ក្រោមជាតិនីមួយៗ។",
        },
        {
          code: "R17",
          name: "របាយការណ៍ចំណូលជាតិតាមក្រសួង-ស្ថាប័ន",
          englishName: "National Revenue Report by LM", entityUsed: "LM, GDNT, DEF, PT",
          description: "របាយការណ៍ចំណូលជាតិតាមក្រសួង-ស្ថាប័ន គឺជារបាយការណ៍ស្របតាមសលាកបត្របង្វែរចំណូល ប្រចាំខែ ត្រីមាស ឆមាស និង ប្រចាំឆ្នាំ។ អ្នកប្រើប្រាស់អាចទាញរបាយការណ៍តាមដានប្រតិបត្តិការចំណូលមិនមែនសារពើពន្ធសម្រាប់ថ្នាក់ជាតិតាមក្រសួង-ស្ថាប័ន ដើម្បីយកទិន្នន័យទៅប្រើប្រាស់ជារបាយការណ៍ផ្សេងៗ ចំពោះលក្ខខណ្ឌគឺទាល់តែប្រតិបត្តិការបានអនុម័ត និងបញ្ចូលក្នុងសៀវភៅធំដោយអគ្គនាយកដ្ឋានរតនាគារជាតិរួច។",
        },
        {
          code: "R20",
          name: "របាយការណ៍ចំណូលចំណាយថវិកា",
          englishName: "Revenue and Expenditure Report", entityUsed: "LM, GDB, GDSNAF, GDICDM, GDPS, GDNT, DI, DEF, PT",
          description: "របាយការណ៍ចំណូលចំណាយថវិកា គឺជារបាយការណ៍ដែលបង្ហាញពីច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ដែលមានដូចជាការបន្ថែមឥណទាន ការផ្ទេរ ឬ និយ័តឥណទាន ការអនុវត្តថវិកាដូចជាការចំណាយជាដើម និង សមតុល្យដើមគ្រា ចុងគ្រា ឥណទានដែលនៅសល់ ការប្រៀបធៀបរវាងសមតុល្យចុងគ្រាជាមួយច្បាប់ហិរញ្ញវត្ថុ និង ការប្រៀបធៀបរវាងសមតុល្យចុងគ្រាជាមួយឥណទានកែតម្រូវសម្រាប់ចំណូល ចំណាយថ្នាក់ជាតិតាមបណ្តាក្រសួង-ស្ថាប័ន, មន្ទីរជំនាញ និងចំណូលចំណាយថ្នាក់ក្រោមជាតិតាម រាជធានី-ខេត្ត, ក្រុង-ស្រុក-ខណ្ឌ, ឃុំ-សង្កាត់ដើម្បីពិនិត្យ និងតាមដានចំណូលចំណាយទាំងអស់ដែលបានបញ្ចូលក្នុង FMIS។",
        },
        {
          code: "R33",
          name: "របាយការណ៍សរុបចំណាយតាមអាណត្តិ",
          englishName: "Expense Voucher Consolidate", entityUsed: "GDNT, PT, LM, DEF, PV, DS",
          description: "របាយការណ៍សរុបចំណាយតាមអាណត្តិ គឺជារបាយការណ៍សម្រង់ប្រតិបត្តិការអាណត្តិទាំងអស់ដែលបានកត់ត្រាចូលទៅក្នុងប្រព័ន្ធ FMIS ទៅតាមក្រសួង-ស្ថាប័ន មន្ទីរជំនាញ និងរដ្ឋបាលថ្នាក់ក្រោមជាតិ ដែលអាចតាមដានប្រចាំថ្ងៃ ប្រចាំខែ និងប្រចាំឆ្នាំ។ របាយការណ៍នេះបានបែកចែកទិន្នន័យជា ២ ផ្នែកដូចជាទិន្នន័យចំណាយរបស់អាណត្តិចេញពីសាមីអង្គភាព និងទិន្នន័យចំណាយរបស់អាណត្តិចេញពីអគ្គនាយកដ្ឋានរតនាគារជាតិ ក៏ដូចជារតនាគាររាជធានី-ខេត្ត។ បន្ថែមពីនេះ របាយការណ៍ R33 មានបង្ហាញរូបិយប័ណ្ណជារៀល និងរូបិយប័ណ្ណបរទេសទៅតាមប្រតិបត្តិការជាក់ស្តែង និងយោងប្រភេទនៃការបញ្ជាទិញ។",
        },
        {
          code: "R34",
          name: "របាយការណ៍ចំណាយថវិកាជាតិសរុប",
          englishName: "Total National Expenditure", entityUsed: "GDNT",
          description: "របាយការណ៍ចំណាយថវិកាជាតិសរុប គឺជារបាយការណ៍ដែលបង្ហាញទៅលើចំណាយចរន្ត និងចំណាយមូលធនដែលសរុបរួមច្បាប់ហិរញ្ញវត្ថុ, ចលនាឥណទាន និងការអនុវត្តថវិកា និងឥណទានដែលនៅសល់របស់បណ្ដាក្រសួង-ស្ថាប័ន។",
        },
        {
          code: "R35",
          name: "របាយការណ៍តាមកម្មវិធី",
          englishName: "Expenditure Report by Program", entityUsed: "GDNT, PT, LM, DEF, PV, DS",
          description: "របាយការណ៍តាមកម្មវិធី គឺជារបាយការណ៍ស្តីពីចំណាយតាមកម្មវិធីដែលមានដូចជា៖ ច្បាប់ហិរញ្ញវត្ថុ, ឥណទានកែតម្រូវ, ការអនុវត្តថវិកា និងឥណទានទំនេរទៅតាមប្រភេទចំណាយនៃមាតិកាថវិកាតាមកម្មវិធី និងតាមជំពូកនៃចំណាត់ថ្នាក់សេដ្ឋកិច្ចរបស់អង្គភាពនីមួយៗដូចជាក្រសួង-ស្ថាប័ន និងបណ្តាមន្ទីរជំនាញ និងចំណូលចំណាយថ្នាក់ក្រោមជាតិតាមរាជធានី-ខេត្ត, ក្រុង-ស្រុក-ខណ្ឌ និងឃុំ-សង្កាត់។",
        },
        {
          code: "R36",
          name: "របាយការណ៍ស្ថានភាពគណនីធនាគារ",
          englishName: "Bank Balance Report", entityUsed: "GDNT, PT",
          description: "របាយការណ៍ស្ថានភាពគណនីធនាគារ គឺជារបាយការណ៍ដែលបង្ហាញពីចលនាសាច់ប្រាក់ឥណពន្ធ ឥណទាន និងសមតុល្យដើមគ្រា ចុងគ្រារបស់គណនីធនាគារនីមួយៗ។ របាយការណ៍នេះ ចាប់យកទិន្ន័យប្រតិបត្តិការសរុបប្រចាំថ្ងៃ ឬប្រចាំខែ ដែលបានបញ្ចប់រួចរាល់ត្រឹមត្រូវចូលទៅក្នុងសៀវភៅធំ។",
        },
        {
          code: "R39",
          name: "របាយការណ៍ប្រតិបត្តិការសៀវភៅធំ",
          englishName: "GL Transaction", entityUsed: "GDNT, PT",
          description: "របាយការណ៍ប្រតិបត្តិការសៀវភៅធំ គឺជារបាយការណ៍ដែលបង្ហាញពីបញ្ជីឈ្មោះ និងព័ត៌មានទិន្នានុប្បវត្តិដែលនឹងត្រូវបានប្រើដោយឡែកពីគ្នា។ បញ្ជីវិភាគ (Ledger) បង្ហាញចលនា និងសមតុល្យនៃលេខកូដសេដ្ឋកិច្ច (អនុគណនី) នៃកាលបរិច្ឆេទគណនេយ្យ។ ចំណែកឯទិន្នានុប្បវត្តិ (Journal) នឹងបង្ហាញចំនួនប្រតិបត្តិការ និងសរុបនៃកាលបរិច្ឆេទគណនេយ្យ។",
        },
        {
          code: "R42",
          name: "របាយការណ៍ចំណាយតាមជំពូក-កម្មវិធី",
          englishName: "Budget Expenditure Report", entityUsed: "LM, GDB",
          description: "របាយការណ៍ចំណាយតាមជំពូក-កម្មវិធី គឺជាការត្រួតពិនិត្យរបាយការណ៍ថ្នាក់ជាតិ ដែលមានដូចជា៖ ច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ឥណទានកែតម្រូវ និងការអនុវត្តថវិកាទៅតាមប្រភេទចំណាយនៃមាតិកាថវិកាតាមកម្មវិធី និងតាមជំពូកនៃចំណាត់ថ្នាក់សេដ្ឋកិច្ចរបស់អង្គភាពនីមួយៗនៃក្រសួង-ស្ថាប័ន។",
        },
        {
          code: "R43",
          name: "របាយការណ៍ចំណាយមូលធនតាមគម្រោង",
          englishName: "Capital Expenditure by Project Report", entityUsed: "LM, GDNT, GDICDM, DI",
          description: "របាយការណ៍ចំណាយមូលធនតាមគម្រោង គឺជារបាយការណ៍ថ្នាក់ជាតិសម្រាប់ចំណាយថវិកាវិនិយោគសាធារណៈពីប្រភពហិរញ្ញប្បទានដោយថវិកាជាតិ និងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍ដោយបង្ហាញទៅតាមជំពូកនៃចំណាត់ថ្នាក់សេដ្ឋកិច្ចរបស់អង្គភាពនីមួយៗនៃក្រសួង-ស្ថាប័ន។ របាយការណ៍នេះមានបង្ហាញរូបិយប័ណ្ណជារៀល និងរូបិយប័ណ្ណបរទេសទៅតាមប្រតិបត្តិការជាក់ស្តែង។",
        },
        {
          code: "R44",
          name: "របាយការណ៍ចំណាយសង្ខេបតាមកម្មវិធី",
          englishName: "Expenditure by Program Report", entityUsed: "LM, GDB, GDICDM, DI, DEF",
          description: "របាយការណ៍ចំណាយសង្ខេបតាមកម្មវិធី គឺជារបាយការណ៍ចំណាយសង្ខេបថ្នាក់ជាតិដែលមានដូចជាច្បាប់ហិរញ្ញវត្ថុ ឥណទានកែតម្រូវ និងការអនុវត្តថវិកាតាមប្រភេទចំណាយនៃមាតិកាតាមកម្មវិធីរបស់អង្គភាពនីមួយៗនៃក្រសួង-ស្ថាប័ន។",
        },
        {
          code: "R53",
          name: "របាយការណ៍តាមដានមូលប្បទាន",
          englishName: "Cheque Report", entityUsed: "GDICDM, GDNT, PT",
          description: "របាយការណ៍ស្ថានភាពគណនីធនាគារ គឺជារបាយការណ៍ដែលបង្ហាញអំពីស្ថានភាពសន្លឹកសែកទៅតាមអង្គភាពការងារ ធនាគារ គណនីធនាគារ និងកាលបរិច្ឆេទ ។ របាយការណ៍នេះបង្កើតឡើងក្នុងគោលបំណងសម្រាប់ផ្ដល់ឱ្យអ្នកប្រើប្រាស់ងាយស្រួលក្នុងការតាមដានលើសន្លឹកសែកដែលបានបើកផ្ដល់ឱ្យអតិថិជនដូចជា សែកបានដកប្រាក់ពីធនាគារហើយ និងសែកដែលពុំទាន់ដកប្រាក់ពីធនាគារ ហើយរបាយការណ៍នេះក៏បានបង្ហាញពីកាលបរិច្ឆេទចេញសែក និងកាលបរិច្ឆេទដកប្រាក់។",
        },
        {
          code: "R59",
          name: "របាយការណ៍អនុវត្តថវិកាថ្នាក់ជាតិ",
          englishName: "Report Budget Execution", entityUsed: "DEF",
          description: "របាយការណ៍អនុវត្តថវិកាថ្នាក់ជាតិ(មន្ទីរជំនាញ) គឺជារបាយការណ៍តាមដានតាមកាលបរិចេ្ឆទជាក់លាក់ ដែលបង្ហាញតាមជំពូក វិស័យតាមមន្ទីរជំនាញ, រដ្ឋបាលរាជធានី-ខេត្ត, រដ្ឋបាលក្រុង-ស្រុក នូវស្ថានភាពធានាចំណាយ និងស្ថានភាពអាណត្តិបើកប្រាក់របស់មន្ទីរជំនាញ ឬ រដ្ឋបាលថ្នាក់ក្រោមជាតិ។",
        },
        {
          code: "R60",
          name: "របាយការណ៍ចំណាយតាមមូលនិធិ",
          englishName: "Capital Exp. By Fund Report", entityUsed: "GDNT, GDICDM, DI",
          description: "របាយការណ៍ចំណាយតាមមូលនិធិ គឺជារបាយការណ៍ស្តីពីចំណាយតាមមូលនិធិនៃមាតិកាថវិកាដែលបង្ហាញនូវច្បាប់ហិរញ្ញវត្ថុ និងចំណាយអនុវត្តជារូបិយប័ណ្ណរៀល និង ដុល្លារ។",
        },
        {
          code: "R63",
          name: "Bidder Application Fees",
          englishName: "Bidder Application Fees", entityUsed: "GDPP, LM",
          description: "Bidder Application Fees គឺជារបាយការណ៍ដើម្បីទទួលបានព័ត៌មានក្នុងការដេញថ្លៃនៃក្រុមហ៊ុនណាមួយដោយបង្ហាញនូវឈ្មោះក្រុមហ៊ុន លេខចុះបញ្ជី សុពលភាព និងទឹកប្រាក់នៃការដេញដែលមានយោងនូវកម្មវត្ថុតាមកាលបរិចេ្ឆទនៃការទាញយករបាយការណ៍នេះ។",
        },
        {
          code: "R64",
          name: "របាយការណ៍លទ្ធផល",
          englishName: "GDNT Income Statement", entityUsed: "GDNT, PT",
          description: "របាយការណ៍លទ្ធផល គឺជារបាយការណ៍ដែលស្តីពីលទ្ធផលនៃការអនុវត្តចំណូលចំណាយថវិកាចរន្ត និងលទ្ធផលអតិរេករបស់រដ្ឋបាលថ្នាក់ក្រោមជាតិតាមកាលបរិច្ឆេទកំណត់នៃការទាញរបាយការណ៍។",
        },
        {
          code: "R65",
          name: "របាយការណ៍ចំណាយសម្រាប់ក្រសួងនិងមន្ទីរ",
          englishName: "Exp. Report for LM & DEF", entityUsed: "LM, DEF",
          description: "របាយការណ៍ចំណាយសម្រាប់ក្រសួងនិងមន្ទីរ គឺជារបាយការណ៍ចំណាយថវិការបស់រដ្ឋបាលថ្នាក់ជាតិ។ របាយការណ៍នេះមានការកំណត់លក្ខខណ្ឌចាប់យកទិន្នន័យត្រឹមអង្គភាពសាមី គឺនៅរាល់ពេលដែលអ្នកអនុម័តនៅក្នុងអង្គភាពសាមីបានអនុម័តប្រតិបត្តិការអាណត្តិដែលបានចុះចូលទៅក្នុងFMIS រួច នោះទិន្នន័យនឹងទាញចូលទៅក្នុងរបាយការណ៍នេះ។",
        },
        {
          code: "R66",
          name: "របាយការណ៍ចំណូលចំណាយក្រោមជាតិ",
          englishName: "Rev. and Exp. For Sub", entityUsed: "DEF, PV, DS",
          description: "របាយការណ៍ចំណូលចំណាយថ្នាក់ក្រោមជាតិ គឺជារបាយការណ៍បូកសរុបចំណូលចំណាយថវិកាសម្រាប់រដ្ឋបាលថ្នាក់ក្រោមជាតិ។ របាយការណ៍នេះមានការកំណត់លក្ខខណ្ឌចាប់យកទិន្នន័យត្រឹមអង្គភាពសាមី គឺនៅរាល់ពេលដែលអ្នកអនុម័តនៅក្នុងអង្គភាពសាមីបានអនុម័តប្រតិបត្តិការអាណត្តិដែលបានចុះចូលទៅក្នុង FMIS រួច នោះទិន្នន័យនឹងទាញចូលទៅក្នុងរបាយការណ៍នេះ។",
        },
        {
          code: "R68",
          name: "Procurement Plan Report",
          englishName: "Procurement Plan Report", entityUsed: "LM",
          description: "Procurement Plan Report គឺជារបាយការណ៍បញ្ជាក់អំពីការបង្កើត និងលក្ខណៈជាក់លាក់នៃផែនការលទ្ធកម្ម ដែលមានដូចជាប្រភេទ និងមុខសញ្ញាលទ្ធកម្ម គម្រោងវិធីសាស្រ្ត រយៈពេលនៃការរៀបចំឯកសារ កាលបរិចេ្ឆទប្រគល់ទទួល និងព័ត៌មានចាំបាច់ផ្សេងៗនៃការអនុវត្តផែនការលទ្ធកម្ម។",
        },
        {
          code: "R70",
          name: "របាយការណ៍ចំណាយមូលធនថ្នាក់ជាតិ",
          englishName: "Table B1.1 Inv Pro Rep", entityUsed: "DI",
          description: "របាយការណ៍ចំណាយមូលធនថ្នាក់ជាតិ គឺជារបាយការណ៍ចំណាយវិនិយោគដែលបង្ហាញពីច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ឥណទានកែតម្រូវ ថវិកាអនុវត្ត និងឥណទាននៅសល់របស់អង្គភាពនីមួយៗដែលមានដូចជាបណ្តាក្រសួង-ស្ថាប័ន និងមន្ទីរជំនាញនីមួយៗ។",
        },
        {
          code: "R72",
          name: "របាយការណ៍កិច្ចសន្យា",
          englishName: "Contract Award Report", entityUsed: "LM",
          description: "របាយការណ៍កិច្ចសន្យា គឺជារបាយការណ៍គូសបញ្ជាក់អំពីការបង្កើត និង លក្ខណៈជាក់លាក់នៃ របាយការណ៍កិច្ចសន្យាអ្នកផ្គត់ផ្គង់។ របាយការណ៍នេះត្រូវបានបោះពុម្ពដោយផ្អែកលើការកែប្រែចុងក្រោយនៃកិច្ចសន្យា។ កិច្ចសន្យាត្រូវតែត្រូវបានអនុម័ត ហើយកំណែស្ថានភាពបច្ចុប្បន្ន។",
        },
        {
          code: "R109",
          name: "សលាកបត្រតាមដានចំណាយថវិកា",
          englishName: "Budget Expenditure Slip", entityUsed: "GDNT, LM, LD, PT, DEF, PV, DS,, CO",
          description: "សលាកបត្រតាមដានចំណាយថវិកា គឺជារបាយការណ៍គណនេយ្យថវិកា (Budgetary Accounting)  ស្របតាមប្រកាស ៩៩0 សហវ.ប្រក.អរតន ដែលបង្ហាញអំពីព័ត៌មានពីប្រតិបត្តិការចំណាយទៅតាម ប្រភេទអនុគណនី ដែលបានធ្វើការទូទាត់រួចរាល់ក្នុង FMIS ។ ជាមួយគ្នានេះដែរ របាយការណ៍នេះបង្ហាញពី ចលនាឥណទាន (Budget Movement) ការចំណាយដែលបានទូទាត់ជាក់ស្តែងទៅតាមថ្ងៃ ខែ ឆ្នាំ និង លេខយោង ( អាណត្តិ, ការចុះកែតម្រវ, ការបង់សំណែសចំណាយក្នុងឆ្នាំ និង ការចុះបុរេប្រទានដែលចម្លងមកពីការបញ្ជាទិញ) និង ឥណទានទំនេរ​។",
        },
        {
          code: "R111",
          name: "របាយការណ៍ចំណាយថវិកាថ្នាក់ជាតិ",
          englishName: "National Expense Report", entityUsed: "GDNT, LM, LD, PT, DEF",
          description: "របាយការណ៍ចំណាយថវិកាថ្នាក់ជាតិ គឺជារបាយការណ៍គណនេយ្យថវិកា ​(Budgetary Accounting) ស្របតាមប្រកាស ៩៩0 សហវ.ប្រក.អរតន ដែលបង្ហាញអំពីព័ត៌មានពីប្រតិបត្តិការចំណាយទៅតាមប្រភេទនៃចំណាយ និង អនុគណនី ដែលបានធ្វើការទូទាត់រួចរាល់ក្នុង FMIS  ។ ទន្ទឹមនឹងនេះ របាយការណ៍នេះបង្ហាញពី ច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន​ ច្បាប់ហិរញ្ញវត្ថុកែតម្រូវ  ការអនុវត្ត ដែលបានទូទាត់ជាក់ស្តែង( អាណត្តិ, ការចុះកែតម្រូវ, ការបង់សំណែសចំណាយក្នុងឆ្នាំ និង ការចុះបុរេប្រទានដែលចម្លងមកពីការបញ្ជាទិញ) ឥណទាននៅសល់ និង ការប្រៀបធៀប (គិតជាភាគរយ)។",
        },
        {
          code: "R112",
          name: "របាយការណ៍ចំណាយថវិកាថ្នាក់ក្រោមជាតិ",
          englishName: "Subnational Expenditure Report", entityUsed: "PT, PV, DS, CO",
          description: "របាយការណ៍ចំណាយថវិកាថ្នាក់ក្រោមជាតិ គឺជារបាយការណ៍គណនេយ្យថវិកា ​(Budgetary Accounting) ស្របតាមប្រកាស ៩៩0 សហវ.ប្រក.អរតន ដែលបង្ហាញអំពីព័ត៌មានពីប្រតិបត្តិការចំណាយតាមប្រភេទនៃចំណាយដែលបានធ្វើការទូទាត់រួចរាល់ក្នុង FMIS  ។ របាយការណ៍នេះបង្ហាញពី ច្បាប់ហិរញ្ញវត្ថុកែតម្រូវ  ការអនុវត្ត ដែលបានទូទាត់ជាក់ស្តែង( អាណត្តិ, ការចុះកែតម្រូវ, ការបង់សំណែសចំណាយក្នុងឆ្នាំ និង ការចុះបុរេប្រទានដែលចម្លងមកពីការបញ្ជាទិញ) និង ការប្រៀបធៀប (គិតជាភាគរយ)។",
        },
        {
          code: "R113",
          name: "របាយការណ៍ទទួលស្គាល់ចំណាយថ្នាក់ជាតិ",
          englishName: "National Budgetary and General Expenditure Report", entityUsed: "GDNT, PT",
          description: "របាយការណ៍ទទួលស្គាល់ចំណាយថ្នាក់ជាតិ គឺជារបាយការណ៍ដែលបង្ហាញអំពីព័ត៌មានពីប្រតិបត្តិការចំណាយទៅតាម អនុគណនីនិមួយៗ ដែលបានកត់ត្រាទៅតាមមូលដ្ឋានបង្គរ (General Accounting) និង មូលដ្ឋានសាច់ប្រាក់ (Budgetary Accounting) ដែលជាទិន្នន័យបានធ្វើការទូទាត់រួចរាល់ក្នុង FMIS ។ របាយការណ៍នេះបង្ហាញពី ចលនាឥណទាន ការអនុវត្ត របស់អង្គភាពប្រតិបត្តិតាមគណនេយ្យបង្គរ និង គណនេយ្យសាច់ប្រាក់ ទៅតាមអនុគណនីមួយៗ។",
        },
        {
          code: "R114",
          name: "របាយការណ៍សរុបរួមស្តីពីស្ថានភាពគណនីត្រូវសង",
          englishName: "Total Expenditure Report", entityUsed: "GDNT, LM, PT, DEF, PV, DS",
          description: "គឺជារបាយការណ៍គណនេយ្យបង្គរ (General Accounting) ស្របតាមប្រកាសលេខ ១១៤៨ សហវ ប្រក.អរតន ដែលបង្ហាញអំពីព័ត៌មាន ស្ថានភាពគណនីត្រូវសង តាមប្រភេទនៃចំណាយនីមួយៗ ឬ សម្រាប់តាមដានសមតុល្យសរុបនៃគណនីត្រូវសង សម្រាប់ថ្នាក់ជាតិ និង ថ្នាក់ក្រោមជាតិ (របស់រាជរដ្ឋាភិបាលកម្ពុជា) និង បានបែងចែកជា ២ ទម្រង់ផ្សេងគ្នា៖\n- ទម្រង់ទី១៖ ស្ថានភាពគណនីត្រូវសងសម្រាប់ក្រសួង-ស្ថាប័ន របាយការណ៍នេះបង្ហាញពី គណនីត្រូវសងតាមប្រភេទចំណាយ សមតុល្យដើមគ្រា គណនីត្រូវសងដែលបានកើតឡើងក្នុងឆ្នាំ គណនីត្រូវសងដែលបានទូទាត់ក្នុងឆ្នាំ គណនីត្រូវសងដែលបានលុបចេញក្នុងឆ្នាំ ការកែតម្រូវ និង សមតុល្យចុងគ្រា ។\n- ទម្រង់ទី២៖ ស្ថានភាពគណនីត្រូវសងរបស់រាជរដ្ឋាភិបាលកម្ពុជា របាយការណ៍នេះបង្ហាញពីបំណុលដែលពុំទាន់ធ្វើការទូទាត់ ទាំងថ្នាក់ជាតិ និង ថ្នាក់ក្រោមជាតិ ។",
        },
        {
          code: "R115",
          name: "តារាងផ្ទៀងផ្ទាត់ចំណេញ/ខាតពីអត្រាប្តូរប្រាក់",
          englishName: "Exchange Rate Report", entityUsed: "GDNT, PT",
          description: "តារាងផ្ទៀងផ្ទាត់ចំណេញ/ខាតពីអត្រាប្តូរប្រាក់ គឺជារបាយការណ៍ផ្ទៀងផ្ទាត់ចំណេញ/ខាតពីអត្រាប្តូរប្រាក់ ស្របតាមប្រកាសលេខ ៩៩១ សហវ ប្រក.អរតន​ ដែលបង្ហាញអំពីព័ត៌មានពីរំហូរ ដំណើរការ និងការរាយការណ៍ឥទ្ធិពលនៃការប្រែប្រួលអត្រាប្តូរប្រាក់រូបិយបណ្ណបរទេស (ចំណេញខាតពិតពីអត្រាប្តូរប្រាក់​ ៦៦៩៨១/​៧៦០៦១ និង ចំណេញខាតមិនពិតពីអត្រាប្តូរប្រាក់ ៦៦៩៨២/​៧៦០៦២)។",
        },
        {
          code: "R118",
          name: "របាយការណ៍បូកសរុបចំណាយថវិកាសម្រាប់រដ្ឋបាលថ្នាក់ក្រោមជាតិ",
          englishName: "Consolidation Expenditure Report for Sub-National", entityUsed: "GDSNAF",
          description: "របាយការណ៍បូកសរុបចំណាយថវិកាសម្រាប់រដ្ឋបាលថ្នាក់ក្រោមជាតិ គឺជារបាយការណ៍ដែលបង្ហាញអំពីព័ត៌មានចំណូលចំណាយ ថ្នាក់ក្រោមជាតិ ដែលអង្គភាពបានអនុវត្តទៅតាមប្រភេទចំណាយ​ នៃអនុគណនី។ របាយការណ៍នេះគឺបង្ហាញទិន្នន័យច្បាប់ហិរញ្ញវត្ថុ, ចលនាឥណទានថវិកា, ការអនុវត្តចំណាយ/ការអនុវត្តចំណូល (ដើមគ្រា, ក្នុងគ្រា និង ចុងគ្រា) ឥណទាននៅសល់ ដែលបង្ហាញតាមមាតិកាសេដ្ឋកិច្ច និងការប្រៀបធៀប (គិតជាភាគរយ)។",
        },
        {
          code: "R120",
          name: "របាយការណ៍ចំណាយសង្ខេបសរុបរួម សម្រាប់គម្រោងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍",
          englishName: "Consolidation External Fund Report", entityUsed: "LM, LD, GDICDM, GDNT",
          description: "របាយការណ៍ចំណាយសង្ខេបសរុបរួម សម្រាប់គម្រោងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍ គឺជារបាយការណ៍ចំណាយសរុប សម្រាប់គម្រោងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍ ដែលបង្ហាញពីឈ្មោះគម្រោង ប្រភពដៃគូអភិវឌ្ឍ ក៏ដូចជាចំណាយជាក់ស្តែងទៅតាមប្រភពហិរញ្ញប្បទាន។",
        },
        {
          code: "R121",
          name: "របាយការណ៍ចំណាយថវិកាតាមជំពូក គណនី អនុគណនី របស់គម្រោងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍",
          englishName: "External Fund Expense Statement Report", entityUsed: "LM, LD, GDICDM, GDNT",
          description: "របាយការណ៍ចំណាយថវិកាតាមជំពូក គណនី អនុគណនី របស់គម្រោងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍ គឺជារបាយការណ៍ចំណាយតាមជំពូក គណនី អនុគណនី សម្រាប់គម្រោងហិរញ្ញប្បទានពីដៃគូអភិវឌ្ឍន៍ ដែលបង្ហាញពីផែនការប្រចាំឆ្នាំ ក៏ដូចជាចំណាយជាក់ស្តែងទៅតាមប្រភពហិរញ្ញប្បទាន។",
        },
        {
          code: "R122",
          name: "របាយការណ៍ចំណាយវិនិយោគសាធារណដោយហិរិញ្ញប្បទានក្រៅប្រទេស",
          englishName: "External Financing Expenditure Report", entityUsed: "LM, LD, GDICDM, GDNT",
          description: "របាយការណ៍ចំណាយវិនិយោគសាធារណដោយហិរិញ្ញប្បទានក្រៅប្រទេស គឺជារបាយការណ៍ចំណាយវិនិយោគសាធារណៈដោយហិរិញ្ញប្បទានក្រៅប្រទេស របស់ក្រសួង-ស្ថាប័ននីមួយៗ ដែលបង្ហាញពីឈ្មោះគម្រោង ក៏ដូចជាអនុវត្តជាក់ស្តែងទៅតាមគម្រោងនីមួយៗផងដែរ។",
        },
        {
          code: "R116",
          name: "របាយការណ៍ត្រួតពិនិត្យចំណាយថវិការដ្ឋ (ក្រសួង និង មន្ទីរជំនាញ)",
          englishName: "National Budget Execution Report", entityUsed: "LM, DEF, GDB, GDNT",
          description: "របាយការណ៍ត្រួតពិនិត្យចំណាយថវិការដ្ឋ (ក្រសួង និង មន្ទីរជំនាញ) គឺជារបាយការណ៍សម្រាប់តាមដានព័ត៌មាន និងត្រួតពិនិត្យការអនុវត្តថវិកាប្រចាំឆ្នាំរបស់ក្រសួង-ស្ថាប័នតាមប្រភេទនៃចំណាយ និងតាមអនុគណនី។ របាយការណ៍នេះបង្ហាញពីការអនុវត្តថវិការបស់អង្គភាពដូចជា៖ ជំពូក គណនី អនុគណនី កម្មវិធី ចំណាត់ថ្នាក់ចំណាយ ច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ឥណទានក្រោយវិចារណកម្ម សរុបធានាចំណាយ ការអនុវត្តជាក់ស្តែង(អាណត្តិចេញពីសាមីអង្គភាពដែលទទួលស្គាល់ត្រឹមការអនុម័តអាណាប័ក) និង ឥណទាននៅសល់។",
        },
        {
          code: "R123",
          name: "សលាកបត្រតាមដានចំណូលថវិកា",
          englishName: "Budget Revenue Slip", entityUsed: "LM, LD, GDNT, PT",
          description: "សលាកបត្រតាមដានចំណូលថវិកា គឺជារបាយការណ៍គណនេយ្យថវិកា (Budgetary Accounting) ស្របតាមប្រកាស ៩៩0 ប្រក.អរតន ដែលបង្ហាញអំពីព័ត៌មានពីប្រតិបត្តិការចំណូលថវិកាទាំងអស់ផ្អែកតាមឈ្មោះអតិថិជន ដែលអគ្គនាយកដ្ឋានរតនាគារជាតិ និងរតនាគាររាជធានី-ខេត្តបានទទួលចំណូលជាសាច់ប្រាក់រួចរាល់។ របាយការណ៍នេះបង្ហាញពីលេខសលាកបត្រ​ កាលបរិច្ឆេទចុះបញ្ជី សរុបទឹកប្រាក់ និងអនុគណនី។",
        },
      ],
    },
    {
      id: "budgetExec",
      name: "របាយការណ៍អនុវត្តថវិកា - Budget Execution Report",
      reports: 2,
      details: [
        {
          code: "R83",
          name: "តារាងសរុបចំណូលចំណាយថវិកា",
          englishName: "Consolidate R&E for SubNational", entityUsed: "GDSNAF, DEF",
          description: "តារាងសរុបចំណូលចំណាយថវិកា គឺជារបាយការណ៍ឆ្លុះបញ្ចាំងពីការបូកសរុបនៃចំណូល និងចំណាយរបស់រដ្ឋបាលរាជធានី-ខេត្ត, ក្រុង-ស្រុក-ខណ្ឌ និងឃុំ-សង្កាត់ដោយបានអភិវឌ្ឍន៍យោងតាមសារាចរអនុវត្តថ្នាក់ក្រោមជាតិប្រចាំឆ្នាំ ដែលអាចឱ្យអ្នកប្រើប្រាស់ដើម្បីត្រួតពិនិត្យ និងពិនិត្យរៀងរាល់ត្រីមាស, ពាក់កណ្តាលឆ្នាំ ឬប្រចាំឆ្នាំ។",
        },
        {
          code: "R117",
          name: "របាយការណ៍ចំណាយថវិកាកម្មវិធី",
          englishName: "Expenditure Report by Program", entityUsed: "GDNT, LM, PT, DEF, PV, DS",
          description: "របាយការណ៍ចំណាយថវិកាកម្មវិធី គឺជារបាយការណ៍ស្របតាមសារាចរ ការអនុវត្តច្បាប់ស្តីពីហិរញ្ញវត្ថុសម្រាប់ការគ្រប់គ្រងឆ្នាំ ២០២៦​ លេខ០២១ សហវ សរអថ ដែលបង្ហាញអំពីព័ត៌មានការគ្រប់គ្រងចំណាយថវិកាកម្មវិធីសរុបតាមកម្មវិធី អនុកម្មវិធី និងចង្កោមសកម្មភាពទៅតាមជំពូកនីមួយៗ ដែលក្រសួង-ស្ថាប័នបានអនុវត្តថវិកា ធៀបនឹងស្ថានភាពបើកសាច់ប្រាក់ពីរតនាគារ។ របាយការណ៍នេះបង្ហាញពីចំណាត់ថ្នាក់ចំណាយ ច្បាប់ហិរញ្ញវត្ថុ ឥណទានវិចារណកម្ម ឥណទានថ្មី ស្ថានភាពអាណត្តិបើកប្រាក់ចេញពីសាមីអង្គភាព ស្ថានភាពបើកសាច់ប្រាក់ពីរតនាគារ និង អាណត្តិកកស្ទះនៅរតនាគារ។",
        },
      ],
    },
    {
      id: "budgetClosing",
      name: "របាយការណ៍បិទបញ្ជី - Budget Closing Report",
      reports: 1,
      details: [
        {
          code: "R87",
          name: "របាយការណ៍ចំណាយថវិកាថ្នាក់ជាតិ",
          englishName: "National Budget Expenditure Report", entityUsed: "LM, DEF",
          description: "របាយការណ៍ចំណាយថវិកាថ្នាក់ជាតិ គឺជារបាយការណ៍ចំណាយថវិការបស់ថ្នាក់ជាតិ (ក្រសួង-ស្ថាប័ន និង មន្ទីរ) ដែលត្រូវធ្វើការផ្ទៀងផ្ទាត់នៅពេលបិទបញ្ជីចុងឆ្នាំនៃការអនុវត្តថវិកា។ ជាមួយគ្នានេះដែររបាយការណ៍នេះអភិវឌ្ឍស្របតាមសារាចរបិទបញ្ជីប្រចាំឆ្នាំ។",
        },
      ],
    },
    {
      id: "settlementLaw",
      name: "របាយការណ៍ច្បាប់ទូទាត់ - Budget Settlement Law Report",
      reports: 15,
      details: [
        {
          code: "R12",
          name: "របាយការណ៍តារាង គ១",
          englishName: "Table C1 Report", entityUsed: "GDNT",
          description: "របាយការណ៍តារាង គ១ គឺជារបាយការណ៍ស្តីពីសរុបរួមចំណាយថវិកាថ្នាក់ជាតិ និងថ្នាក់ក្រោមជាតិទូទាំងប្រទេស ដែលមានបង្ហាញនូវព័ត៌មានច្បាប់ហិរញ្ញវត្ថុ ចលនាឥណទាន ឥណទានកែតម្រូវ ថវិកាអនុវត្តនិងឥណទាននៅសល់របស់អង្គភាពនីមួយៗ។ របាយការណ៍នេះ បាននូវចំណាយថវិកាចរន្ត និងមូលធនតាមជំពូកទៅតាមក្រសួង-ស្ថាប័នដែលមានបែងចែកតាមវិស័យទាំងបួនដូចជា វិស័យរដ្ឋបាលទូទៅ វិស័យការពារជាតិ និងសន្តិសុខ វិស័យសង្គមកិច្ច និង វិស័យសេដ្ឋកិច្ច។",
        },
        {
          code: "R37",
          name: "របាយការណ៍អនុវត្តថវិកាតារាង ខ១",
          englishName: "Annual Budget Execution", entityUsed: "GDNT",
          description: "របាយការណ៍អនុវត្តថវិកាតារាង ខ១ គឺជារបាយការណ៍យោងនៅក្នុងច្បាប់ទូទាត់ថវិកាប្រចាំឆ្នាំ ដែលនៅក្នុងរបាយការណ៍នេះបង្ហាញទៅលើទិន្នន័យចំណូលសរុបថ្នាក់ជាតិប្រចាំឆ្នាំធៀបនឹងចំណូលថវិកាដែលបានគ្រោង។",
        },
        {
          code: "R45",
          name: "តារាងឧបសម្ព័ន្ធ ៣",
          englishName: "Annex 3", entityUsed: "GDNT",
          description: "តារាងឧបសម្ព័ន្ធ៣ គឺជារបាយការណ៍បូកសរុបចំណាយចរន្តថវិកាថ្នាក់ជាតិ និង ថ្នាក់ក្រោមជាតិដែលបានបែងចែកតាមជំពូក និង តាមខែដែលមានដូចជា ការកើនឡើងចលនាថវិកា ថវិកាសរុបកើនឡើង ការផ្ទេរថវិកា និងការផ្ទេរថវិកាសរុបរបស់អង្គភាពនីមួយៗ។",
        },
        {
          code: "R46",
          name: "តារាងឧបសម្ព័ន្ធ ៦",
          englishName: "Annex 6 Report", entityUsed: "GDNT",
          description: "តារាងឧបសម្ព័ន្ធ៦ គឺជារបាយការណ៍ចំណាយថវិកាថ្នាក់ជាតិ និង ថ្នាក់ក្រោមជាតិនៃការបែងចែកចំណាយតាមផ្នែក ក្រសួង-ស្ថាប័ន រចនាសម្ព័ន្ធ ការប្រែប្រួលភាគរយផសសរបស់អង្គភាពនីមួយៗ។",
        },
        {
          code: "R47",
          name: "តារាង ខ២-ខ៣-ខ៤",
          englishName: "Table B2-B3-B4", entityUsed: "GDNT",
          description: "តារាង ខ២-ខ៣-ខ៤ គឺជារបាយការណ៍យោងនៅក្នុងច្បាប់ទូទាត់ថវិកាប្រចាំឆ្នាំ ដែលនៅក្នុងរបាយការណ៍នេះបង្ហាញទៅលើទិន្នន័យចំណូលសរុបថ្នាក់ក្រោមជាតិប្រចាំឆ្នាំធៀបនឹងចំណូលថវិកាដែលបានគ្រោង។",
        },
        {
          code: "R48",
          name: "តារាងឧបសម្ព័ន្ធ២",
          englishName: "Annex 2 Report", entityUsed: "GDNT",
          description: "តារាងឧបសម្ព័ន្ធ២ គឺជារបាយការណ៍យោងនៅក្នុងច្បាប់ទូទាត់ថវិកាប្រចាំឆ្នាំ ដែលបង្ហាញនូវសរុបរួមចំណាយថវិកាថ្នាក់ជាតិ និង ថ្នាក់ក្រោមជាតិរបស់អង្គភាពនីមួយៗ ដែលអាចតាមដានប្រចាំខែ និងប្រចាំឆ្នាំ។",
        },
        {
          code: "R49",
          name: "តារាងឧបសម្ព័ន្ធ ៨",
          englishName: "Annex 8 Report", entityUsed: "GDNT",
          description: "តារាងឧបសម្ព័ន្ធ ៨ គឺជារបាយការណ៍ចំណាយថវិកាទូទៅរបស់រដ្ឋយោងច្បាប់ទូទាត់ប្រចាំឆ្នាំដែលមានបង្ហាញនូវច្បាប់ហិរញ្ញវត្ថុ ការអនុវត្តថវិកានៅឆ្នាំអនុវត្ត និង ឆ្នាំ N-1 ដែលបានបែងចែកចំណាយតាមផ្នែករបស់ក្រសួង-ស្ថាប័ន មន្ទីរជំនាញ និងរដ្ឋបាលថ្នាក់ក្រោមជាតិ ព្រមទាំងការប្រែប្រួលភាគរយផសសរបស់អង្គភាពនីមួយៗ។",
        },
        {
          code: "R50",
          name: "តារាង គ២",
          englishName: "Table C2", entityUsed: "GDSNAF, GDNT",
          description: "តារាង គ២ គឺជារបាយការណ៍ចំណាយវិនិយោគសាធារណៈដោយហរិញ្ញប្បទានគ្រប់ក្រសួង-ស្ថាប័នសម្រាប់ថ្នាក់ជាតិដែលមានដូចជាគម្រោងវិនិយោគ មូលនិធិបដិភាគ វិនិយោគដោយមូលនិធិទ្រទ្រង់ថវិកាតាមច្បាប់ហិរញ្ញវត្ថុដែលអាចតាមដានប្រចាំខែ និងប្រចាំឆ្នាំ។",
        },
        {
          code: "R54",
          name: "តារាង គ៤",
          englishName: "Table C4 Report", entityUsed: "GDNT, PT",
          description: "តារាង គ៤ គឺជារបាយការណ៍យោងនៅក្នុងច្បាប់ទូទាត់ថវិកាប្រចាំឆ្នាំដែលបង្ហាញអំពីចំណាយថវិកាថ្នាក់ក្រោមជាតិដែលក្នុងនោះមានបង្ហាញថវិកាចំណាយចរន្ដ ចំណាយមូលធនដែលបានអនុវត្តធៀបនឹងឥណទានកែតម្រូវ។",
        },
        {
          code: "R55",
          name: "តារាងឧបសម្ព័ន្ធ ៧",
          englishName: "Annex 7 Report", entityUsed: "GDNT",
          description: "តារាងឧបសម្ព័ន្ធ ៧ នេះគឺដើម្បីគូសបញ្ជាក់អំពីការបង្កើត និងលក្ខណៈជាក់លាក់នៃរបាយ-ការណ៍តារាង B ដែលត្រូវប្រើប្រាស់ដោយថ្នាក់ដឹកនាំ។ តារាងឧបសម្ព័ន្ធ ៧ នេះផ្តល់ព័ត៌មានដែលអ្នកប្រើប្រាស់អាចចូលប្រើបានដោយការបើកសិទ្ធិ និងដកករណីលើកលែងមួយចំនួន។",
        },
        {
          code: "R56",
          name: "តារាង ក១",
          englishName: "Table A1 Report", entityUsed: "GDNT",
          description: "តារាង ក១ គឺជាផ្នែកមួយនៃរបាយការណ៍ច្បាប់ទូទាត់ដែលបង្ហាញនូវទឹកប្រាក់ចំណូលសរុប និងចំណាយសរុបរបស់ថវិកាថ្នាក់ជាតិដែលរួមមានថវិការបស់ក្រសួង-ស្ថាប័ន និងថវិការបស់មន្ទីរជំនាញ។ នៅក្នុងរបាយការណ៍នេះនឹងបង្ហាញទៅលើទិន្នន័យចំណូលចំណាយឆ្លងកាត់រតនាគារដែលរួមមាន ចំណូលចំណាយចរន្ត និងមូលធន , មិនឆ្លងកាត់រតនាគារ ព្រមទាំងប្រៀបធៀបការអនុវត្តជាក់ស្តែងទៅនឹងច្បាប់ហិរញ្ញវត្ថុ។",
        },
        {
          code: "R57",
          name: "តារាង ក២",
          englishName: "Table A2 Report", entityUsed: "GDNT",
          description: "តារាង ក២ គឺជាផ្នែកមួយនៃរបាយការណ៍ច្បាប់ទូទាត់ដែលបង្ហាញទៅលើទឹកប្រាក់ចំណូលសរុប និងចំណាយសរុបរបស់ថវិកាថ្នាក់ជាតិដែលរួមមានថវិការបស់ក្រសួង-ស្ថាប័ន និង ថវិការបស់មន្ទីរជំនាញ។ នៅក្នុងរបាយការណ៍នេះបង្ហានូវញកិច្ចប្រតិបត្តិការថវិកាថ្នាក់ជាតិ ចំនួនទឹកប្រាក់អនុវត្ត តុល្យភាពហិរញ្ញប្បទាន អតិរេកនៃថវិកាចរន្ត និងឱនភាពថវិកាផងដែរ។",
        },
        {
          code: "R58",
          name: "របាយការណ៍ ក៣-ក៤-ក៥",
          englishName: "Table A3-A4-A5", entityUsed: "GDNT",
          description: "របាយការណ៍ក៣-ក៤-ក៥ ត្រូវបានប្រើជាឯកសារគាំទ្រសម្រាប់ការរៀបចំរបាយការណ៍ច្បាប់ស្តីពីការទូទាត់ថវិកា។ របាយការណ៍នេះផ្តល់ឱ្យនូវការចំណាយថវិកា និងចំណូលថវិកា អតិរេកថវិកា កិច្ចប្រតិបត្តិការនៅថ្នាក់ក្រោមជាតិដោយមិនរាប់បញ្ចូលមន្ទីរជំនាញ។",
        },
        {
          code: "R81",
          name: "តារាង គ៣",
          englishName: "Table C3", entityUsed: "GDICDM",
          description: "តារាង គ៣ គឺជារបាយការណ៍ចំណាយវិនិយោគសាធារណៈដោយហរិញ្ញប្បទានក្រៅប្រទេសគ្រប់ក្រសួងស្ថាប័នថ្នាក់ជាតិដែលមានដូចជាការអនុវត្តវិនិយោគដោយមូលនិធិទ្រទ្រង់ថវិកាតាមច្បាប់ហិរញ្ញវត្ថុ។",
        },
        {
          code: "R82",
          name: "តារាង គ៥",
          englishName: "Table C5 Report", entityUsed: "GDNT, GDSNAF",
          description: "តារាងគ៥ គឺជារបាយការណ៍ចំណាយរដ្ឋបាលថវិការាជធានី-ខេត្តដែលមានដូចជាច្បាប់ហិរញ្ញវត្ថុ, ការអនុវត្ត និងការប្រៀបធៀបរវាងសមតុល្យចុងគ្រាជាមួយច្បាប់ហិរញ្ញវត្ថុ។",
        },
      ],
    },
    {
      id: "standard",
      name: "របាយការណ៍ស្តង់ដារអន្តរជាតិ - Standard Report",
      reports: 5,
      details: [
        {
          code: "R29",
          name: "របាយការណ៍ចំណូលថវិកា IPSAS",
          englishName: "IPSAS Budget Income", entityUsed: "GDNT",
          description: "របាយការណ៍ចំណូលថវិកា IPSAS ជារបាយការណ៍ចំណូលសម្រាប់រាជរដ្ឋាភិបាលកម្ពុជាដែលប្រៀបធៀបថវិកាគ្រោងដែលជាច្បាប់ហិរញ្ញវត្ថុ និង ការអនុវត្តជាក់ស្តែង។ របាយការណ៍ហិរញ្ញវត្ថុនេះគឺជាលក្ខន្តិកៈ និង តម្រូវការអនុលោមតាមស្តង់ដារគណនេយ្យវិស័យសាធារណៈអន្តរជាតិ ហើយបច្ចុប្បន្នត្រូវបានរៀបចំលើថវិកាមូលដ្ឋានធៀបនឹងចំណូលជាក់ស្តែងតាមស្តង់ដារ IFRS។ របាយការណ៍នេះឆ្លុះបញ្ចាំងពីថវិកា និងចំណូលជាក់ស្តែងតាមវិស័យនានា (វិស័យរដ្ឋបាលទូទៅ វិស័យការពារជាតិនិងសន្តិសុខ វិស័យសង្គមកិច្ច និងវិស័យសេដ្ឋកិច្ច) ហើយរបាយការណ៍នេះនឹងគ្របដណ្តប់តែកម្រិតថវិការដ្ឋ (ក្រសួង និងនាយកដ្ឋានបន្ទាត់)។ របាយការណ៍ IPSAS អាចទាញជាប្រចាំឆ្នាំ ប្រចាំត្រីមាស និង ប្រចាំខែ រួមមាន ច្បាប់ហិរញ្ញវត្ថុ, ឥណទានកែតម្រូវ, ទឹកប្រាក់ជាក់ស្តែង និង ភាគរយធៀបនឹងច្បាប់ហិរញ្ញវត្ថុ។",
        },
        {
          code: "R30",
          name: "របាយការណ៍ចំណាយថវិកា IPSAS",
          englishName: "IPSAS Expenditure Report", entityUsed: "GDNT",
          description: "របាយការណ៍ចំណាយថវិកា IPSAS គឺជារបាយការណ៍ចំណាយសម្រាប់រាជរដ្ឋាភិបាលកម្ពុជាដែលប្រៀបធៀបថវិកាគ្រោង និងការអនុវត្តជាក់ស្តែង។ របាយការណ៍ហិរញ្ញវត្ថុនេះគឺជាលក្ខន្តិកៈ និងតម្រូវការអនុលោមតាមស្តង់ដារគណនេយ្យវិស័យសាធារណៈអន្តរជាតិ ហើយបច្ចុប្បន្នត្រូវបានរៀបចំលើថវិកាមូលដ្ឋានធៀបនឹងការចំណាយជាក់ស្តែងតាមស្តង់ដារ IFRS។ របាយការណ៍នេះឆ្លុះបញ្ចាំងពីថវិកា និងការចំណាយជាក់ស្តែងតាមវិស័យនានា (វិស័យរដ្ឋបាលទូទៅ វិស័យការពារជាតិនិងសន្តិសុខ វិស័យសង្គមកិច្ច និងវិស័យសេដ្ឋកិច្ច) ហើយរបាយការណ៍នេះនឹងគ្របដណ្តប់តែកម្រិតថវិការដ្ឋ។ របាយការណ៍នេះអាចទាញជាប្រចាំឆ្នាំ ប្រចាំត្រីមាស និងប្រចាំខែ។",
        },
        {
          code: "R40",
          name: "របាយការណ៍តារាងស្ថិតិចំណូល",
          englishName: "GFS Report Table 1", entityUsed: "GDPS",
          description: "របាយការណ៍តារាងស្ថិតិចំណូល គឺជារបាយការណ៍ដែលបង្ហាញពីការអនុវត្តចំណូលលម្អិតតាមបណ្តាខែអនុវត្តនីមួយៗ ដែលនៅក្នុងរបាយការណ៍នេះនឹងបង្ហាញជាគណនីសម្រាប់ការត្រួតពិនិត្យតាមដាន។",
        },
        {
          code: "R41",
          name: "របាយការណ៍ចំណាត់ថ្នាក់មុខងារ",
          englishName: "COFOG Report", entityUsed: "LM, GDB",
          description: "របាយការណ៍ចំណាត់ថ្នាក់មុខងារ គឺជារបាយការណ៍ស្តីពីចំណាត់ថ្នាក់មុខងារដែលបានផ្គូផ្គងជាមួយចំណាត់ថ្នាក់កម្មវិធីដែលមានបង្ហាញព័ត៌មានដូចជា ច្បាប់ហិរញ្ញវត្ថុ ឥណទានកែតម្រូវ ការចំណាយជាក់ស្តែង និងការប្រៀបធៀបរវាងការចំណាយជាក់ស្តែងនឹងច្បាប់ហិរញ្ញវត្ថុ។",
        },
        {
          code: "R78",
          name: "របាយការណ៍តារាងស្ថិតិចំណាយ",
          englishName: "GFS Report-Table 2", entityUsed: "GDPS",
          description: "របាយការណ៍តារាងស្ថិតិចំណាយ គឺជារបាយការណ៍ស្ថិតិស្ដង់ដារអន្តរជាតិមួយសម្រាប់រៀបចំស្ថិតិហិរញ្ញវត្ថុវិស័យរដ្ឋាភិបាល និងវិស័យសាជីវកម្មសាធារណៈ។ ការផលិតរបាយការណ៍នេះ ក្នុងគោលបំណងពង្រឹងគុណភាព និងប្រសិទ្ធភាពនៃការរៀបចំស្ថិតិ GFS (ផែនការសកម្មភាពលម្អិត (GDAP3+2) ឆ្នាំ២០២១ នៃកម្មវិធីកែទម្រង់ការគ្រប់គ្រងហិរញ្ញវត្ថុសាធារណៈរបស់អ.គ.ប) ។ តារាងស្ថិតិនេះបង្ហាញទម្រង់ស្តង់ដារជាសកល (លេខកូដស្ថិតិ) នៃស្ថិតិហិរញ្ញវត្ថុរដ្ឋាភិបាល (GFSM2014) ដោយតំណាងកូដលេខ 2 នឹងប្រើប្រាស់ទិន្នន័យក្នុងការផ្គូផ្គងជាមួយចំណាត់ថ្នាក់សេដ្ឋកិច្ចនៃមាតិកាថវិកាជាទិន្នន័យមូលដ្ឋាន។ របាយការណ៍នេះ ចែកចេញជា ៨ កម្រិត រួមមាន តារាងចំណាយសម្រាប់រដ្ឋបាលថ្នាក់ជាតិ (ក្រសួង+មន្ទីរ), រដ្ឋបាលរាជធានី/ខេត្ត, រដ្ឋបាលក្រុង/ស្រុក/ខណ្ឌ, រដ្ឋបាលឃុំ/សង្កាត់, រដ្ឋបាលថ្នាក់ក្រោមជាតិទាំងបីកម្រិតមុនសមាស, រដ្ឋបាលថ្នាក់ក្រោមជាតិទាំងបីកម្រិតក្រោយសមាស, រដ្ឋបាលថ្នាក់ជាតិ និងរដ្ឋបាលថ្នាក់ក្រោមជាតិមុនសមាស, និង រដ្ឋបាលថ្នាក់ជាតិ និងរដ្ឋបាលថ្នាក់ក្រោមជាតិក្រោយសមាស។",
        },
      ],
    },
  ];

const categoryQueryLabels: Record<string, LocalizedText> = {
  BA: { km: "មុខងារវិភាជន៍ថវិកា", en: "Budget Allocation" },
  PR: { km: "មុខងារលទ្ធកម្ម", en: "Procurement" },
  PO: { km: "មុខងារការទិញ", en: "Purchasing" },
  AP: { km: "មុខងារគណនីត្រូវសង", en: "Accounts Payable" },
  AR: { km: "មុខងារគណនីត្រូវទារ", en: "Accounts Receivable" },
  CM: { km: "មុខងារគ្រប់គ្រងសាច់ប្រាក់", en: "Cash Management" },
  GL: { km: "មុខងារសៀវភៅធំ", en: "General Ledger" },
  "For Approver": { km: "មុខងារសម្រាប់អ្នកអនុម័ត", en: "For Approver" },
};

const entityGlossary: EntityGlossaryItem[] = [
  {
    shortcut: "GDNT",
    khmerName: "អគ្គនាយកដ្ឋានរតនាគារជាតិ",
    englishName: "General Department of National Treasury",
  },
  {
    shortcut: "GDPS",
    khmerName: "អគ្គនាយកដ្ឋានគោលនយោបាយ",
    englishName: "General Department of Policy and Strategy",
  },
  {
    shortcut: "GDSNAF",
    khmerName: "អគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ ",
    englishName: "General Department of Sub-National Finance",
  },
  {
    shortcut: "LM",
    khmerName: "ក្រសួង-ស្ថាប័ន",
    englishName: "Line Ministry",
  },
  {
    shortcut: "DS",
    khmerName: "រដ្ឋបាលក្រុង-ស្រុក",
    englishName: "District Administration",
  },
  {
    shortcut: "DEF",
    khmerName: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ",
    englishName: "Department of Economy and Finance",
  },
  {
    shortcut: "PT",
    khmerName: "រតនាគាររាជធានី-ខេត្ត",
    englishName: "Provincial Treasury",
  },
  {
    shortcut: "PV",
    khmerName: "រដ្ឋបាលខេត្ត",
    englishName: "Provincial Administration",
  },
  {
    shortcut: "DI",
    khmerName: "នាយកដ្ឋានវិនិយោគ",
    englishName: "Department of Investment",
  },
  {
    shortcut: "LD",
    khmerName: "មន្ទីរ",
    englishName: "Line Department",
  },
  {
    shortcut: "GDB",
    khmerName: "អគ្គនាយកដ្ឋានថវិកា",
    englishName: "General Department of Budget",
  },
  {
    shortcut: "GDICDM",
    khmerName: "អគ្គនាយកដ្ឋានសហប្រតិបត្តិការអន្តរជាតិ និងគ្រប់គ្រងបំណុល",
    englishName: "General Department of International Cooperation and Debt Management",
  },
];

const entityGlossaryMap = entityGlossary.reduce((acc, item) => {
  acc[item.shortcut] = item;
  return acc;
}, {} as Record<string, EntityGlossaryItem>);

const categoryQueryData: {
  id: string;
  name: string;
  queries: number;
  details: CategoryDetail[];
}[] = [
    {
      id: "BA", name: "BA", queries: 6,
      details: [{
        code: "Q06", name: "របាយការណ៍វិភាជន៏ថវិកា", englishName: "BA Transaction Query", entityUsed: "GDB, LM, LD, PV, DS",
        description: "របាយការណ៍វិភាជន៍ថវិកា គឺជារបាយការណ៍តាមដានប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានប្រតិបត្តិការទាំងឡាយណាដែលបានបង្កើតហើយមិនទាន់បានអនុម័ត មិនទាន់បានចុះចូលទៅក្នុងបញ្ជី និងប្រតិបត្តិការដែលបានចុះចូលក្នុងបញ្ជីរួច (Posted) ព្រមទាំងប្រតិបត្តិការដែលមានកំហុសឆ្គងដើម្បីកែតម្រូវក្នុងប្រព័ន្ធ។",
      },
      {
        code: "Q10", name: "របាយការណ៍បូកសរុបថវិកា", englishName: "BA Budget Conso Query", entityUsed: "GDB, LM, LD, PV, DS",
        description: "របាយការណ៍បូកសរុបថវិកា(Q10) គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានថវិកា, ចំណាយថវិកា ក៏ដូចជាឥណទានទំនេរផងដែរ។",
      },
      {
        code: "Q11", name: "របាយការណ៍សរុបចំណូលថវិកា", englishName: "BA Budget Conso Rev Query", entityUsed: "GDB, LM, LD, PV, DS",
        description: "របាយការណ៍សរុបចំណូលថវិកា (Q11) គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានថវិកាសម្រាប់ឆ្នាំសារពើពន្ធដែលបានជ្រើសរើស ក៏ដូចជាថវិកាបច្ចុប្បន្ន (ថវិកាដើមឆ្នាំ, ការកែតម្រូវនិងការផ្ទរ) និងចំណូលថវិកា។",
      },
      {
        code: "Q13", name: "របាយការណ៍ចំណាយថវិកាមិនមានឥណទាន", englishName: "Override Budget Query", entityUsed: "GDB, GDSNAF, PT",
        description: "របាយការណ៍មិនមានឥណទាន គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការបញ្ជាទិញ និងអាណត្តិដែលអ្នកប្រើប្រាស់បានបញ្ចូលទៅក្នុង FMIS ដែលជាចំណាយមិនមានឥណទានគ្រប់គ្រាន់ ឬជាចំណាយដែលមិនបានគ្រោងទុក។",
      },
      {
        code: "Q16", name: "របាយការណ៍នៃប្រភេទកែតម្រូវថវិកា", englishName: "BA Transfer Reason Detail", entityUsed: "GDB, LM, LD",
        description: "របាយការណ៍ប្រភេទកែតម្រូវថវិកា គឺជារបាយការណ៍តាមដានប្រតិបត្តិការអំពីកែតម្រូវឥណទាន ដូចជាការបន្ថែម ការបង្វិលឥណទាន និង ឥណទានវិចារណកម្ម ទាំងឡាយណាដែលអ្នកប្រើប្រាស់បានបញ្ចូលទៅក្នុង FMIS។",
      },
      {
        code: "Q17", name: "របាយការណ៍វិចារណកម្មចំណាយ", englishName: "BA Budget Conso w/ Susp", entityUsed: "GDB, LM, LD",
        description: "របាយការណ៍វិចារណកម្មចំណាយ គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានថវិកាឆ្នាំសារពើពន្ធដែលបានជ្រើសរើស ក៏ដូចជាថវិកាបច្ចុប្បន្ន (ថវិកាដើមឆ្នាំ ការកែតម្រូវ វិចារណកម្ម និង ការផ្ទរ) និងចំណាយក៏ដូចជាឥណទានទំនេរ។",
      }],
    },
    {
      id: "PR", name: "PR", queries: 1, details: [{
        code: "Q23", name: "របាយការណ៍ត្រួតពិនិត្យគម្រោងវិនិយោគ", englishName: "Investment Project Review", entityUsed: "LM, DI",
        description: "របាយការណ៍ត្រួតពិនិត្យគម្រោងវិនិយោគ គឺជារបាយការណ៍ប្រតិបត្តិការលម្អិតដែលត្រួតពិនិត្យគម្រោងវិនិយោគតាមក្រសួង-ស្ថាប័ន ដែលបង្ហាញលម្អិតពីឈ្មោះគម្រោង ស្ថានភាពគម្រោង ថ្ងៃចាប់ផ្តើម និងបញ្ចប់គម្រោង ចំណាត់ថ្នាក់សេដ្ឋកិច្ច ទឹកប្រាក់គម្រោងជាដើម។",
      }]
    },
    {
      id: "PO", name: "PO", queries: 2,
      details: [{
        code: "Q01", name: "របាយការណ៍សរុបបញ្ជាទិញ", englishName: "PO Consolidation Query", entityUsed: "LM, LD, PV, DS",
        description: "របាយការណ៍សរុបបញ្ជាទិញ គឺជាជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការបញ្ជាទិញដែលអ្នកប្រើប្រាស់បានកត់ត្រានៅក្នុង FMIS រួមមានទិន្នន័យរបស់សំណើសុំធានាចំណាយទូទាត់ត្រង់ បុរេប្រទាន និង ការបញ្ជាទិញកិច្ចលទ្ធកម្ម។ របាយការណ៍នេះប្រើសម្រាប់ពិនិត្យ និង តាមដាននូវរាល់ព័ត៌មាននៅគ្រប់ស្ថានភាពបញ្ជាទិញដែលបានបញ្ចប់ ឬ មិនទាន់បញ្ចប់ រួមទាំងអាចយកទិន្នន័យនោះទៅរៀបចំរបាយការណ៍នានាបានទៅតាមតម្រូវការ។",
      },
      {
        code: "Q02", name: "របាយការណ៍សរុបសំណើ", englishName: "REQ Consolidation Query", entityUsed: "LM, LD, PV, DS",
        description: "របាយការណ៍សរុបសំណើ គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការសំណើសុំគោលការណ៍ធានាចំណាយសម្រាប់កិច្ចលទ្ធកម្ម ដែលអ្នកប្រើប្រាស់បានបញ្ចូលទៅក្នុងFMIS ។ របាយការណ៍នេះប្រើសម្រាប់ពិនិត្យ និង តាមដាននូវរាល់ព័ត៌មាននៅក្នុងសំណើ ស្ថានភាពសំណើដែលបានបញ្ចប់ ឬ មិនទាន់បញ្ចប់ រួមទាំងអាចយកទិន្នន័យនោះទៅរៀបចំជារបាយការណ៍នានាបានទៅតាមតម្រូវការ។",
      }],
    },
    {
      id: "AP", name: "AP", queries: 5,
      details: [{
        code: "Q03", name: "របាយការណ៍សរុបអាណត្តិ", englishName: "AP Payment Conso Query", entityUsed: "GDNT, LM, LD, PV, DS",
        description: "របាយការណ៍សរុបអាណត្តិ គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការបញ្ជាអាណត្តិដែលអ្នកប្រើប្រាស់បានបញ្ចូលក្នុងប្រព័ន្ធ FMIS។ របាយការណ៍នេះ ប្រើសម្រាប់ត្រួតពិនិត្យ និង តាមដាននូវរាល់ព័ត៌មាននៅក្នុងអាណត្តិ, ស្ថានភាពអាណត្តិដែលបានបញ្ចប់ និង មិនទាន់បញ្ចប់ រួមទាំងអាចយកទិន្នន័យនោះទៅរៀបចំរបាយការណ៍នានាបានទៅតាមតម្រូវការ។",
      },
      {
        code: "Q07", name: "របាយការណ៍សរុបការទូទាត់", englishName: "AP Payment Conso Query", entityUsed: "GDNT, PT",
        description: "របាយការណ៍សរុបការទូទាត់ គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និង តាមដានប្រតិបត្តិការលទ្ធផលការទូទាត់ទាំងឡាយណាដែលបានបង្កើតហើយមិនទាន់បានអនុម័ត មិនទាន់បានចុះចូលទៅក្នុងបញ្ជី និង ប្រតិបត្តិការដែលបានចុះចូលក្នុងបញ្ជីរួច (Posted) ព្រមទាំងប្រតិបត្តិការដែលមានកំហុសឆ្គង ដើម្បីកែតម្រូវក្នុងប្រព័ន្ធ។",
      },
      {
        code: "Q12", name: "របាយការណ៍ចំណាយអាណត្តិ", englishName: "Voucher Expenditure Query", entityUsed: "GDNT",
        description: "របាយការណ៍ចំណាយអាណត្តិ គឺជារបាយការណ៍តាមដានប្រតិបត្តិការទូទៅ ប្រតិបត្តិការរជ្ជទេយ្យបុរេប្រទាន និងប្រតិបត្តិការបុរេប្រទានដែលបានបញ្ចប់ប្រតិបត្តិការក្នុង FMIS ។",
      },
      {
        code: "Q14", name: "របាយការណ៍អាណត្តិបៀវត្ស", englishName: "AP Payroll Voucher Query", entityUsed: "LM, GDB, GDNT",
        description: "របាយការណ៍អាណត្តិបៀវត្ស គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានប្រតិបត្តិការបើកប្រាក់បៀវត្សដែលបានបង្កើតហើយមិនទាន់បានអនុម័ត មិនទាន់បានចុះចូលទៅក្នុងបញ្ជី និង ប្រតិបត្តិការដែលបានចុះចូលក្នុងបញ្ជីរួច (Posted) ព្រមទាំងប្រតិបត្តិការដែលមានកំហុសឆ្គង ដើម្បីកែតម្រូវក្នុងប្រព័ន្ធ។",
      },
      {
        code: "Q15", name: "របាយការណ៍សរុបអាណត្តិចេញ-ចូល", englishName: "AP Voucher In – Out Query", entityUsed: "GDNT",
        description: "របាយការណ៍សរុបអាណត្តិចេញ-ចូល គឺជារបាយការណ៍សម្រាប់រតនាគារតាមដានគ្រប់ប្រតិបត្តិកាអាណត្តិដែលអ្នកប្រើប្រាស់បានបញ្ចូលទៅក្នុង FMIS ។ របាយការណ៍នេះប្រើប្រាស់ដើម្បីពិនិត្យ និងតាមដាននូវស្ថានភាពនៅក្នុងអាណត្តិដែលបានបញ្ចប់ ឬ មិនទាន់បញ្ចប់ រួមទាំងអាចយកទិន្នន័យនោះទៅរៀបចំជារបាយការណ៍នានាបានទៅតាមតម្រូវការ។",
      }],
    },
    {
      id: "AR", name: "AR", queries: 2,
      details: [
        {
          code: "Q09", name: "របាយការណ៍ប្រតិបត្តិការចំណូល", englishName: "AR Transaction Query", entityUsed: "GDNT, PT, LM, LD, PV, DS",
          description: "របាយការណ៍ប្រតិបត្តិការចំណូល គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានប្រតិបត្តិការចំណូលទាំងឡាយណាដែលបានបង្កើតហើយមិនទាន់បានអនុម័ត មិនទាន់បានចុះចូលទៅក្នុងបញ្ជី និងប្រតិបត្តិការដែលបានចុះចូលក្នុងបញ្ជីរួច (Posted) ព្រមទាំងប្រតិបត្តិការដែលមានកំហុសឆ្គង ដើម្បីកែតម្រូវក្នុងប្រព័ន្ធ ។",
        },
        {
          code: "Q22", name: "តារាងតាមដានការទទួលស្គាល់ចំណូល", englishName: "Revenue Recongnition Query", entityUsed: "GDNT, PT",
          description: "តារាងតាមដានការទទួលស្គាល់ចំណូល គឺជារបាយការណ៍ប្រតិបត្តិការលម្អិតដែលតាមដានការប្រមូលចំណូលតាមក្រសួង-ស្ថាប័ន ដែលបង្ហាញលម្អិតពីចំណាត់ថ្នាក់សេដ្ឋកិច្ច ឈ្មោះអតិថិជន ស្ថានភាព អង្គភាព ចំនូនទឹកប្រាក់ជាដើម។",
        }],
    },
    {
      id: "CM", name: "CM", queries: 3,
      details: [{
        code: "Q04", name: "របាយការណ៍ចុះគណនេយ្យ", englishName: "Accounting Entry Query", entityUsed: "GDNT, PT",
        description: "របាយការណ៍ចុះគណនេយ្យ គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការផ្ទេរចំណូល និង ចំណាយគ្រប់អង្គភាពទាំងអស់ ដែលប្រតិបត្តិការត្រូវបានបង្កើតរួចនៅក្នុងប្រព័ន្ធគ្រប់ស្ថានភាពទាំងអស់។",
      },
      {
        code: "Q05", name: "របាយការណ៍ផ្ទេរគណនីធនាគារ", englishName: "Bank Transfer Query", entityUsed: "GDNT, PT",
        description: "របាយការណ៍ផ្ទេរគណនីធនាគារ គឺជារបាយការណ៍តាមគ្រប់ប្រតិបត្តិការនៃការផ្ទេរគណនីធនាគារគ្រប់អង្គភាពទាំងអស់ សម្រាប់អគ្គនាយកដ្ឋានរតនាគារជាតិ និងរតនាគាររាជធានី-ខេត្ត ដែលប្រតិបត្តិការត្រូវបានបង្កើតរួចនៅក្នុងប្រព័ន្ធគ្រប់ស្ថានភាពទាំងអស់។",
      },
      {
        code: "Q18", name: "របាយការណ៍ប្រតិ.មិនទាន់ផ្ទៀងផ្ទាត់", englishName: "Not Reconciled Query", entityUsed: "GDNT, PT",
        description: "របាយការណ៍ប្រតិបត្តិការមិនទាន់ផ្ទៀងផ្ទាត់ គឺជារបាយការណ៍តាមដាន និង ត្រួតពិនិត្យប្រតិបត្តិការទទួលបានពីការធ្វើស្វ័យប្រវត្តិកម្មទិន្នន័យជាមួយប្រព័ន្ធធនាគារដៃគូរ ដែលមិនទាន់បានផ្ទៀងផ្ទាត់ប្រតិបត្តិការជាមួយប្រព័ន្ធនៅឡើយ  ។ ការតាមដានប្រតិបត្តិការនេះនឹងជំរុញដល់អ្នកប្រើប្រាស់ ក្នុងការបញ្ចប់ប្រតិបត្តិដែលនៅសេសសល់ឲ្យបានទាន់ពេលវេលា ដើម្បីមានលទ្ធភាពធ្វើការបិទបញ្ជីកាគណនេយ្យចំណូលចំណាយសារពើពន្ធបានត្រឹមត្រូវ ។",
      }]
    },
    {
      id: "GL", name: "GL", queries: 1, details: [
        {
          code: "Q08", name: "របាយការណ៍ប្រតិ.សរុបសៀវភៅធំ", englishName: "GL Transaction Query", entityUsed: "GDNT, PT",
          description: "របាយការណ៍ប្រតិ.សរុបសៀវភៅធំ គឺជារបាយការណ៍តាមដានគ្រប់ប្រតិបត្តិការប្រចាំថ្ងៃ ដើម្បីត្រួតពិនិត្យ និងតាមដានប្រតិបត្តិការទាំងឡាយណាដែលបានបង្កើតនៅក្នុងសៀវភៅធំដែលបង្ហាញព័ត៌មានលម្អិតអំពីបន្ទាត់ទិនានុប្បវត្តិដោយផ្អែកលើលេខសម្គាល់ទិនានុប្បវត្តិ រួមទាំងការពិពណ៌នាអំពីប្រតិបត្តិការគ្រប់មុខងារ ។",
        }]
    },
    {
      id: "ForApprover", name: "For Approver", queries: 1, details: [{
        code: "Q20", name: "របាយការណ៍ស្ថានភាពអនុម័ត", englishName: "Transaction Approval Qry", entityUsed: "LM, LD",
        description: "របាយការណ៍ស្ថានភាពអនុម័ត គឺជារបាយការណ៍ពិនិត្យ និងតាមដានសម្រាប់អ្នកអនុម័តទៅលើគ្រប់មុខងារក្នុង FMIS។",
      }]
    },
  ];

const BUData = [
  { name: "GDNT: អគ្គ.រតនាគារជាតិ", reports: 123663, queries: 33960 },
  { name: "PT012: រតនាគាររាជធានីភ្នំពេញ", reports: 35555, queries: 6737 },
  { name: "PT006: រតនាគារខេត្តកំពង់ធំ", reports: 32312, queries: 6440 },
  { name: "PT008: រតនាគារខេត្តកណ្តាល", reports: 29192, queries: 3101 },
  { name: "PT018: រតនាគារខេត្តព្រះសីហនុ", reports: 22175, queries: 5638 },
];

const reportNatBUData = [
  { name: "GDNT: អគ្គ.រតនាគារជាតិ", reports: 11126 },
  { name: "GID: អគ្គ.សវនកម្ម", reports: 2350 },
  { name: "GDPFMIT: អគ្គ.បច្ចេកវិទ្យាព័ត៌មាន", reports: 1399 },
  { name: "DEF01: មន្ទីរសេដ្ឋកិច្ចខេត្តបន្ទាយមានជ័យ", reports: 740 },
  { name: "LM10: ក្រសួងសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុ", reports: 622 },
  { name: "DEF08: មន្ទីរសេដ្ឋកិច្ចខេត្តកណ្តាល", reports: 572 },
  { name: "LM16: ក្រសួងអប់រំ យុវជន និងកីឡា", reports: 529 },
  { name: "LM22: ក្រសួងប្រៃសនីយ៍", reports: 373 },
  { name: "LM72: ក្រសួងមហាផ្ទៃ", reports: 365 },
  { name: "DEF05: មន្ទិរសេដ្ឋកិច្ចខេត្តកំពង់ស្ពឺ", reports: 321 },
];

const reportTop5gen = [
  { name: "R20", fullName: "របាយការណ៍ចំណូលចំណាយថវិកា", reports: 20199 },
  { name: "R01", fullName: "តារាងតុល្យភាព", reports: 12744 },
  { name: "R39", fullName: "របាយការណ៍ប្រតិបត្តិការសៀវភៅធំ", reports: 10859 },
  { name: "R33", fullName: "របាយការណ៍សរុបចំណាយតាមអាណត្តិ", reports: 3126 },
  { name: "R17", fullName: "របាយការណ៍ចំណូលជាតិតាមក្រ-ស្ថាប័ន", reports: 1098 },
];

const queryTop5gen = [
  { name: "Q08", fullName: "របាយការណ៍ប្រតិ.សរុបសៀវភៅធំ", queries: 10849 },
  { name: "Q09", fullName: "របាយការណ៍ប្រតិបត្តិការចំណូល", queries: 4763 },
  { name: "Q03", fullName: "របាយការណ៍សរុបអាណត្តិ", queries: 1630 },
  { name: "Q07", fullName: "របាយការណ៍សរុបការទូទាត់", queries: 793 },
  { name: "Q01", fullName: "របាយការណ៍សរុបបញ្ជាទិញ", queries: 741 },
];

const queryNatBUData = [
  { name: "GDNT: អគ្គ.រតនាគារជាតិ", queries: 5734 },
  { name: "GDPFMIT: អគ្គ.បច្ចេកវិទ្យាព័ត៌មាន", queries: 937 },
  { name: "LM10: ក្រសួងសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុ", queries: 904 },
  { name: "LM17: ក្រសួងកសិកម្ម", queries: 156 },
  { name: "GDIA: អគ្គ.សវនកម្មបច្ចេកវិទ្យា", queries: 116 },
  { name: "LM22: ក្រសួងប្រៃសនីយ៍", queries: 64 },
  { name: "LM15: ក្រសួងពាណិជ្ជកម្ម", queries: 57 },
  { name: "GDB: អគ្គថវិកា", queries: 56 },
  { name: "LM28: ក្រសួងរៀបចំដែនដី", queries: 52 },
  { name: "LM26: ក្រសួងយុត្តិធម៌", queries: 45 },
];

const reportsubNatBUData = [
  { name: "PT006: រតនាគារខេត្តកំពង់ធំ", reports: 1789 },
  { name: "PT008: រតនាគារខេត្តកណ្តាល", reports: 1705 },
  { name: "PT014: រតនាគារខេត្តព្រៃវែង", reports: 1598 },
  { name: "PT018: រតនាគារខេត្តព្រះសីហនុ", reports: 1555 },
  { name: "PT005: រតនាគារខេត្តកំពង់ស្ពឺ", reports: 1450 },
  { name: "PT012: រតនាគាររាជធានីភ្នំពេញ", reports: 1382 },
  { name: "PT025: រតនាគារខេត្តត្បូងឃ្មុំ", reports: 1320 },
  { name: "PT010: រតនាគារខេត្តក្រចេះ", reports: 1314 },
  { name: "PT004: រតនាគារខេត្តកំពង់ឆ្នាំង", reports: 1257 },
  { name: "PT001: រតនាគារខេត្តបន្ទាយមានជ័យ", reports: 1237 },
];

const querysubNatBUData = [
  { name: "PT002: រតនាគារខេត្តបាត់ដំបង", queries: 1626 },
  { name: "PT017: រតនាគារខេត្តសៀមរាប", queries: 959 },
  { name: "PT020: រតនាគារខេត្តស្វាយរៀង", queries: 944 },
  { name: "PT001: រតនាគារខេត្តបន្ទាយមានជ័យ", queries: 775 },
  { name: "PT006: រតនាគារខេត្តកំពង់ធំ", queries: 642 },
  { name: "PT012: រតនាគាររាជធានីភ្នំពេញ", queries: 615 },
  { name: "PT018: រតនាគារខេត្តព្រះសីហនុ", queries: 612 },
  { name: "PT009: រតនាគារខេត្តកោះកុង", queries: 520 },
  { name: "PT004: រតនាគារខេត្តកំពង់ឆ្នាំង", queries: 519 },
  { name: "PT003: រតនាគារខេត្តកំពង់ចាម", queries: 518 },
];

const userGroups = [
  { label: { km: "អ្នកប្រើប្រាស់ថ្នាក់ជាតិ", en: "National-Level Users" }, active: 1976, inactive: 600 },
  { label: { km: "អ្នកប្រើប្រាស់ថ្នាក់ក្រោមជាតិ", en: "Sub-national Users" }, active: 875, inactive: 300 },
  { label: { km: "អ្នកប្រើប្រាស់តាមគ្រឹះស្ថានរដ្ឋបាលសាធារណៈ", en: "ABE Users" }, active: 72, inactive: 21 },
];

const siteGroups = [
  { label: { km: "ការដ្ឋានថ្នាក់ជាតិ", en: "National-Level Sites" }, count: 230, trend: { value: 1.61, up: true } },
  { label: { km: "ការដ្ឋានថ្នាក់ក្រោមជាតិ", en: "Sub-National Sites" }, count: 145, trend: { value: 0.84, up: true } },
  { label: { km: "ការដ្ឋានគ្រឹះស្ថានរដ្ឋបាលសាធារណៈ", en: "ABE Sites" }, count: 9, trend: { value: 0.01, up: true } },
];


/**
 * User/site organization categories.
 *
 * Paste each organization's data into its matching `details` array.
 * The category header always uses `siteCount`, so the official count remains
 * visible even while the detail list is still being completed.
 */
const userSiteCategoryData: UserSiteCategory[] = [
  {
    id: "Ministry of Economy and Finance Top Management",
    label: { km: "ថ្នាក់ដឹកនាំក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ", en: "Ministry of Economy and Finance Top Management" },
    siteCount: 0,
    details: [
      {
        id: "meftop-001",
        name: {
          km: "ថ្នាក់ដឹកនាំ",
          en: "Top Management",
        },
        users: 48,
        activeUsers: 47,
        inactiveUsers: 1,
      },
    ],
  },
  {
    id: "Ministry of Economy and Finance General Departments",
    label: { km: "អគ្គ.គន្លឹះរបស់ក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ", en: "Ministry of Economy and Finance General Departments" },
    siteCount: 10,
    details: [
      {
        id: "mefgd-001",
        name: {
          km: "អគ្គនាយកដ្ឋានថវិកា",
          en: "General Department of National Treasury",
        },
        users: 114,
        activeUsers: 75,
        inactiveUsers: 39,
      },
      {
        id: "mefgd-002",
        name: {
          km: "អគ្គនាយកដ្ឋានសវនកម្មផ្ទៃក្នុង",
          en: "General Department of Internal Audit",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "mefgd-003",
        name: {
          km: "អគ្គនាយកដ្ឋានសហប្រតិបត្តិការអន្តរជាតិ និងគ្រប់គ្រងបំណុល",
          en: "General Department of International Cooperation and Debt Management",
        },
        users: 25,
        activeUsers: 21,
        inactiveUsers: 4,
      },
      {
        id: "mefgd-004",
        name: {
          km: "អគ្គនាយកដ្ឋានរតនាគាររជាតិ",
          en: "General Department of National Treasury",
        },
        users: 134,
        activeUsers: 102,
        inactiveUsers: 32,
      },
      {
        id: "mefgd-005",
        name: {
          km: "អគ្គនាយកដ្ឋានគោលនយោបាយ",
          en: "General Department of Policy",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "mefgd-006",
        name: {
          km: "អគ្គនាយកដ្ឋានបច្ចេកវិទ្យាព័ត៌មានគ្រប់គ្រងហិរញ្ញវត្ថុសាធារណៈ",
          en: "General Department of Public Finaicial Management and Information Technology",
        },
        users: 105,
        activeUsers: 100,
        inactiveUsers: 5,
      },
      {
        id: "mefgd-007",
        name: {
          km: "អគ្គនាយកដ្ឋានលទ្ធកម្មសាធារណៈ",
          en: "General Department of Public Procurement",
        },
        users: 63,
        activeUsers: 49,
        inactiveUsers: 14,
      },
      {
        id: "mefgd-008",
        name: {
          km: "អគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ",
          en: "General Department of Sub-National Administration Finance",
        },
        users: 11,
        activeUsers: 7,
        inactiveUsers: 4,
      },
      {
        id: "mefgd-009",
        name: {
          km: "អគ្គនាយកដ្ឋានទ្រព្យសម្បត្តិរដ្ឋនិងចំណូលមិនមែនសារពើពន្ធ",
          en: "General Department of State Assets and Non-Tax Revenue",
        },
        users: 2,
        activeUsers: 0,
        inactiveUsers: 2,
      },
      {
        id: "mefgd-010",
        name: {
          km: "អគ្គាធិការដ្ឋាន",
          en: "General Inspectorate",
        },
        users: 25,
        activeUsers: 16,
        inactiveUsers: 9,
      },
    ],
  },
  {
    id: "ministries",
    label: { km: "ក្រសួង", en: "Ministries" },
    siteCount: 38,
    details: [
      {
        id: "lm-01",
        name: {
          km: "ក្រសួងព្រះបរមរាជវាំង",
          en: "Ministry of the Royal Palace",
        },
        users: 12,
        activeUsers: 4,
        inactiveUsers: 8,
      },
      {
        id: "lm-02",
        name: {
          km: "រដ្ឋសភា",
          en: "National Assembly",
        },
        users: 8,
        activeUsers: 5,
        inactiveUsers: 3,
      },
      {
        id: "lm-03",
        name: {
          km: "ព្រឹទ្ធសភា",
          en: "Senate",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "lm-04",
        name: {
          km: "ក្រុមប្រឹក្សាធម្មនុញ្ញ",
          en: "Constitutional Council of Cambodia",
        },
        users: 11,
        activeUsers: 5,
        inactiveUsers: 6,
      },
      {
        id: "lm-05",
        name: {
          km: "ក្រសួងការពារជាតិ",
          en: "Ministry of National Defence",
        },
        users: 18,
        activeUsers: 14,
        inactiveUsers: 4,
      },
      {
        id: "lm-06",
        name: {
          km: "ក្រសួងអធិការកិច្ច",
          en: "Ministry of Inspectorate",
        },
        users: 15,
        activeUsers: 9,
        inactiveUsers: 6,
      },
      {
        id: "lm-07",
        name: {
          km: "ក្រសួងការបរទេស និងសហប្រតិបត្តិការអន្តរជាតិ",
          en: "Ministry of Foreign Affairs and International Cooperation",
        },
        users: 18,
        activeUsers: 10,
        inactiveUsers: 8,
      },
      {
        id: "lm-08",
        name: {
          km: "ក្រសួងសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ",
          en: "Ministry of Economy and Finance",
        },
        users: 38,
        activeUsers: 32,
        inactiveUsers: 6,
      },
      {
        id: "lm-09",
        name: {
          km: "ក្រសួងព័ត៌មាន",
          en: "Ministry of Information",
        },
        users: 15,
        activeUsers: 14,
        inactiveUsers: 1,
      },
      {
        id: "lm-10",
        name: {
          km: "ក្រសួងសុខាភិបាល",
          en: "Ministry of Health",
        },
        users: 19,
        activeUsers: 12,
        inactiveUsers: 7,
      },
      {
        id: "lm-11",
        name: {
          km: "ក្រសួងរ៉ែ និងថាមពល",
          en: "Ministry of Mines and Energy",
        },
        users: 22,
        activeUsers: 20,
        inactiveUsers: 2,
      },
      {
        id: "lm-12",
        name: {
          km: "ក្រសួងផែនការ",
          en: "Ministry of Planning",
        },
        users: 20,
        activeUsers: 15,
        inactiveUsers: 5,
      },
      {
        id: "lm-13",
        name: {
          km: "ក្រសួងពាណិជ្ជកម្ម",
          en: "Ministry of Commerce",
        },
        users: 20,
        activeUsers: 14,
        inactiveUsers: 6,
      },
      {
        id: "lm-14",
        name: {
          km: "ក្រសួងអប់រំ យុវជន និងកីឡា",
          en: "Ministry of Education, Youth and Sport",
        },
        users: 45,
        activeUsers: 31,
        inactiveUsers: 14,
      },
      {
        id: "lm-15",
        name: {
          km: "ក្រសួងកសិកម្ម រុក្ខាប្រមាញ់ និងនេសាទ",
          en: "Ministry of Agriculture, Forestry and Fisheries",
        },
        users: 26,
        activeUsers: 19,
        inactiveUsers: 7,
      },
      {
        id: "lm-16",
        name: {
          km: "ក្រសួងវប្បធម៌ និងវិចិត្រសិល្បៈ",
          en: "Ministry of Culture and Fine Arts",
        },
        users: 20,
        activeUsers: 15,
        inactiveUsers: 5,
      },
      {
        id: "lm-17",
        name: {
          km: "ក្រសួងបរិស្ថាន",
          en: "Ministry of Environment",
        },
        users: 26,
        activeUsers: 11,
        inactiveUsers: 15,
      },
      {
        id: "lm-18",
        name: {
          km: "ក្រសួងអភិវឌ្ឍន៍ជនបទ",
          en: "Ministry of Rural Development",
        },
        users: 29,
        activeUsers: 21,
        inactiveUsers: 8,
      },
      {
        id: "lm-19",
        name: {
          km: "ក្រសួងសង្គមកិច្ច អតីតយុទ្ធជន",
          en: "Ministry of Social Affairs, Veterans and Youth Rehabilitation",
        },
        users: 19,
        activeUsers: 11,
        inactiveUsers: 8,
      },
      {
        id: "lm-20",
        name: {
          km: "ក្រសួងប្រៃសណីយ៍ និងទូរគមនាគមន៍",
          en: "Ministry of Posts and Telecommunications",
        },
        users: 24,
        activeUsers: 18,
        inactiveUsers: 6,
      },
      {
        id: "lm-21",
        name: {
          km: "ក្រសួងធម្មការ និងសាសនា",
          en: "Ministry of Cults and Religion",
        },
        users: 22,
        activeUsers: 10,
        inactiveUsers: 12,
      },
      {
        id: "lm-22",
        name: {
          km: "ក្រសួងកិច្ចការនារី",
          en: "Ministry of Women's Affairs",
        },
        users: 15,
        activeUsers: 11,
        inactiveUsers: 4,
      },
      {
        id: "lm-23",
        name: {
          km: "ក្រសួងសាធារណការ និងដឹកជញ្ជូន",
          en: "Ministry of Public Works and Transport",
        },
        users: 43,
        activeUsers: 27,
        inactiveUsers: 16,
      },
      {
        id: "lm-24",
        name: {
          km: "ក្រសួងយុត្តិធម៌",
          en: "Ministry of Justice",
        },
        users: 24,
        activeUsers: 16,
        inactiveUsers: 8,
      },
      {
        id: "lm-25",
        name: {
          km: "ក្រសួងទេសចរណ៍",
          en: "Ministry of Tourism",
        },
        users: 24,
        activeUsers: 9,
        inactiveUsers: 15,
      },
      {
        id: "lm-26",
        name: {
          km: "ក្រសួងរៀបចំដែនដី នគរូបនីយកម្ម",
          en: "Ministry of Land Management, Urban Planning and Construction",
        },
        users: 25,
        activeUsers: 15,
        inactiveUsers: 10,
      },
      {
        id: "lm-27",
        name: {
          km: "ក្រសួងធនធានទឹក និងឧតុនិយម",
          en: "Ministry of Water Resources and Meteorology",
        },
        users: 28,
        activeUsers: 20,
        inactiveUsers: 8,
      },
      {
        id: "lm-28",
        name: {
          km: "គណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត",
          en: "National Election Committee",
        },
        users: 16,
        activeUsers: 9,
        inactiveUsers: 7,
      },
      {
        id: "lm-29",
        name: {
          km: "អាជ្ញាធរសវនកម្មជាតិ (អគ្គលេខាធិការដ្ឋាន)",
          en: "National Audit Authority (General Secretariat)",
        },
        users: 11,
        activeUsers: 8,
        inactiveUsers: 3,
      },
      {
        id: "lm-30",
        name: {
          km: "ក្រសួងការងារ និងបណ្តុះបណ្តាលវិជ្ជាជីវៈ",
          en: "Ministry of Labour and Vocational Training",
        },
        users: 20,
        activeUsers: 8,
        inactiveUsers: 12,
      },
      {
        id: "lm-31",
        name: {
          km: "ស្ថាប័នប្រឆាំងអំពើពុករលួយ (អង្គភាពប្រឆាំងអំពើពុករលួយ)",
          en: "Anti-Corruption Unit (ACU)",
        },
        users: 10,
        activeUsers: 8,
        inactiveUsers: 2,
      },
      {
        id: "lm-32",
        name: {
          km: "ក្រសួងមុខងារសាធារណៈ",
          en: "Ministry of Civil Service",
        },
        users: 16,
        activeUsers: 13,
        inactiveUsers: 3,
      },
      {
        id: "lm-33",
        name: {
          km: "ក្រសួងឧស្សាហកម្ម វិទ្យាសាស្ត្រ បច្ចេកវិទ្យា និងនវានុវត្តន៍",
          en: "Ministry of Industry, Science, Technology and Innovation",
        },
        users: 20,
        activeUsers: 12,
        inactiveUsers: 8,
      },
      {
        id: "lm-34",
        name: {
          km: "ក្រុមប្រឹក្សាអភិវឌ្ឍន៍កម្ពុជា",
          en: "Council for the Development of Cambodia",
        },
        users: 13,
        activeUsers: 10,
        inactiveUsers: 3,
      },
      {
        id: "lm-35",
        name: {
          km: "ទីស្តីការគណៈរដ្ឋមន្ត្រី",
          en: "Council of Ministers",
        },
        users: 18,
        activeUsers: 11,
        inactiveUsers: 7,
      },
      {
        id: "lm-36",
        name: {
          km: "រដ្ឋលេខាធិការដ្ឋានអាកាសចរស៊ីវិល",
          en: "State Secretariat of Civil Aviation",
        },
        users: 28,
        activeUsers: 20,
        inactiveUsers: 8,
      },
      {
        id: "lm-37",
        name: {
          km: "ក្រសួងមហាផ្ទៃ - ផ្នែកសន្តិសុខ",
          en: "Ministry of Interior - Security Sector",
        },
        users: 27,
        activeUsers: 8,
        inactiveUsers: 19,
      },
      {
        id: "lm-38",
        name: {
          km: "ក្រសួងមហាផ្ទៃ - រដ្ឋបាលទូទៅ",
          en: "Ministry of Interior - General Administration",
        },
        users: 23,
        activeUsers: 11,
        inactiveUsers: 12,
      },
    ],
  },
  {
    id: "fully-authorized-budget-entities",
    label: {
      km: "អង្គភាពថវិកាអាណាប័កផ្ទេរសិទ្ធិពេញលេញ",
      en: "Fully Authorized Budget Entities",
    },
    siteCount: 115,
    details: [
      {
        id: "abe-01",
        name: {
          km: "នាយកដ្ឋានវិស្វកម្ម",
          en: "Department of Engineering",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "abe-02",
        name: {
          km: "ក្រុមប្រឹក្សាជាតិគណនេយ្យ",
          en: "National Accounting Council",
        },
        users: 9,
        activeUsers: 5,
        inactiveUsers: 4,
      },
      {
        id: "abe-03",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានគណៈកម្មការគ្រប់គ្រងល្បែងពាណិជ្ជកម្មកម្ពុជា",
          en: "General Secretariat of the Commercial Gambling Management Commission of Cambodia",
        },
        users: 9,
        activeUsers: 2,
        inactiveUsers: 7,
      },
      {
        id: "abe-04",
        name: {
          km: "គណៈកម្មការផលិតភាពកម្ពុជា",
          en: "Cambodia Productivity Commission",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "abe-05",
        name: {
          km: "អង្គភាព​ភាព​ជាដៃគូ​រវាង​រដ្ឋ និង​ឯកជន",
          en: "Public-Private Partnership Unit",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "abe-06",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាន នៃអាជ្ញាធរសេវាហិរញ្ញវត្ថុមិនមែនធនាគារ",
          en: "General Secretariat of the Non-Bank Financial Services Authority",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "abe-07",
        name: {
          km: "អគ្គនាយកដ្ឋានថវិកា",
          en: "General Department of Budget",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-08",
        name: {
          km: "អគ្គនាយកដ្ឋានគយនិងរដ្ឋាករកម្ពុជា",
          en: "General Department of Customs and Excise of Cambodia",
        },
        users: 7,
        activeUsers: 4,
        inactiveUsers: 3,
      },
      {
        id: "abe-09",
        name: {
          km: "អគ្គនាយកដ្ឋានសេដ្ឋកិច្ចឌីជីថល",
          en: "General Department of Digital Economy",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "abe-10",
        name: {
          km: "អគ្គនាយកដ្ឋានសវនកម្មផ្ទៃក្នុង",
          en: "General Department of Internal Audit",
        },
        users: 10,
        activeUsers: 6,
        inactiveUsers: 4,
      },
      {
        id: "abe-11",
        name: {
          km: "អគ្គនាយកដ្ឋានសហប្រតិបត្តិការអន្តរជាតិ និងគ្រប់គ្រងបំណុល",
          en: "General Department of International Cooperation and Debt Management",
        },
        users: 25,
        activeUsers: 23,
        inactiveUsers: 2,
      },
      {
        id: "abe-12",
        name: {
          km: "អគ្គនាយកដ្ឋានរតនាគាររជាតិ",
          en: "General Department of National Treasury",
        },
        users: 11,
        activeUsers: 5,
        inactiveUsers: 6,
      },
      {
        id: "abe-13",
        name: {
          km: "អគ្គនាយកដ្ឋានគោលនយោបាយ",
          en: "General Department of Policy",
        },
        users: 7,
        activeUsers: 5,
        inactiveUsers: 2,
      },
      {
        id: "abe-14",
        name: {
          km: "អគ្គនាយកដ្ឋានបច្ចេកវិទ្យាព័ត៌មានគ្រប់គ្រងហិរញ្ញវត្ថុសាធារណៈ",
          en: "General Department of Information Technology for Public Financial Management",
        },
        users: 9,
        activeUsers: 9,
        inactiveUsers: 0,
      },
      {
        id: "abe-15",
        name: {
          km: "អគ្គនាយកដ្ឋានលទ្ធកម្មសាធារណៈ",
          en: "General Department of Public Procurement",
        },
        users: 8,
        activeUsers: 6,
        inactiveUsers: 2,
      },
      {
        id: "abe-16",
        name: {
          km: "អគ្គនាយកដ្ឋានដោះស្រាយផលប៉ះពាល់ដោយសារគម្រោងអភិវឌ្ឍន៍",
          en: "General Department of Resettlement",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-17",
        name: {
          km: "អគ្គនាយកដ្ឋានហិរញ្ញវត្ថុរដ្ឋបាលថ្នាក់ក្រោមជាតិ",
          en: "General Department of Sub-National Administration Finance",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "abe-18",
        name: {
          km: "អគ្គនាយកដ្ឋានទ្រព្យសម្បត្តិរដ្ឋនិងចំណូលមិនមែនសារពើពន្ធ",
          en: "General Department of State Property and Non-Tax Revenue",
        },
        users: 8,
        activeUsers: 6,
        inactiveUsers: 2,
      },
      {
        id: "abe-19",
        name: {
          km: "អគ្គនាយកដ្ឋានពន្ធដារ",
          en: "General Department of Taxation",
        },
        users: 15,
        activeUsers: 11,
        inactiveUsers: 4,
      },
      {
        id: "abe-20",
        name: {
          km: "អគ្គាធិការដ្ឋាន",
          en: "General Inspectorate",
        },
        users: 9,
        activeUsers: 7,
        inactiveUsers: 2,
      },
      {
        id: "abe-21",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានគណៈកម្មាធិការសេដ្ឋកិច្ចនិងធុរកិច្ចឌីជីថល",
          en: "General Secretariat of the Digital Economy and Business Committee",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-22",
        name: {
          km: "អង្គភាពសវនកម្មផ្ទៃក្នុង នៃអាជ្ញាធរសេវាហិរញ្ញវត្ថុមិនមែនធនាគារ",
          en: "Internal Audit Unit of the Non-Bank Financial Services Authority",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-23",
        name: {
          km: "និយ័តករធានារ៉ាប់រងកម្ពុជា",
          en: "Insurance Regulator of Cambodia",
        },
        users: 7,
        activeUsers: 3,
        inactiveUsers: 4,
      },
      {
        id: "abe-24",
        name: {
          km: "លេខាធិការដ្ឋានក្រុមប្រឹក្សានីតិកម្ម",
          en: "Secretariat of the Legislative Council",
        },
        users: 8,
        activeUsers: 4,
        inactiveUsers: 4,
      },
      {
        id: "abe-25",
        name: {
          km: "ទីភ្នាក់ងារជាតិបញ្ជាក់ចំណាយ",
          en: "National Expenditure Certification Agency",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-26",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានក្រុមប្រឹក្សាជាតិគាំពារ​សង្គម",
          en: "General Secretariat of the National Social Protection Council",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "abe-27",
        name: {
          km: "និយ័តករអាជីវកម្មអចលនវត្ថុ និងបញ្ចាំ",
          en: "Real Estate Business and Pawnshop Regulator",
        },
        users: 8,
        activeUsers: 3,
        inactiveUsers: 5,
      },
      {
        id: "abe-28",
        name: {
          km: "គណៈកម្មការមូលបត្រកម្ពុជា",
          en: "Securities and Exchange Regulator of Cambodia",
        },
        users: 17,
        activeUsers: 9,
        inactiveUsers: 8,
      },
      {
        id: "abe-29",
        name: {
          km: "ឧត្តមក្រុមប្រឹក្សាសេដ្ឋកិច្ចជាតិ",
          en: "Supreme National Economic Council",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-30",
        name: {
          km: "និយ័តករបរធនបាលកិច្ច",
          en: "Trust Regulator",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-31",
        name: {
          km: "អាជ្ញាធរជាតិប្រយុទ្ធនឹងជំងឺអេដស៍",
          en: "National AIDS Authority",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-32",
        name: {
          km: "អគ្គនាយកដ្ឋានថាមពល",
          en: "General Department of Energy",
        },
        users: 10,
        activeUsers: 4,
        inactiveUsers: 6,
      },
      {
        id: "abe-33",
        name: {
          km: "អគ្គនាយកដ្ឋានកិច្ចការទូទៅ",
          en: "General Department of General Affairs",
        },
        users: 1,
        activeUsers: 1,
        inactiveUsers: 0,
      },
      {
        id: "abe-34",
        name: {
          km: "អគ្គនាយកដ្ឋានធនធានរ៉ែ",
          en: "General Department of Mineral Resources",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-35",
        name: {
          km: "អគ្គនាយកដ្ឋានប្រេងកាត",
          en: "General Department of Petroleum",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-36",
        name: {
          km: "អគ្គនាយកដ្ឋានផែនការ",
          en: "General Department of Planning",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-37",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានប្រជាជន និងការអភិវឌ្ឍ",
          en: "General Secretariat for Population and Development",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-38",
        name: {
          km: "វិទ្យាស្ថានជាតិស្ថិតិ",
          en: "National Institute of Statistics",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "abe-39",
        name: {
          km: "អគ្គនាយកដ្ឋានការពារអ្នកប្រើប្រាស់ កិច្ចការប្រកួតប្រជែង និងបង្រ្កាបការក្លែងបន្លំ (ក.ប.ប.)",
          en: "General Department of Consumer Protection, Competition and Fraud Repression",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "abe-40",
        name: {
          km: "អគ្គនាយកដ្ឋានសេវាពាណិជ្ជកម្ម",
          en: "General Department of Trade Services",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "abe-41",
        name: {
          km: "គណៈកម្មាធិការ​ទទួល​ស្គាល់​គុណ​ភាព​អប់រំនៃ​កម្ពុជា",
          en: "Accreditation Committee of Cambodia",
        },
        users: 7,
        activeUsers: 3,
        inactiveUsers: 4,
      },
      {
        id: "abe-42",
        name: {
          km: "អគ្គនាយកដ្ឋានគោលនយោបាយនិងផែនការ",
          en: "General Department of Policy and Planning",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "abe-43",
        name: {
          km: "អគ្គនាយកដ្ឋានកីឡា",
          en: "General Department of Sports",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-44",
        name: {
          km: "អគ្គនាយកដ្ឋានយុវជន",
          en: "General Department of Youth",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "abe-45",
        name: {
          km: "វិទ្យាស្ថានបច្ចេកវិទ្យាកម្ពុជា",
          en: "Institute of Technology of Cambodia",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-46",
        name: {
          km: "វិទ្យាស្ថានបច្ចេកវិទ្យាកំពង់ឈើទាល",
          en: "Kampong Chheuteal Institute of Technology",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-47",
        name: {
          km: "វិទ្យាស្ថានបច្ចេកវិទ្យាកំពង់ស្ពឺ",
          en: "Kampong Speu Institute of Technology",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-48",
        name: {
          km: "សាកលវិទ្យាល័យមានជ័យ",
          en: "Mean Chey University",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-49",
        name: {
          km: "វិទ្យាសា្ថនជាតិអប់រំ",
          en: "National Institute of Education",
        },
        users: 11,
        activeUsers: 8,
        inactiveUsers: 3,
      },
      {
        id: "abe-50",
        name: {
          km: "សាកលវិទ្យាល័យភូមិន្ទភ្នំពេញ",
          en: "Royal University of Phnom Penh",
        },
        users: 6,
        activeUsers: 1,
        inactiveUsers: 5,
      },
      {
        id: "abe-51",
        name: {
          km: "រដ្ឋបាលជលផល",
          en: "Fisheries Administration",
        },
        users: 8,
        activeUsers: 8,
        inactiveUsers: 0,
      },
      {
        id: "abe-52",
        name: {
          km: "រដ្ឋបាលព្រៃឈើ",
          en: "Forestry Administration",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "abe-53",
        name: {
          km: "អគ្គនាយកដ្ឋានកសិកម្ម",
          en: "General Directorate of Agriculture",
        },
        users: 8,
        activeUsers: 8,
        inactiveUsers: 0,
      },
      {
        id: "abe-54",
        name: {
          km: "អគ្គនាយកដ្ឋានសុខភាពសត្វនិងផលិតកម្មសត្វ",
          en: "General Directorate of Animal Health and Production",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-55",
        name: {
          km: "អគ្គនាយកដ្ឋានរដ្ឋបាល និងហិរញ្ញវត្ថុ",
          en: "General Department of Administration and Finance",
        },
        users: 3,
        activeUsers: 1,
        inactiveUsers: 2,
      },
      {
        id: "abe-56",
        name: {
          km: "អគ្គនាយកដ្ឋានចំណេះដឹងនិងព័ត៌មានបរិស្ថាន",
          en: "General Department of Environmental Knowledge and Information",
        },
        users: 9,
        activeUsers: 4,
        inactiveUsers: 5,
      },
      {
        id: "abe-57",
        name: {
          km: "អគ្គនាយកដ្ឋានគាំពារបរិស្ថាន",
          en: "General Department of Environmental Protection",
        },
        users: 9,
        activeUsers: 5,
        inactiveUsers: 4,
      },
      {
        id: "abe-58",
        name: {
          km: "អគ្គនាយកដ្ឋានសហគមន៍មូលដ្ឋាន",
          en: "General Department of Local Communities",
        },
        users: 14,
        activeUsers: 4,
        inactiveUsers: 10,
      },
      {
        id: "abe-59",
        name: {
          km: "អគ្គនាយកដ្ឋានរដ្ឋបាលការពារ និងអភិរក្សធម្មជាតិ",
          en: "General Department of Nature Protection and Conservation Administration",
        },
        users: 13,
        activeUsers: 8,
        inactiveUsers: 5,
      },
      {
        id: "abe-60",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានក្រុមប្រឹក្សាជាតិអភិវឌ្ឍន៍ដោយចីរភាព",
          en: "General Secretariat of the National Council for Sustainable Development",
        },
        users: 12,
        activeUsers: 6,
        inactiveUsers: 6,
      },
      {
        id: "abe-61",
        name: {
          km: "អគ្គនាយកដ្ឋានរដ្ឋបាល",
          en: "General Department of Administration",
        },
        users: 2,
        activeUsers: 1,
        inactiveUsers: 1,
      },
      {
        id: "abe-62",
        name: {
          km: "អគ្គនាយកដ្ឋានគ្រប់គ្រង​ធនធាន​វិសាលគមន៍ហ្វ្រេកង់ស៍វិទ្យុ",
          en: "General Department of Radio Frequency Spectrum Management",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "abe-63",
        name: {
          km: "អគ្គនាយកដ្ឋានបច្ចេកវិទ្យាគមនាគមន៍និងព័ត៌មាន",
          en: "General Department of Information and Communications Technology",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "abe-64",
        name: {
          km: "អគ្គនាយកដ្ឋានប្រៃសណីយ៍",
          en: "General Department of Posts",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "abe-65",
        name: {
          km: "អគ្កាធិការដ្ឋាន",
          en: "General Inspectorate",
        },
        users: 10,
        activeUsers: 8,
        inactiveUsers: 2,
      },
      {
        id: "abe-66",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានគណៈកម្មាធិការរដ្ឋាភិបាលឌីជីថល",
          en: "General Secretariat of the Digital Government Committee",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-67",
        name: {
          km: "អគ្គនាយកដ្ឋានទូរគមនាគមន៍",
          en: "General Department of Telecommunications",
        },
        users: 8,
        activeUsers: 8,
        inactiveUsers: 0,
      },
      {
        id: "abe-68",
        name: {
          km: "អគ្គនាយកដ្ឋានកិច្ចការសាសនា",
          en: "General Department of Religious Affairs",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },
      {
        id: "abe-69",
        name: {
          km: "អគ្គាធិការដ្ឋានពុទ្ធិកសិក្សាជាតិ",
          en: "General Inspectorate of National Buddhist Education",
        },
        users: 7,
        activeUsers: 5,
        inactiveUsers: 2,
      },
      {
        id: "abe-70",
        name: {
          km: "អគ្គនាយកដ្ឋានភស្តុភារកម្ម",
          en: "General Department of Logistics",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "abe-71",
        name: {
          km: "អគ្គនាយកដ្ឋានផែនការ និងគោលនយោបាយ",
          en: "General Department of Planning and Policy",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "abe-72",
        name: {
          km: "អគ្គនាយកដ្ឋានសាធារណការ",
          en: "General Department of Public Works",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "abe-73",
        name: {
          km: "អគ្គនាយកដ្ឋានដឹកជញ្ជូនផ្លូវគោក",
          en: "General Department of Land Transport",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "abe-74",
        name: {
          km: "អគ្គនាយកដ្ឋានប្រព័ន្ធចម្រោះទឹកកខ្វក់",
          en: "General Department of Wastewater Treatment Systems",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-75",
        name: {
          km: "អគ្គនាយកដ្ឋានបច្ចេកទេស",
          en: "General Department of Technical Affairs",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-76",
        name: {
          km: "អគ្គនាយកដ្ឋានបច្ចេកវិទ្យា និងទំនាកទំនងសារធារណៈ",
          en: "General Department of Technology and Public Relations",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-77",
        name: {
          km: "អគ្គនាយកដ្ឋានដឹកជញជូនផ្លូវទឹក ផ្លូវសមុ្រទ និងកំពង់ផែ",
          en: "General Department of Waterway, Maritime Transport and Ports",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-78",
        name: {
          km: "វិទ្យាស្ថានតេជោសែន សាធារណការ និងដឹកជញ្ជូន",
          en: "Techo Sen Institute of Public Works and Transport",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-79",
        name: {
          km: "អគ្គាធិការដ្ឋានកិច្ចការតុលាការ",
          en: "General Inspectorate of Judicial Affairs",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "abe-80",
        name: {
          km: "សាលាឧទ្ធរណ៍ និងមហាអយ្យការអមសាលាឧទ្ធរណ៍",
          en: "Court of Appeal and the Prosecutor General's Office Attached to the Court of Appeal",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "abe-81",
        name: {
          km: "ឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម",
          en: "Supreme Council of the Magistracy",
        },
        users: 10,
        activeUsers: 5,
        inactiveUsers: 5,
      },
      {
        id: "abe-82",
        name: {
          km: "អគ្គនាយកដានកិច្ចការរដ្ឋប្បវេណី",
          en: "General Department of Civil Affairs",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "abe-83",
        name: {
          km: "អគ្គនាយកដ្ឋាន​កិច្ចការទោសព្រហ្មទណ្ឌ",
          en: "General Department of Criminal Affairs",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "abe-84",
        name: {
          km: "អគ្គនាយកដ្ឋានកិច្ចការអយ្យការ និងព្រហ្មទណ្ឌ",
          en: "General Department of Prosecution and Criminal Affairs",
        },
        users: 8,
        activeUsers: 6,
        inactiveUsers: 2,
      },
      {
        id: "abe-85",
        name: {
          km: "អគ្គនាយកដ្ឋានកិច្ចការរដ្ឋបាលតុលាការ",
          en: "General Department of Court Administration",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },
      {
        id: "abe-86",
        name: {
          km: "អគ្គនាយកដ្ឋានអភិវឌ្ឍន៍វិស័យយុត្តិធម៌",
          en: "General Department of Justice Sector Development",
        },
        users: 7,
        activeUsers: 4,
        inactiveUsers: 3,
      },
      {
        id: "abe-87",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាន នៃគណៈកម្មាធិការដឹកនាំការកែទម្រង់ប្រព័ន្ធយុត្តិធម៌",
          en: "General Secretariat of the Steering Committee for Justice System Reform",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "abe-88",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាននៃអាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រព័ន្ធតុលាការ",
          en: "General Secretariat of the National Authority for Out-of-Court Dispute Resolution",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "abe-89",
        name: {
          km: "រាជបណ្ឌិតសភាវិជ្ជាជីវៈតុលាការ",
          en: "Royal Academy for Judicial Professions",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },
      {
        id: "abe-90",
        name: {
          km: "លេខាធិការដ្ឋានក្រុមប្រឹក្សានីតិកម្ម និងយុត្តិធម៌",
          en: "Secretariat of the Council for Legislation and Justice",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "abe-91",
        name: {
          km: "តុលាការកំពូល",
          en: "Supreme Court",
        },
        users: 7,
        activeUsers: 4,
        inactiveUsers: 3,
      },
      {
        id: "abe-92",
        name: {
          km: "គណៈកម្មាធិការជាតិទន្លេមេគង្គ",
          en: "Cambodia National Mekong Committee",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-93",
        name: {
          km: "អាជ្ញាធរទន្លេសាប",
          en: "Tonle Sap Authority",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "abe-94",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាននៃគណៈវិស្វករកម្ពុជា",
          en: "General Secretariat of the Board of Engineers Cambodia",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-95",
        name: {
          km: "អគ្គលេខាធិការដ្ឋានក្រុមប្រឹក្សាជាតិប្រាក់ឈ្នួលអប្បបរមា",
          en: "General Secretariat of the National Council on Minimum Wage",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-96",
        name: {
          km: "ទីភ្នាក់ងារមុខរបរ និងការងារ",
          en: "National Employment Agency",
        },
        users: 8,
        activeUsers: 8,
        inactiveUsers: 0,
      },
      {
        id: "abe-97",
        name: {
          km: "អគ្គនាយកដ្ឋានគ្រប់គ្រងមុខងារសាធារណ",
          en: "General Department of Civil Service Management",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "abe-98",
        name: {
          km: "អគ្គនាយកដ្ឋានគោលនយោបាយមុខងារសាធារណ:",
          en: "General Department of Civil Service Policy",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "abe-99",
        name: {
          km: "អគ្គាធិការដ្ឋាន",
          en: "General Inspectorate",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "abe-100",
        name: {
          km: "អគ្គនាយកដ្ឋានប្រព័ន្ធគ្រប់គ្រងមន្ត្រីតាមឌីជីថល",
          en: "General Department of Digital Civil Servant Management Systems",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-101",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាននៃគណៈកម្មាធិការកែទម្រង់រដ្ឋបាលសាធារណៈ",
          en: "General Secretariat of the Public Administration Reform Committee",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-102",
        name: {
          km: "សាលាភូមិន្ទរដ្ឋបាល",
          en: "Royal School of Administration",
        },
        users: 7,
        activeUsers: 5,
        inactiveUsers: 2,
      },
      {
        id: "abe-103",
        name: {
          km: "អគ្គនាយកដ្ឋានកិច្ចការទូទៅ",
          en: "General Department of General Affairs",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "abe-104",
        name: {
          km: "អគ្គនាយកដ្ឋានវាយតម្លៃទទួលស្គាល់នៃកម្ពុជា",
          en: "General Department of Accreditation of Cambodia",
        },
        users: 10,
        activeUsers: 4,
        inactiveUsers: 6,
      },
      {
        id: "abe-105",
        name: {
          km: "អគ្គនាយកដ្ឋានទឹកស្អាត",
          en: "General Department of Potable Water",
        },
        users: 8,
        activeUsers: 6,
        inactiveUsers: 2,
      },
      {
        id: "abe-106",
        name: {
          km: "អគ្គនាយកដ្ឋានឧស្សាហកម្ម",
          en: "General Department of Industry",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "abe-107",
        name: {
          km: "អគ្គនាយកដ្ឋានសហគ្រាសធុនតូចនិងមធ្យម និងសិប្បកម្ម",
          en: "General Department of Small and Medium Enterprises and Handicrafts",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "abe-108",
        name: {
          km: "អគ្គនាយកដ្ឋានវិទ្យាសាស្រ្ត បច្ចេកវិទ្យា និងនវានុវត្តន៍",
          en: "General Department of Science, Technology and Innovation",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "abe-109",
        name: {
          km: "វិទ្យាស្ថានស្តង់ដារកម្ពុជា",
          en: "Institute of Standards of Cambodia",
        },
        users: 13,
        activeUsers: 10,
        inactiveUsers: 3,
      },
      {
        id: "abe-110",
        name: {
          km: "មជ្ឍមណ្ឌលមាត្រាសាស្រ្តជាតិ",
          en: "National Metrology Center",
        },
        users: 12,
        activeUsers: 9,
        inactiveUsers: 3,
      },
      {
        id: "abe-111",
        name: {
          km: "វិទ្យាស្ថានជាតិវិទ្យាសាស្រ្ត បច្ចេកវិទ្យា និងនវានុវត្តន៍",
          en: "National Institute of Science, Technology and Innovation",
        },
        users: 9,
        activeUsers: 9,
        inactiveUsers: 0,
      },
      {
        id: "abe-112",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាន នៃអាជ្ញាធរជាតិប្រយុទ្ធប្រឆាំងគ្រឿងញៀន",
          en: "General Secretariat of the National Authority for Combating Drugs",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "abe-113",
        name: {
          km: "គណៈកម្មាធិការជាតិប្រឆាំងទារុណកម្ម អំពើឃោរឃៅ អំពើអមនុស្សធម៌ អំពើធ្វើទុក្ខបុកម្នេញ ឬទារុណកម្ម (គ.ជ.ប.ទ)",
          en: "National Committee Against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "abe-114",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាននៃគណៈកម្មាធិការជាតិ ប្រយុទ្ធប្រឆាំងអំពើជួញដូរមនុស្ស",
          en: "General Secretariat of the National Committee for Counter Trafficking",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "abe-115",
        name: {
          km: "អគ្គលេខាធិការដ្ឋាននៃគណៈកម្មាធិការជាតិសុវត្ថិភាពចរាចរណ៍ផ្លូវគោក",
          en: "General Secretariat of the National Road Safety Committee",
        },
        users: 7,
        activeUsers: 4,
        inactiveUsers: 3,
      },
    ],
  },
  {
    id: "partially-authorized-budget-entities",
    label: {
      km: "អង្គភាពថវិកាអាណាប័កផ្ទេរសិទ្ធិមិនពេញលេញ",
      en: "Partially Authorized Budget Entities",
    },
    siteCount: 16,
    details: [
      {
        id: "be-01",
        name: {
          km: "នាយកដ្ឋានអធិការកិច្ច និងបណ្តឹងតវ៉ា",
          en: "Department of Inspection and Complaints",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-02",
        name: {
          km: "វិទ្យាស្ថានគរុកោសល្យបាត់ដំបង",
          en: "Battambang Teacher Education College",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-03",
        name: {
          km: "នាយកដ្ឋានអភិវឌ្ឍកម្មវិធីសិក្សា",
          en: "Department of Curriculum Development",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-04",
        name: {
          km: "នាយកដ្ឋានអប់រំកុមារតូច",
          en: "Department of Early Childhood Education",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-05",
        name: {
          km: "នាយកដ្ឋានអធិការកិច្ចគុណភាពអប់រំ",
          en: "Department of Educational Quality Inspection",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-06",
        name: {
          km: "នាយកដ្ឋានឧត្តមសិក្សា",
          en: "Department of Higher Education",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-07",
        name: {
          km: "នាយកដ្ឋានសុខភាពសិក្សា",
          en: "Department of School Health",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-08",
        name: {
          km: "នាយកដ្ឋានសវនកម្មផ្ទៃក្នុង",
          en: "Department of Internal Audit",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "be-09",
        name: {
          km: "នាយកដ្ឋានអប់រំក្រៅប្រព័ន្ធ",
          en: "Department of Non-Formal Education",
        },
        users: 4,
        activeUsers: 2,
        inactiveUsers: 2,
      },
      {
        id: "be-10",
        name: {
          km: "នាយកដ្ឋានបឋមសិក្សា",
          en: "Department of Primary Education",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-11",
        name: {
          km: "នាយកដ្ឋានមធ្យមសិក្សាចំណេះទូទៅ",
          en: "Department of General Secondary Education",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-12",
        name: {
          km: "នាយកដ្ឋានស្រាវជ្រាវវិទ្យាសាស្ត្រ",
          en: "Department of Scientific Research",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-13",
        name: {
          km: "អគ្គនាយកដ្ឋានបណ្តុះបណ្តាល និងវិក្រឹតការ",
          en: "General Department of Training and Qualification",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-14",
        name: {
          km: "នាយកដ្ឋានតម្រង់ទិសវិជ្ជាជីវៈ",
          en: "Department of Vocational Guidance",
        },
        users: 2,
        activeUsers: 2,
        inactiveUsers: 0,
      },
      {
        id: "be-15",
        name: {
          km: "វិទ្យាស្ថានគរុកោសល្យរាជធានីភ្នំពេញ",
          en: "Phnom Penh Teacher Education College",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "be-16",
        name: {
          km: "នាយកដ្ឋានផ្លូវដែក",
          en: "Department of Railroad",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
    ],
  },
  {
    id: "capital-provincial-administrations",
    label: {
      km: "រដ្ឋបាលរាជធានី-ខេត្ត",
      en: "Capital-Provincial Administrations",
    },
    siteCount: 25,
    details: [
      {
        id: "pv-001",
        name: {
          km: "រដ្ឋបាល ខេត្តបន្ទាយមានជ័យ",
          en: "Banteay Mean Chey Capital Administration",
        },
        users: 8,
        activeUsers: 6,
        inactiveUsers: 2,
      },
      {
        id: "pv-002",
        name: {
          km: "រដ្ឋបាល ខេត្តបាត់ដំបង",
          en: "Battambang Provincial Administration",
        },
        users: 11,
        activeUsers: 5,
        inactiveUsers: 6,
      },
      {
        id: "pv-003",
        name: {
          km: "រដ្ឋបាល ខេត្តកំពង់ចាម",
          en: "Kampong Cham Provincial Administration",
        },
        users: 11,
        activeUsers: 6,
        inactiveUsers: 5,
      },
      {
        id: "pv-004",
        name: {
          km: "រដ្ឋបាល ខេត្តកំពង់ឆ្នាំង",
          en: "Kampong Chhnang Provincial Administration",
        },
        users: 11,
        activeUsers: 6,
        inactiveUsers: 5,
      },
      {
        id: "pv-005",
        name: {
          km: "រដ្ឋបាល ខេត្តកំពង់ស្ពឺ",
          en: "Kampong Speu Provincial Administration",
        },
        users: 9,
        activeUsers: 5,
        inactiveUsers: 4,
      },
      {
        id: "pv-006",
        name: {
          km: "រដ្ឋបាល ខេត្តកំពង់ធំ",
          en: "Kampong Thom Provincial Administration",
        },
        users: 10,
        activeUsers: 5,
        inactiveUsers: 5,
      },
      {
        id: "pv-007",
        name: {
          km: "រដ្ឋបាល ខេត្តកំពត",
          en: "Kampot Provincial Administration",
        },
        users: 12,
        activeUsers: 5,
        inactiveUsers: 7,
      },
      {
        id: "pv-008",
        name: {
          km: "រដ្ឋបាល ខេត្តកណ្តាល",
          en: "Kandal Provincial Administration",
        },
        users: 14,
        activeUsers: 10,
        inactiveUsers: 4,
      },
      {
        id: "pv-009",
        name: {
          km: "រដ្ឋបាល ខេត្តកោះកុង",
          en: "Koh Kong Provincial Administration",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },
      {
        id: "pv-010",
        name: {
          km: "រដ្ឋបាល ខេត្តក្រចេះ",
          en: "Kratie Provincial Administration",
        },
        users: 11,
        activeUsers: 6,
        inactiveUsers: 5,
      },
      {
        id: "pv-011",
        name: {
          km: "រដ្ឋបាល ខេត្តមណ្ឌលគិរី",
          en: "Mondulkiri Provincial Administration",
        },
        users: 10,
        activeUsers: 6,
        inactiveUsers: 4,
      },
      {
        id: "pv-012",
        name: {
          km: "រដ្ឋបាល រាជធានីភ្នំពេញ",
          en: "Phnom Penh Provincial Administration",
        },
        users: 15,
        activeUsers: 7,
        inactiveUsers: 8,
      },
      {
        id: "pv-013",
        name: {
          km: "រដ្ឋបាល ខេត្តព្រះវិហារ",
          en: "Preah Vihear Provincial Administration",
        },
        users: 13,
        activeUsers: 5,
        inactiveUsers: 8,
      },
      {
        id: "pv-014",
        name: {
          km: "រដ្ឋបាល ខេត្តព្រៃវែង",
          en: "Prey Veng Provincial Administration",
        },
        users: 10,
        activeUsers: 6,
        inactiveUsers: 4,
      },
      {
        id: "pv-015",
        name: {
          km: "រដ្ឋបាល ខេត្តពោធិ៍សាត់",
          en: "Pursat Provincial Administration",
        },
        users: 15,
        activeUsers: 7,
        inactiveUsers: 8,
      },
      {
        id: "pv-016",
        name: {
          km: "រដ្ឋបាល ខេត្តរតនគិរី",
          en: "Rattanakiri Provincial Administration",
        },
        users: 11,
        activeUsers: 7,
        inactiveUsers: 4,
      },
      {
        id: "pv-017",
        name: {
          km: "រដ្ឋបាល ខេត្តសៀមរាប",
          en: "Siem Reap Provincial Administration",
        },
        users: 9,
        activeUsers: 5,
        inactiveUsers: 4,
      },
      {
        id: "pv-018",
        name: {
          km: "រដ្ឋបាល ខេត្តព្រះសីហនុ",
          en: "Preah Sihanoukville Provincial Administration",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "pv-019",
        name: {
          km: "រដ្ឋបាល ខេត្តស្ទឹងត្រែង",
          en: "Steung Treng Provincial Administration",
        },
        users: 10,
        activeUsers: 5,
        inactiveUsers: 5,
      },
      {
        id: "pv-020",
        name: {
          km: "រដ្ឋបាល ខេត្តស្វាយរៀង",
          en: "Svay Rieng Provincial Administration",
        },
        users: 10,
        activeUsers: 9,
        inactiveUsers: 1,
      },
      {
        id: "pv-021",
        name: {
          km: "រដ្ឋបាល ខេត្តតាកែវ",
          en: "Takeo Provincial Administration",
        },
        users: 8,
        activeUsers: 5,
        inactiveUsers: 3,
      },
      {
        id: "pv-022",
        name: {
          km: "រដ្ឋបាល ខេត្តឧត្តរមានជ័យ",
          en: "Oddar Meanchey Provincial Administration",
        },
        users: 11,
        activeUsers: 5,
        inactiveUsers: 6,
      },
      {
        id: "pv-023",
        name: {
          km: "រដ្ឋបាល ខេត្តកែប",
          en: "Kep Provincial Administration",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "pv-024",
        name: {
          km: "រដ្ឋបាល ខេត្តប៉ៃលិន",
          en: "Pailin Provincial Administration",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },
      {
        id: "pv-025",
        name: {
          km: "រដ្ឋបាល ខេត្តត្បូងឃ្មុំ",
          en: "Tboung Khmum Provincial Administration",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },


    ],
  },
  {
    id: "capital-provincial-treasuries",
    label: {
      km: "រតនាគាររាជធានី-ខេត្ត",
      en: "Capital-Provincial Treasuries",
    },
    siteCount: 25,
    details: [
      {
        id: "pt-001",
        name: {
          km: "រតនាគារ ខេត្តបន្ទាយមានជ័យ",
          en: "Banteay Mean Chey Provincial Treasury",
        },
        users: 16,
        activeUsers: 16,
        inactiveUsers: 0,
      },
      {
        id: "pt-002",
        name: {
          km: "រតនាគារ ខេត្តបាត់ដំបង",
          en: "Battambang Provincial Treasury",
        },
        users: 15,
        activeUsers: 15,
        inactiveUsers: 0,
      },
      {
        id: "pt-003",
        name: {
          km: "រតនាគារ ខេត្តកំពង់ចាម",
          en: "Kampong Cham Provincial Treasury",
        },
        users: 12,
        activeUsers: 12,
        inactiveUsers: 0,
      },
      {
        id: "pt-004",
        name: {
          km: "រតនាគារ ខេត្តកំពង់ឆ្នាំង",
          en: "Kampong Chhnang Provincial Treasury",
        },
        users: 11,
        activeUsers: 8,
        inactiveUsers: 3,
      },
      {
        id: "pt-005",
        name: {
          km: "រតនាគារ ខេត្តកំពង់ស្ពឺ",
          en: "Kampong Speu Provincial Treasury",
        },
        users: 19,
        activeUsers: 18,
        inactiveUsers: 1,
      },
      {
        id: "pt-006",
        name: {
          km: "រតនាគារ ខេត្តកំពង់ធំ",
          en: "Kampong Thom Provincial Treasury",
        },
        users: 13,
        activeUsers: 13,
        inactiveUsers: 0,
      },
      {
        id: "pt-007",
        name: {
          km: "រតនាគារ ខេត្តកំពត",
          en: "Kampot Provincial Treasury",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "pt-008",
        name: {
          km: "រតនាគារ ខេត្តកណ្តាល",
          en: "Kandal Provincial Treasury",
        },
        users: 13,
        activeUsers: 12,
        inactiveUsers: 1,
      },
      {
        id: "pt-009",
        name: {
          km: "រតនាគារ ខេត្តកោះកុង",
          en: "Koh Kong Provincial Treasury",
        },
        users: 9,
        activeUsers: 9,
        inactiveUsers: 0,
      },
      {
        id: "pt-010",
        name: {
          km: "រតនាគារ ខេត្តក្រចេះ",
          en: "Kratie Provincial Treasury",
        },
        users: 12,
        activeUsers: 12,
        inactiveUsers: 0,
      },
      {
        id: "pt-011",
        name: {
          km: "រតនាគារ ខេត្តមណ្ឌលគិរី",
          en: "Mondulkiri Provincial Treasury",
        },
        users: 10,
        activeUsers: 9,
        inactiveUsers: 1,
      },
      {
        id: "pt-012",
        name: {
          km: "រតនាគារ រាជធានីភ្នំពេញ",
          en: "Phnom Penh Capital Treasury",
        },
        users: 26,
        activeUsers: 25,
        inactiveUsers: 1,
      },
      {
        id: "pt-013",
        name: {
          km: "រតនាគារ ខេត្តព្រះវិហារ",
          en: "Preah Vihear Provincial Treasury",
        },
        users: 12,
        activeUsers: 12,
        inactiveUsers: 0,
      },
      {
        id: "pt-014",
        name: {
          km: "រតនាគារ ខេត្តព្រៃវែង",
          en: "Prey Veng Provincial Treasury",
        },
        users: 13,
        activeUsers: 11,
        inactiveUsers: 2,
      },
      {
        id: "pt-015",
        name: {
          km: "រតនាគារ ខេត្តពោធិ៍សាត់",
          en: "Pursat Provincial Treasury",
        },
        users: 13,
        activeUsers: 11,
        inactiveUsers: 2,
      },
      {
        id: "pt-016",
        name: {
          km: "រតនាគារ ខេត្តរតនគិរី",
          en: "Rattanakiri Provincial Treasury",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "pt-017",
        name: {
          km: "រតនាគារ ខេត្តសៀមរាប",
          en: "Siem Reap Provincial Treasury",
        },
        users: 12,
        activeUsers: 11,
        inactiveUsers: 1,
      },
      {
        id: "pt-018",
        name: {
          km: "រតនាគារ ខេត្តព្រះសីហនុ",
          en: "Preah Sihanoukville Provincial Treasury",
        },
        users: 9,
        activeUsers: 8,
        inactiveUsers: 1,
      },
      {
        id: "pt-019",
        name: {
          km: "រតនាគារ ខេត្តស្ទឹងត្រែង",
          en: "Steung Treng Provincial Treasury",
        },
        users: 11,
        activeUsers: 11,
        inactiveUsers: 0,
      },
      {
        id: "pt-020",
        name: {
          km: "រតនាគារ ខេត្តស្វាយរៀង",
          en: "Svay Rieng Provincial Treasury",
        },
        users: 11,
        activeUsers: 11,
        inactiveUsers: 0,
      },
      {
        id: "pt-021",
        name: {
          km: "រតនាគារ ខេត្តតាកែវ",
          en: "Takeo Provincial Treasury",
        },
        users: 11,
        activeUsers: 11,
        inactiveUsers: 0,
      },
      {
        id: "pt-022",
        name: {
          km: "រតនាគារ ខេត្តឧត្តរមានជ័យ",
          en: "Oddar Meanchey Provincial Treasury",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "pt-023",
        name: {
          km: "រតនាគារ ខេត្តកែប",
          en: "Kep Provincial Treasury",
        },
        users: 11,
        activeUsers: 11,
        inactiveUsers: 0,
      },
      {
        id: "pt-024",
        name: {
          km: "រតនាគារ ខេត្តប៉ៃលិន",
          en: "Pailin Provincial Treasury",
        },
        users: 13,
        activeUsers: 12,
        inactiveUsers: 1,
      },
      {
        id: "pt-025",
        name: {
          km: "រតនាគារ ខេត្តត្បូងឃ្មុំ",
          en: "Tboung Khmum Provincial Treasury",
        },
        users: 14,
        activeUsers: 13,
        inactiveUsers: 1,
      },
    ],
  },
  {
    id: "departments-of-economy-and-finance",
    label: {
      km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុរាជធានី-ខេត្ត",
      en: "Departments of Economy and Finance",
    },
    siteCount: 25,
    details: [
      {
        id: "def-001",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តបន្ទាយមានជ័យ",
          en: "Banteay Mean Chey Department of Economy and Finance",
        },
        users: 17,
        activeUsers: 13,
        inactiveUsers: 4,
      },
      {
        id: "def-002",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តបាត់ដំបង",
          en: "Battambang Department of Economy and Finance",
        },
        users: 22,
        activeUsers: 17,
        inactiveUsers: 5,
      },
      {
        id: "def-003",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកំពង់ចាម",
          en: "Kampong Cham Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 9,
        inactiveUsers: 3,
      },
      {
        id: "def-004",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកំពង់ឆ្នាំង",
          en: "Kampong Chhnang Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 10,
        inactiveUsers: 2,
      },
      {
        id: "def-005",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកំពង់ស្ពឺ",
          en: "Kampong Speu Department of Economy and Finance",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "def-006",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកំពង់ធំ",
          en: "Kampong Thom Department of Economy and Finance",
        },
        users: 9,
        activeUsers: 6,
        inactiveUsers: 3,
      },
      {
        id: "def-007",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកំពត",
          en: "Kampot Department of Economy and Finance",
        },
        users: 11,
        activeUsers: 8,
        inactiveUsers: 3,
      },
      {
        id: "def-008",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកណ្តាល",
          en: "Kandal Department of Economy and Finance",
        },
        users: 13,
        activeUsers: 9,
        inactiveUsers: 4,
      },
      {
        id: "def-009",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកោះកុង",
          en: "Koh Kong Department of Economy and Finance",
        },
        users: 10,
        activeUsers: 9,
        inactiveUsers: 1,
      },
      {
        id: "def-010",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តក្រចេះ",
          en: "Kratie Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 8,
        inactiveUsers: 4,
      },
      {
        id: "def-011",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តមណ្ឌលគិរី",
          en: "Mondulkiri Department of Economy and Finance",
        },
        users: 9,
        activeUsers: 7,
        inactiveUsers: 2,
      },
      {
        id: "def-012",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ រាជធានីភ្នំពេញ",
          en: "Phnom Penh Capital Department of Economy and Finance",
        },
        users: 16,
        activeUsers: 10,
        inactiveUsers: 6,
      },
      {
        id: "def-013",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តព្រះវិហារ",
          en: "Preah Vihear Department of Economy and Finance",
        },
        users: 11,
        activeUsers: 8,
        inactiveUsers: 3,
      },
      {
        id: "def-014",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តព្រៃវែង",
          en: "Prey Veng Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 10,
        inactiveUsers: 2,
      },
      {
        id: "def-015",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តពោធិ៍សាត់",
          en: "Pursat Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 11,
        inactiveUsers: 1,
      },
      {
        id: "def-016",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តរតនគិរី",
          en: "Rattanakiri Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 10,
        inactiveUsers: 2,
      },
      {
        id: "def-017",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តសៀមរាប",
          en: "Siem Reap Department of Economy and Finance",
        },
        users: 15,
        activeUsers: 8,
        inactiveUsers: 7,
      },
      {
        id: "def-018",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តព្រះសីហនុ",
          en: "Preah Sihanoukville Department of Economy and Finance",
        },
        users: 14,
        activeUsers: 12,
        inactiveUsers: 2,
      },
      {
        id: "def-019",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តស្ទឹងត្រែង",
          en: "Steung Treng Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 11,
        inactiveUsers: 1,
      },
      {
        id: "def-020",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តស្វាយរៀង",
          en: "Svay Rieng Department of Economy and Finance",
        },
        users: 13,
        activeUsers: 12,
        inactiveUsers: 1,
      },
      {
        id: "def-021",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តតាកែវ",
          en: "Takeo Department of Economy and Finance",
        },
        users: 14,
        activeUsers: 11,
        inactiveUsers: 3,
      },
      {
        id: "def-022",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តឧត្តរមានជ័យ",
          en: "Oddar Meanchey Department of Economy and Finance",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "def-023",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តកែប",
          en: "Kep Department of Economy and Finance",
        },
        users: 11,
        activeUsers: 11,
        inactiveUsers: 0,
      },
      {
        id: "def-024",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តប៉ៃលិន",
          en: "Pailin Department of Economy and Finance",
        },
        users: 13,
        activeUsers: 12,
        inactiveUsers: 1,
      },
      {
        id: "def-025",
        name: {
          km: "មន្ទីរសេដ្ឋកិច្ច និងហិរញ្ញវត្ថុ ខេត្តត្បូងឃ្មុំ",
          en: "Tboung Khmum Department of Economy and Finance",
        },
        users: 12,
        activeUsers: 9,
        inactiveUsers: 3,
      },
    ],
  },
  {
    id: "administrative-public-entities",
    label: {
      km: "គ្រឹះស្ថានរដ្ឋបាលសាធារណៈ",
      en: "Administrative Public Entities",
    },
    siteCount: 9,
    details: [
      {
        id: "ape-01",
        name: {
          km: "មជ្ឈមណ្ឌលបណ្តុះធុរកិច្ចថ្មី តេជោ",
          en: "Techo Startup Center",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "ape-02",
        name: {
          km: "វិទ្យាស្ថានសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុ",
          en: "University of Economy and Finance",
        },
        users: 11,
        activeUsers: 8,
        inactiveUsers: 3,
      },
      {
        id: "ape-03",
        name: {
          km: "សាកលវិទ្យាល័យវិទ្យាសាស្ត្រសុខាភិបាល",
          en: "University of Health Sciences",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "ape-04",
        name: {
          km: "សាកលវិទ្យាល័យភូមិន្ទនីតិសាស្ត្រនិងវិទ្យាសាស្ត្រសេដ្ឋកិច្ច",
          en: "Royal University of Law and Economics",
        },
        users: 10,
        activeUsers: 7,
        inactiveUsers: 3,
      },
      {
        id: "ape-05",
        name: {
          km: "សាកលវិទ្យាល័យជាតិបាត់ដំបង",
          en: "National University of Battambang",
        },
        users: 12,
        activeUsers: 11,
        inactiveUsers: 1,
      },
      {
        id: "ape-06",
        name: {
          km: "វិទ្យាស្ថានស្រាវជ្រាវ និងអភិវឌ្ឍន៍កសិកម្មកម្ពុជា",
          en: "Cambodian Agricultural Research and Development Institute",
        },
        users: 10,
        activeUsers: 5,
        inactiveUsers: 5,
      },
      {
        id: "ape-07",
        name: {
          km: "សាកលវិទ្យាល័យភូមិន្ទកសិកម្ម",
          en: "Royal University of Agriculture",
        },
        users: 11,
        activeUsers: 10,
        inactiveUsers: 1,
      },
      {
        id: "ape-08",
        name: {
          km: "គ្រឹះស្ថានអង្គរ",
          en: "Angkor Enterprise",
        },
        users: 9,
        activeUsers: 8,
        inactiveUsers: 1,
      },
      {
        id: "ape-09",
        name: {
          km: "រាជបណ្ឌិត្យសភាកម្ពុជា",
          en: "Royal Academy of Cambodia",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
    ],
  },
  {
    id: "municipalities-districts-khans",
    label: {
      km: "ក្រុង ស្រុក ខណ្ឌ",
      en: "Municipalities, Districts and Khans",
    },
    siteCount: 95,
    details: [
      {
        id: "md-01",
        name: {
          km: "រដ្ឋបាលក្រុងសិរីសោភ័ណ",
          en: "Serei Saophoan City",
        },
        users: 7,
        activeUsers: 5,
        inactiveUsers: 2,
      },
      {
        id: "md-02",
        name: {
          km: "រដ្ឋបាលក្រុងប៉ោយប៉ែត",
          en: "Poipet City",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-03",
        name: {
          km: "រដ្ឋបាលក្រុងបាត់ដំបង",
          en: "Battambang City",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-04",
        name: {
          km: "រដ្ឋបាលក្រុងកំពង់ចាម",
          en: "Kampong Cham City",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "md-05",
        name: {
          km: "រដ្ឋបាលក្រុងកំពង់ឆ្នាំង",
          en: "Kampong Chhnang City",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "md-06",
        name: {
          km: "រដ្ឋបាលស្រុកបរសេដ្ឋ",
          en: "Bor Seth District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-07",
        name: {
          km: "រដ្ឋបាលក្រុងច្បារមន",
          en: "Chbar Morn City",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "md-08",
        name: {
          km: "រដ្ឋបាលស្រុកគងពិសី",
          en: "Kong Pisei District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-09",
        name: {
          km: "រដ្ឋបាលស្រុកឱរ៉ាល់",
          en: "Aoral District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-10",
        name: {
          km: "រដ្ឋបាលស្រុកភ្នំស្រួច",
          en: "Phnom Sruoch District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-11",
        name: {
          km: "រដ្ឋបាលស្រុកសំរោងទង",
          en: "Samraong Tong District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-12",
        name: {
          km: "រដ្ឋបាលស្រុកថ្ពង",
          en: "Thpong District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-13",
        name: {
          km: "រដ្ឋបាលក្រុងឧដុង្គម៉ែជ័យ",
          en: "Oudong Me Chey District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-14",
        name: {
          km: "រដ្ឋបាលស្រុកសាមគ្គីមុនីជ័យ",
          en: "Samaki Munichey District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-15",
        name: {
          km: "រដ្ឋបាលស្រុកបារាយណ៍",
          en: "Baray District",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "md-16",
        name: {
          km: "រដ្ឋបាលស្រុកកំពង់ស្វាយ",
          en: "Kampong Svay District",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "md-17",
        name: {
          km: "រដ្ឋបាលក្រុងស្ទឹងសែន",
          en: "Steung Sen City",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "md-18",
        name: {
          km: "រដ្ឋបាលស្រុកប្រាសាទបាល័ង្គ",
          en: "Prasat Balang District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-19",
        name: {
          km: "រដ្ឋបាលស្រុកប្រាសាទសំបូរ",
          en: "Prasat Sambo District",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "md-20",
        name: {
          km: "រដ្ឋបាលស្រុកសណ្ដាន់",
          en: "Sandan District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-21",
        name: {
          km: "រដ្ឋបាលស្រុកសន្ទុក",
          en: "Santuk District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-22",
        name: {
          km: "រដ្ឋបាលស្រុកស្ទោង",
          en: "Stoung District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-23",
        name: {
          km: "រដ្ឋបាលស្រុកតាំងគោក",
          en: "Tang Kok District",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "md-24",
        name: {
          km: "រដ្ឋបាលក្រុងកំពត",
          en: "Kampot City",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "md-25",
        name: {
          km: "រដ្ឋបាលក្រុងបូកគោ",
          en: "Bokor City",
        },
        users: 7,
        activeUsers: 5,
        inactiveUsers: 2,
      },
      {
        id: "md-26",
        name: {
          km: "រដ្ឋបាលស្រុកកណ្តាលស្ទឹង",
          en: "Kandal Stueng District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-27",
        name: {
          km: "រដ្ឋបាលស្រុកកៀនស្វាយ",
          en: "Kean Svay District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-28",
        name: {
          km: "រដ្ឋបាលស្រុកខ្សាច់កណ្តាល",
          en: "Khsach Kandal District",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-29",
        name: {
          km: "រដ្ឋបាលស្រុកកោះធំ",
          en: "Koh Thom District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-30",
        name: {
          km: "រដ្ឋបាលស្រុកលើកដែក",
          en: "Leuk Dek District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-31",
        name: {
          km: "រដ្ឋបាលស្រុកល្វាឯម",
          en: "Lvea Aem District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-32",
        name: {
          km: "រដ្ឋបាលស្រុកមុខកំពូល",
          en: "Muk Kampul District",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "md-33",
        name: {
          km: "រដ្ឋបាលស្រុកអង្គស្នួល",
          en: "Ang Snoul District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-34",
        name: {
          km: "រដ្ឋបាលស្រុកពញាឮ",
          en: "Pounhear Leu District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-35",
        name: {
          km: "រដ្ឋបាលស្រុកស្អាង",
          en: "Sa'ang District",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "md-36",
        name: {
          km: "រដ្ឋបាលក្រុងតាខ្មៅ",
          en: "Takhmao City",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-37",
        name: {
          km: "រដ្ឋបាលក្រុងសំពៅពូន",
          en: "Sampov Poun City",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-38",
        name: {
          km: "រដ្ឋបាលក្រុងអរិយក្សត្រ",
          en: "Areyksat City",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-39",
        name: {
          km: "រដ្ឋបាលក្រុងខេមរភូមិន្ទ",
          en: "Khemrakphumint City",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "md-40",
        name: {
          km: "រដ្ឋបាលក្រុងក្រចេះ",
          en: "Kratie City",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-41",
        name: {
          km: "រដ្ឋបាលក្រុងសែនមនោរម្យ",
          en: "Sen Monorom City",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "md-42",
        name: {
          km: "រដ្ឋបាលខណ្ឌចំការមន",
          en: "Chamkar Mon District",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "md-43",
        name: {
          km: "រដ្ឋបាលខណ្ឌដូនពេញ",
          en: "Doun Penh District",
        },
        users: 6,
        activeUsers: 2,
        inactiveUsers: 4,
      },
      {
        id: "md-44",
        name: {
          km: "រដ្ឋបាលខណ្ឌ៧មករា",
          en: "7 Makara District",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "md-45",
        name: {
          km: "រដ្ឋបាលខណ្ឌទួលគោក",
          en: "Tuol Kouk District",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "md-46",
        name: {
          km: "រដ្ឋបាលខណ្ឌដង្កោ",
          en: "Dangkao District",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "md-47",
        name: {
          km: "រដ្ឋបាលខណ្ឌមានជ័យ",
          en: "Mean Chey District",
        },
        users: 6,
        activeUsers: 2,
        inactiveUsers: 4,
      },
      {
        id: "md-48",
        name: {
          km: "រដ្ឋបាលខណ្ឌឫស្សីកែវ",
          en: "Russey Keo District",
        },
        users: 7,
        activeUsers: 5,
        inactiveUsers: 2,
      },
      {
        id: "md-49",
        name: {
          km: "រដ្ឋបាលខណ្ឌសែនសុខ",
          en: "Sen Sok District",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "md-50",
        name: {
          km: "រដ្ឋបាលខណ្ឌពោធិ៍សែនជ័យ",
          en: "Por Sen Chey District",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-51",
        name: {
          km: "រដ្ឋបាលខណ្ឌជ្រោយចង្វារ",
          en: "Chroy Changva District",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "md-52",
        name: {
          km: "រដ្ឋបាលខណ្ឌព្រែកព្នៅ",
          en: "Prek Pnov District",
        },
        users: 5,
        activeUsers: 2,
        inactiveUsers: 3,
      },
      {
        id: "md-53",
        name: {
          km: "រដ្ឋបាលខណ្ឌច្បារអំពៅ",
          en: "Chbar Ampov District",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-54",
        name: {
          km: "រដ្ឋបាលខណ្ឌបឹងកេងកង",
          en: "Boeng Keng Kang District",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-55",
        name: {
          km: "រដ្ឋបាលខណ្ឌកំបូល",
          en: "Kamboul District",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "md-56",
        name: {
          km: "រដ្ឋបាលក្រុងព្រះវិហារ",
          en: "Preah Vihear City",
        },
        users: 8,
        activeUsers: 3,
        inactiveUsers: 5,
      },
      {
        id: "md-57",
        name: {
          km: "រដ្ឋបាលស្រុកបាភ្នំ",
          en: "Ba Phnom District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-58",
        name: {
          km: "រដ្ឋបាលស្រុកកំចាយមារ",
          en: "Kamchay Mea District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-59",
        name: {
          km: "រដ្ឋបាលស្រុកកំពង់ត្របែក",
          en: "Kampong Trabek District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-60",
        name: {
          km: "រដ្ឋបាលស្រុកកញ្ជ្រៀច",
          en: "Kanh Chriech District",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "md-61",
        name: {
          km: "រដ្ឋបាលស្រុកមេសាង",
          en: "Mesang District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-62",
        name: {
          km: "រដ្ឋបាលស្រុកពាមជរ",
          en: "Peam Chor District",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "md-63",
        name: {
          km: "រដ្ឋបាលស្រុកពាមរក៍",
          en: "Peam Ro District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-64",
        name: {
          km: "រដ្ឋបាលស្រុកពារាំង",
          en: "Peareang District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-65",
        name: {
          km: "រដ្ឋបាលស្រុកព្រះស្ដេច",
          en: "Preah Sdach District",
        },
        users: 3,
        activeUsers: 3,
        inactiveUsers: 0,
      },
      {
        id: "md-66",
        name: {
          km: "រដ្ឋបាលក្រុងព្រៃវែង",
          en: "Prey Veng City",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-67",
        name: {
          km: "រដ្ឋបាលស្រុកពោធិ៍រៀង",
          en: "Pur Rieng District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-68",
        name: {
          km: "រដ្ឋបាលស្រុកស៊ីធរកណ្តាល",
          en: "Sithor Kandal District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-69",
        name: {
          km: "រដ្ឋបាលស្រុកស្វាយអន្ទរ",
          en: "Svay Antor District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-70",
        name: {
          km: "រដ្ឋបាលក្រុងពោធិ៍សាត់",
          en: "Pursat City",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "md-71",
        name: {
          km: "រដ្ឋបាលក្រុងបានលុង",
          en: "Ban Lung City",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "md-72",
        name: {
          km: "រដ្ឋបាលស្រុកអង្គរជុំ",
          en: "Angkor Chum District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-73",
        name: {
          km: "រដ្ឋបាលស្រុកអង្គរធំ",
          en: "Angkor Thom District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-74",
        name: {
          km: "រដ្ឋបាលស្រុកបន្ទាយស្រី",
          en: "Banteay Srey District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-75",
        name: {
          km: "រដ្ឋបាលស្រុកជីក្រែង",
          en: "Chi Kraeng District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-76",
        name: {
          km: "រដ្ឋបាលស្រុកក្រឡាញ់",
          en: "Kralanh District",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "md-77",
        name: {
          km: "រដ្ឋបាលស្រុកពួក",
          en: "Pouk District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-78",
        name: {
          km: "រដ្ឋបាលស្រុកប្រាសាទបាគង",
          en: "Prasat Bakong District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-79",
        name: {
          km: "រដ្ឋបាលក្រុងសៀមរាប",
          en: "Siem Reap City",
        },
        users: 4,
        activeUsers: 3,
        inactiveUsers: 1,
      },
      {
        id: "md-80",
        name: {
          km: "រដ្ឋបាលស្រុកសូត្រនិគម",
          en: "Sot Nikum District",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "md-81",
        name: {
          km: "រដ្ឋបាលស្រុកស្រីស្នំ",
          en: "Srey Snam District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-82",
        name: {
          km: "រដ្ឋបាលស្រុកស្វាយលើ",
          en: "Svay Leu District",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "md-83",
        name: {
          km: "រដ្ឋបាលស្រុកវ៉ារិន",
          en: "Varin District",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-84",
        name: {
          km: "ក្រុងរុនតាឯកតេជោសែន",
          en: "Run Ta Ek Techo Sen City",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "md-85",
        name: {
          km: "រដ្ឋបាលក្រុងព្រះសីហនុ",
          en: "Preah Sihanoukville City",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "md-86",
        name: {
          km: "រដ្ឋបាលក្រុងកោះរ៉ុង",
          en: "Koh Rong City",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "md-87",
        name: {
          km: "រដ្ឋបាលក្រុងកំពង់សោម",
          en: "Kampong Saom City",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "md-88",
        name: {
          km: "រដ្ឋបាលក្រុងស្ទឹងត្រែង",
          en: "Steung Treng City",
        },
        users: 7,
        activeUsers: 6,
        inactiveUsers: 1,
      },
      {
        id: "md-89",
        name: {
          km: "រដ្ឋបាលក្រុងស្វាយរៀង",
          en: "Svay Rieng City",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "md-90",
        name: {
          km: "រដ្ឋបាលក្រុងបាវិត",
          en: "Bavet City",
        },
        users: 6,
        activeUsers: 3,
        inactiveUsers: 3,
      },
      {
        id: "md-91",
        name: {
          km: "រដ្ឋបាលក្រុងដូនកែវ",
          en: "Doun Keo City",
        },
        users: 7,
        activeUsers: 3,
        inactiveUsers: 4,
      },
      {
        id: "md-92",
        name: {
          km: "រដ្ឋបាលក្រុងសំរោង",
          en: "Samraong City",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "md-93",
        name: {
          km: "រដ្ឋបាលក្រុងកែប",
          en: "Kep City",
        },
        users: 5,
        activeUsers: 3,
        inactiveUsers: 2,
      },
      {
        id: "md-94",
        name: {
          km: "រដ្ឋបាលក្រុងប៉ៃលិន",
          en: "Pailin City",
        },
        users: 5,
        activeUsers: 4,
        inactiveUsers: 1,
      },
      {
        id: "md-95",
        name: {
          km: "រដ្ឋបាលក្រុងសួង",
          en: "Suong City",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
    ],
  },
  {
    id: "departments-of-education-youth-sport",
    label: {
      km: "មន្ទីរអប់រំ យុវជន និងកីឡា រាជធានី-ខេត្ត",
      en: "Departments of Education, Youth and Sport",
    },
    siteCount: 25,
    details: [
      {
        id: "doeys-01",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តបន្ទាយមានជ័យ",
          en: "Banteay Mean Chey Department of Education, Youth and Sport",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "doeys-02",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តបាត់ដំបង",
          en: "Battambang Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 4,
        inactiveUsers: 2,
      },
      {
        id: "doeys-03",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកំពង់ចាម",
          en: "Kampong Cham Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "doeys-04",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកំពង់ឆ្នាំង",
          en: "Kampong Chhnang Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 5,
        inactiveUsers: 1,
      },
      {
        id: "doeys-05",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកំពង់ស្ពឺ",
          en: "Kampong Speu Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "doeys-06",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកំពង់ធំ",
          en: "Kampong Thom Department of Education, Youth and Sport",
        },
        users: 8,
        activeUsers: 6,
        inactiveUsers: 2,
      },
      {
        id: "doeys-07",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកំពត",
          en: "Kampot Department of Education, Youth and Sport",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "doeys-08",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកណ្តាល",
          en: "Kandal Department of Education, Youth and Sport",
        },
        users: 9,
        activeUsers: 7,
        inactiveUsers: 2,
      },
      {
        id: "doeys-09",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកោះកុង",
          en: "Koh Kong Department of Education, Youth and Sport",
        },
        users: 8,
        activeUsers: 5,
        inactiveUsers: 3,
      },
      {
        id: "doeys-10",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តក្រចេះ",
          en: "Kratie Department of Education, Youth and Sport",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "doeys-11",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តមណ្ឌលគិរី",
          en: "Mondulkiri Department of Education, Youth and Sport",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "doeys-12",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា រាជធានីភ្នំពេញ",
          en: "Phnom Penh Capital Department of Education, Youth and Sport",
        },
        users: 8,
        activeUsers: 8,
        inactiveUsers: 0,
      },
      {
        id: "doeys-13",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តព្រះវិហារ",
          en: "Preah Vihear Department of Education, Youth and Sport",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "doeys-14",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តព្រៃវែង",
          en: "Prey Veng Department of Education, Youth and Sport",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "doeys-15",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តពោធិ៍សាត់",
          en: "Pursat Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "doeys-16",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តរតនគិរី",
          en: "Rattanakiri Department of Education, Youth and Sport",
        },
        users: 9,
        activeUsers: 7,
        inactiveUsers: 2,
      },
      {
        id: "doeys-17",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តសៀមរាប",
          en: "Siem Reap Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "doeys-18",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តព្រះសីហនុ",
          en: "Preah Sihanouk Department of Education, Youth and Sport",
        },
        users: 4,
        activeUsers: 4,
        inactiveUsers: 0,
      },
      {
        id: "doeys-19",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តស្ទឹងត្រែង",
          en: "Steung Treng Department of Education, Youth and Sport",
        },
        users: 7,
        activeUsers: 7,
        inactiveUsers: 0,
      },
      {
        id: "doeys-20",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តស្វាយរៀង",
          en: "Svay Rieng Department of Education, Youth and Sport",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
      {
        id: "doeys-21",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តតាកែវ",
          en: "Takeo Department of Education, Youth and Sport",
        },
        users: 9,
        activeUsers: 9,
        inactiveUsers: 0,
      },
      {
        id: "doeys-22",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តឧត្តរមានជ័យ",
          en: "Oddar Meanchey Department of Education, Youth and Sport",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "doeys-23",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តកែប",
          en: "Kep Department of Education, Youth and Sport",
        },
        users: 5,
        activeUsers: 5,
        inactiveUsers: 0,
      },
      {
        id: "doeys-24",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តប៉ៃលិន",
          en: "Pailin Department of Education, Youth and Sport",
        },
        users: 6,
        activeUsers: 6,
        inactiveUsers: 0,
      },
      {
        id: "doeys-25",
        name: {
          km: "មន្ទីរអប់រំ យុវជន និងកីឡា ខេត្តត្បូងឃ្មុំ",
          en: "Tboung Khmum Department of Education, Youth and Sport",
        },
        users: 8,
        activeUsers: 7,
        inactiveUsers: 1,
      },
    ],
  },
];

const CAT_COLORS = ["#38bdf8", "#34d399", "#a78bfa", "#fb923c", "#f472b6", "#facc15"];


const totalActive = userGroups.reduce((s, g) => s + g.active, 0);
const totalInactive = userGroups.reduce((s, g) => s + g.inactive, 0);
const totalUsers = totalActive + totalInactive;
const usersTrend = { value: 4.2, up: true };

const totalSites = siteGroups.reduce((s, g) => s + g.count, 0);
const sitesTrend = { value: 0.26, up: true };

const totalReports = BUData.reduce((s, d) => s + d.reports, 0);



const reportCategoryLabels: Record<string, LocalizedText> = {
  financial: { km: "របាយការណ៍ហិរញ្ញវត្ថុ", en: "Financial Reports" },
  budgetExec: { km: "របាយការណ៍អនុវត្តថវិកា", en: "Budget Execution Reports" },
  budgetClosing: { km: "របាយការណ៍បិទបញ្ជី", en: "Budget Closing Reports" },
  settlementLaw: { km: "របាយការណ៍ច្បាប់ទូទាត់", en: "Budget Settlement Law Reports" },
  standard: { km: "របាយការណ៍ស្តង់ដារអន្តរជាតិ", en: "International Standard Reports" },
};

const uiText: Record<string, LocalizedText> = {
  navUsersSites: { km: "អ្នកប្រើប្រាស់ និងការដ្ឋាន", en: "Users and Sites" },
  navReportsQueries: { km: "របាយការណ៍ និងរបាយការណ៍ប្រតិបត្តិការលម្អិត", en: "Reports and Queries" },
  language: { km: "ភាសា", en: "Language" },
  theme: { km: "ពណ៌ផ្ទៃ", en: "Theme" },
  lightMode: { km: "ប្ដូរទៅផ្ទៃភ្លឺ", en: "Switch to light mode" },
  darkMode: { km: "ប្ដូរទៅផ្ទៃងងឹត", en: "Switch to dark mode" },
  khmer: { km: "ខ្មែរ", en: "Khmer" },
  english: { km: "អង់គ្លេស", en: "English" },
  totalSites: { km: "ចំនួនការដ្ឋានសរុប", en: "Total Sites" },
  totalUsers: { km: "ចំនួនអ្នកប្រើប្រាស់សរុប", en: "Total Users" },
  comparedLastMonth: { km: "ធៀបនឹងខែមុន", en: "vs. last month" },
  active: { km: "សកម្ម", en: "Active" },
  inactive: { km: "អសកម្ម", en: "Inactive" },
  geographicDistribution: { km: "របាយភូមិសាស្ត្រ", en: "Geographic Distribution" },
  provinceDetails: { km: "ទិន្នន័យលម្អិតតាមរាជធានី/ខេត្ត", en: "Details by Capital/Province" },
  usersSitesByCategory: { km: "ទិន្នន័យអ្នកប្រើប្រាស់ និងការដ្ឋានតាមប្រភេទអង្គភាព", en: "Users and Sites by Organization Category" },
  organizations: { km: "អង្គភាព", en: "Organizations" },
  organization: { km: "ឈ្មោះអង្គភាព", en: "Organization" },
  code: { km: "កូដ", en: "Code" },
  terminated: { km: "បញ្ចប់ការប្រើប្រាស់", en: "Terminated" },
  province: { km: "រាជធានី/ខេត្ត", en: "Capital/Province" },
  sites: { km: "ការដ្ឋាន", en: "Sites" },
  users: { km: "អ្នកប្រើប្រាស់", en: "Users" },
  totalReports: { km: "ចំនួនរបាយការណ៍សរុប", en: "Total Report" },
  totalQueries: { km: "ចំនួនរបាយការណ៍ប្រតិបត្តិការលម្អិតសរុប", en: "Total Query" },
  reportsByCategory: { km: "របាយការណ៍តាមប្រភេទ", en: "Reports by Category" },
  queriesByFunction: { km: "របាយការណ៍ប្រតិបត្តិការលម្អិតតាមមុខងារ", en: "Queries by Function" },
  topReports: { km: "ប្រភេទរបាយការណ៍ដែលទាញចេញច្រើនជាងគេទាំង៥", en: "Top 5 Most Generated Reports" },
  topQueries: { km: "ប្រភេទរបាយការណ៍ប្រតិបត្តិការលម្អិតដែលទាញចេញច្រើនជាងគេទាំង៥", en: "Top 5 Most Generated Queries" },
  totalGeneratedReports: { km: "ចំនួនការទាញរបាយការណ៍សរុប", en: "Total Generated Reports" },
  totalGeneratedQueries: { km: "ចំនួនការទាញរបាយការណ៍ប្រតិបត្តិការលម្អិតសរុប", en: "Total Generated Queries" },
  nationalUsage: { km: "ការទាញរបាយការណ៍ថ្នាក់ជាតិ", en: "National-level Report Usage" },
  nationalUsageSubtext: { km: "ទិន្នន័យរបាយការណ៍ និងរបាយការណ៍ប្រតិបត្តិការលម្អិតថ្នាក់ជាតិដែលទាញចេញពី FMIS ច្រើនជាងគេ", en: "National-level FMIS reports and queries with the highest usage" },
  subnationalUsage: { km: "ការទាញរបាយការណ៍ថ្នាក់ក្រោមជាតិ", en: "Sub-national Report Usage" },
  subnationalUsageSubtext: { km: "ទិន្នន័យរបាយការណ៍ និងរបាយការណ៍ប្រតិបត្តិការលម្អិតថ្នាក់ក្រោមជាតិដែលទាញចេញពី FMIS ច្រើនជាងគេ", en: "Sub-national FMIS reports and queries with the highest usage" },
  topReportUnits: { km: "អង្គភាពដែលទាញរបាយការណ៍ច្រើនជាងគេទាំង ១០", en: "Top 10 Units Generating Reports" },
  topQueryUnits: { km: "អង្គភាពដែលទាញរបាយការណ៍ប្រតិបត្តិការលម្អិតច្រើនជាងគេទាំង ១០", en: "Top 10 Units Running Queries" },
  back: { km: "ត្រឡប់ទៅក្រោយ", en: "Back" },
  reportTypes: { km: "ប្រភេទរបាយការណ៍", en: "Report Types" },
  queryTypes: { km: "ប្រភេទរបាយការណ៍ប្រតិបត្តិការលម្អិត", en: "Query Types" },
  clickCategory: { km: "ចុចលើប្រភេទនីមួយៗដើម្បីមើលលម្អិត", en: "Select a category to view details" },
  clickDetails: { km: "ចុចមើលលម្អិត", en: "Click to view details" },
  details: { km: "លម្អិត", en: "Details" },
  searchPlaceholder: { km: "ស្វែងរកតាមលេខកូដ ឈ្មោះ ឈ្មោះអង់គ្លេស ឬអង្គភាព…", en: "Search by code, name, Khmer name, or entity…" },
  code: { km: "លេខកូដ", en: "Code" },
  reportName: { km: "ឈ្មោះរបាយការណ៍", en: "Report Name" },
  englishName: { km: "ឈ្មោះជាភាសាអង់គ្លេស", en: "English Name" },
  khmerName: { km: "ឈ្មោះជាភាសាខ្មែរ", en: "Khmer Name" },
  category: { km: "ប្រភេទរបាយការណ៍", en: "Category" },
  entities: { km: "អង្គភាពប្រើប្រាស់", en: "Entities Use" },
  noMatches: { km: "រកមិនឃើញទិន្នន័យដែលត្រូវគ្នា", en: "No matches found" },
  close: { km: "បិទ", en: "Close" },
  noGlossary: { km: "មិនទាន់មានការពិពណ៌នាសម្រាប់អក្សរកាត់នេះទេ។", en: "No description has been added for this shortcut." },
  noDescription: { km: "មិនទាន់មានការពិពណ៌នា។", en: "No description is available." },
  reports: { km: "របាយការណ៍", en: "Reports" },
  queries: { km: "របាយការណ៍ប្រតិបត្តិការលម្អិត", en: "Queries" },
  developedBy: { km: "រៀបចំឡើងដោយការិយាល័យគ្រប់គ្រងព័ត៌មាន", en: "Developed by the Office of Information Management" },
  reportingPeriod: { km: "ទិន្នន័យក្នុងឆ្នាំ ២០២៦ (មករា-មិថុនា)", en: "Data for 2026 (January–June)" },
};

const organizationEnglishNames: Record<string, string> = {
  GDNT: "General Department of National Treasury",
  GID: "General Department of Identification",
  GDPFMIT: "General Department of Information Technology",
  GDIA: "General Department of Internal Audit",
  GDB: "General Department of Budget",
  DEF01: "Banteay Meanchey Department of Economy and Finance",
  DEF05: "Kampong Speu Department of Economy and Finance",
  DEF08: "Kandal Department of Economy and Finance",
  LM10: "Ministry of Economy and Finance",
  LM15: "Ministry of Commerce",
  LM16: "Ministry of Education, Youth and Sport",
  LM17: "Ministry of Agriculture, Forestry and Fisheries",
  LM22: "Ministry of Post and Telecommunications",
  LM26: "Ministry of Justice",
  LM28: "Ministry of Land Management, Urban Planning and Construction",
  LM72: "Ministry of Interior",
  PT001: "Banteay Meanchey Provincial Treasury",
  PT002: "Battambang Provincial Treasury",
  PT003: "Kampong Cham Provincial Treasury",
  PT004: "Kampong Chhnang Provincial Treasury",
  PT005: "Kampong Speu Provincial Treasury",
  PT006: "Kampong Thom Provincial Treasury",
  PT008: "Kandal Provincial Treasury",
  PT009: "Koh Kong Provincial Treasury",
  PT010: "Kratie Provincial Treasury",
  PT012: "Phnom Penh Capital Treasury",
  PT014: "Prey Veng Provincial Treasury",
  PT017: "Siem Reap Provincial Treasury",
  PT018: "Preah Sihanoukville Provincial Treasury",
  PT020: "Svay Rieng Provincial Treasury",
  PT025: "Tboung Khmum Provincial Treasury",
};


const reportDetailMap = Object.fromEntries(
  categoryData.flatMap((category) => category.details.map((detail) => [detail.code, detail]))
) as Record<string, CategoryDetail>;

const queryDetailMap = Object.fromEntries(
  categoryQueryData.flatMap((category) => category.details.map((detail) => [detail.code, detail]))
) as Record<string, CategoryDetail>;

function getLocalizedName(detail: CategoryDetail | undefined, language: Language): string {
  if (!detail) return "";
  return language === "km" ? detail.name : detail.englishName;
}

function getOrganizationName(name: string, language: Language): string {
  if (language === "km") return name;
  const code = name.split(":")[0].trim();
  const englishName = organizationEnglishNames[code];
  return englishName ? `${code}: ${englishName}` : name;
}


function fmt(n: number): string {
  return n.toLocaleString("en-US");
}

const TrendBadge = ({ value, up, size = "md" }: { value: number; up: boolean; size?: "sm" | "md" }) => {
  const iconSize = size === "sm" ? 7 : 8;
  return (
    <span className={`flex items-center gap-1 font-medium rounded-full
      ${size === "sm" ? "text-[10px] px-1.5 py-0.5" : "text-[10px] px-2 py-0.5"}
      ${up ? "text-emerald-400 bg-emerald-400/10" : "text-red-400 bg-red-400/10"}`}>
      {up
        ? <svg width={iconSize} height={iconSize} viewBox="0 0 10 10" fill="none"><path d="M5 2L9 7H1L5 2Z" fill="currentColor" /></svg>
        : <svg width={iconSize} height={iconSize} viewBox="0 0 10 10" fill="none"><path d="M5 8L9 3H1L5 8Z" fill="currentColor" /></svg>
      }
      {value}%
    </span>
  );
};

const CustomBarTooltip = ({ active, payload, label, valueLabel }: any) => {
  if (!active || !payload?.length) return null;
  const data = payload[0].payload;
  const displayLabel = data.fullName ? `${label}: ${data.fullName}` : label;
  return (
    <div className="bg-popover border border-border rounded-lg px-3 py-2 shadow-xl text-xs">
      <p className="text-foreground font-semibold mb-1">{displayLabel}</p>
      <p className="text-sky-400">{valueLabel}: {payload[0].value.toLocaleString()}</p>
    </div>
  );
};

const KpiCard = ({
  label, value, icon: Icon, color, bg, onClick,
}: {
  label: string; value: string; icon: any; color: string; bg: string; onClick?: () => void;
}) => (
  <div
    onClick={onClick}
    className={`bg-card/90 border border-border rounded-xl p-5 flex items-center gap-4 backdrop-blur-xl transition-all duration-300
      ${onClick ? "cursor-pointer hover:border-sky-400/40" : ""}`}
  >
    <div className={`${bg} p-3 rounded-xl`}>
      <Icon className={`w-5 h-5 ${color}`} />
    </div>
    <div>
      <p className="text-muted-foreground text-xs font-medium tracking-widest uppercase mb-0.5 font-hanuman">{label}</p>
      <p className="text-2xl font-semibold tracking-tight font-hanuman">{value}</p>
    </div>
  </div>
);

const FlagIcon = ({ language }: { language: Language }) => {
  if (language === "km") {
    return (
      <svg
        viewBox="0 0 30 20"
        className="h-5 w-7 rounded-[2px] shadow-sm"
        aria-hidden="true"
      >
        <rect width="30" height="20" fill="#032EA1" />
        <rect y="5" width="30" height="10" fill="#E00025" />
        <g fill="#FFFFFF">
          <path d="M8 13.7h14v1.1H8z" />
          <path d="M9.2 12.4h11.6v1.1H9.2z" />
          <path d="M10.2 9.7h2.5v2.8h-2.5zM17.3 9.7h2.5v2.8h-2.5z" />
          <path d="M13.4 8.7h3.2v3.8h-3.2z" />
          <path d="M10.4 9.7l1.05-1.8 1.05 1.8zM13.55 8.7L15 6.4l1.45 2.3zM17.5 9.7l1.05-1.8 1.05 1.8z" />
        </g>
      </svg>
    );
  }

  return (
    <svg
      viewBox="0 0 60 40"
      className="h-5 w-7 rounded-[2px] shadow-sm"
      aria-hidden="true"
    >
      <rect width="60" height="40" fill="#012169" />
      <path d="M0 0l60 40M60 0L0 40" stroke="#FFFFFF" strokeWidth="8" />
      <path d="M0 0l60 40M60 0L0 40" stroke="#C8102E" strokeWidth="4" />
      <path d="M30 0v40M0 20h60" stroke="#FFFFFF" strokeWidth="12" />
      <path d="M30 0v40M0 20h60" stroke="#C8102E" strokeWidth="7" />
    </svg>
  );
};

const LanguageSwitcher = ({ language, setLanguage, t }: {
  language: Language;
  setLanguage: (language: Language) => void;
  t: (key: string) => string;
}) => (
  <div
    className="flex items-center bg-card border border-border rounded-full p-1 gap-1"
    role="group"
    aria-label={t("language")}
  >
    <button
      type="button"
      onClick={() => setLanguage("km")}
      aria-label="ប្តូរទៅភាសាខ្មែរ — Switch to Khmer"
      title="ភាសាខ្មែរ"
      aria-pressed={language === "km"}
      className={`flex h-8 w-10 items-center justify-center rounded-full transition-all ${language === "km"
        ? "bg-sky-400/20 ring-2 ring-sky-400"
        : "opacity-60 hover:bg-muted hover:opacity-100"
        }`}
    >
      <FlagIcon language="km" />
    </button>

    <button
      type="button"
      onClick={() => setLanguage("en")}
      aria-label="Switch to English — ប្តូរទៅភាសាអង់គ្លេស"
      title="English"
      aria-pressed={language === "en"}
      className={`flex h-8 w-10 items-center justify-center rounded-full transition-all ${language === "en"
        ? "bg-sky-400/20 ring-2 ring-sky-400"
        : "opacity-60 hover:bg-muted hover:opacity-100"
        }`}
    >
      <FlagIcon language="en" />
    </button>
  </div>
);


const ThemeSwitcher = ({
  theme,
  setTheme,
  t,
}: {
  theme: Theme;
  setTheme: (theme: Theme) => void;
  t: (key: string) => string;
}) => {
  const isDark = theme === "dark";
  const nextTheme: Theme = isDark ? "light" : "dark";

  return (
    <button
      type="button"
      onClick={() => setTheme(nextTheme)}
      aria-label={isDark ? t("lightMode") : t("darkMode")}
      title={isDark ? t("lightMode") : t("darkMode")}
      className="group flex h-[42px] w-[42px] items-center justify-center rounded-full border border-border bg-card text-foreground shadow-sm backdrop-blur-xl transition-all duration-300 hover:-translate-y-0.5 hover:border-sky-400/50 hover:bg-accent hover:text-sky-400 hover:shadow-[0_10px_30px_rgba(56,189,248,0.16)] focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-sky-400"
    >
      <span className="relative flex h-5 w-5 items-center justify-center">
        <Sun
          className={`absolute h-5 w-5 transition-all duration-300 ${isDark ? "rotate-0 scale-100 opacity-100" : "-rotate-90 scale-0 opacity-0"
            }`}
        />
        <Moon
          className={`absolute h-5 w-5 transition-all duration-300 ${isDark ? "rotate-90 scale-0 opacity-0" : "rotate-0 scale-100 opacity-100"
            }`}
        />
      </span>
    </button>
  );
};

const ExpandableDetailTable = ({
  rows, accent, categoryLabel, language, t,
}: {
  rows: CategoryDetail[];
  accent: string;
  categoryLabel: string;
  language: Language;
  t: (key: string) => string;
}) => {
  const [search, setSearch] = useState("");
  const [expandedCode, setExpandedCode] = useState<string | null>(null);

  const filtered = rows.filter((r) => {
    const q = search.trim().toLowerCase();
    if (!q) return true;
    return (
      r.code.toLowerCase().includes(q) ||
      r.name.toLowerCase().includes(q) ||
      r.englishName.toLowerCase().includes(q) ||
      (r.entityUsed || "").toLowerCase().includes(q)
    );
  });

  return (
    <div className="bg-card/90 border border-border rounded-xl overflow-hidden backdrop-blur-xl">
      <div className="p-4 border-b border-border">
        <input
          value={search}
          onChange={(e) => setSearch(e.target.value)}
          placeholder={t("searchPlaceholder")}
          className="w-full bg-background border border-border rounded-lg px-3 py-2 text-xs outline-none focus:border-sky-400/40 text-foreground placeholder:text-muted-foreground"
          style={{ fontFamily: language === "km" ? "Hanuman" : "inherit" }}
        />
      </div>

      <div className="overflow-auto max-h-[520px]">
        <table className="w-full text-xs">
          <thead className="sticky top-0 bg-card z-10">
            <tr className="border-b border-border">
              <th className="text-left px-5 py-3 text-muted-foreground font-medium w-20">{t("code")}</th>
              <th className="text-left px-5 py-3 text-muted-foreground font-medium">{t("reportName")}</th>
              <th className="text-left px-5 py-3 text-muted-foreground font-medium">{language === "km" ? t("englishName") : t("khmerName")}</th>
              <th className="text-left px-5 py-3 text-muted-foreground font-medium w-44">{t("category")}</th>
              <th className="text-left px-5 py-3 text-muted-foreground font-medium w-44">{t("entities")}</th>
              <th className="w-8" />
            </tr>
          </thead>

          <tbody>
            {filtered.length === 0 && (
              <tr>
                <td colSpan={6} className="px-5 py-8 text-center text-muted-foreground">{t("noMatches")}</td>
              </tr>
            )}

            {filtered.map((r) => {
              const isOpen = expandedCode === r.code;
              const primaryName = language === "km" ? r.name : r.englishName;
              const secondaryName = language === "km" ? r.englishName : r.name;
              const description = r.description;

              return (
                <Fragment key={r.code}>
                  <tr
                    onClick={() => setExpandedCode(isOpen ? null : r.code)}
                    className="border-b border-border/50 hover:bg-accent/35 transition-colors cursor-pointer"
                  >
                    <td className="px-5 py-3 font-mono font-semibold" style={{ color: accent }}>{r.code}</td>
                    <td className="px-5 py-3 font-medium text-foreground" style={{ fontFamily: language === "km" ? "Hanuman" : "inherit" }}>{primaryName}</td>
                    <td className="px-5 py-3 text-muted-foreground" style={{ fontFamily: language === "en" ? "Hanuman" : "inherit" }}>{secondaryName}</td>
                    <td className="px-5 py-3 text-muted-foreground">{categoryLabel}</td>
                    <td className="px-5 py-3 text-muted-foreground">
                      <EntityUsedCell value={r.entityUsed} language={language} t={t} />
                    </td>
                    <td className="px-5 py-3 text-muted-foreground">
                      <svg width="10" height="10" viewBox="0 0 10 10" fill="none" className={`transition-transform ${isOpen ? "rotate-180" : ""}`}>
                        <path d="M2 3.5L5 6.5L8 3.5" stroke="currentColor" strokeWidth="1.3" strokeLinecap="round" strokeLinejoin="round" />
                      </svg>
                    </td>
                  </tr>

                  {isOpen && (
                    <tr className="border-b border-border/50 bg-accent/20">
                      <td colSpan={6} className="px-5 py-4">
                        <p className="text-[11px] text-muted-foreground leading-relaxed" style={{ fontFamily: "Hanuman", whiteSpace: "pre-wrap" }}>
                          {description}
                        </p>
                      </td>
                    </tr>
                  )}
                </Fragment>
              );
            })}
          </tbody>
        </table>
      </div>
    </div>
  );
};

const EntityUsedCell = ({ value, language, t }: {
  value?: string;
  language: Language;
  t: (key: string) => string;
}) => {
  const [openShortcut, setOpenShortcut] = useState<string | null>(null);
  const shortcuts = (value || "").split(",").map((item) => item.trim()).filter(Boolean);

  if (shortcuts.length === 0) return <span className="text-muted-foreground">—</span>;
  const activeEntity = openShortcut ? entityGlossaryMap[openShortcut] : null;

  return (
    <div className="space-y-2" onClick={(e) => e.stopPropagation()}>
      <div className="flex flex-wrap gap-1.5">
        {shortcuts.map((shortcut) => {
          const isOpen = openShortcut === shortcut;
          const glossary = entityGlossaryMap[shortcut];
          const title = glossary ? (language === "km" ? glossary.khmerName : glossary.englishName) : t("noGlossary");
          return (
            <button
              key={shortcut}
              type="button"
              onClick={(e) => {
                e.stopPropagation();
                setOpenShortcut(isOpen ? null : shortcut);
              }}
              className={`inline-flex items-center gap-1 rounded-full border px-2 py-1 text-[10px] font-semibold transition-colors ${isOpen ? "border-sky-400/60 bg-sky-400/10 text-sky-300" : "border-border bg-background text-foreground hover:border-sky-400/50"}`}
              title={title}
            >
              {shortcut}<span className="text-[9px] text-muted-foreground">ⓘ</span>
            </button>
          );
        })}
      </div>

      {openShortcut && (
        <div className="rounded-lg border border-border bg-background/70 p-3 shadow-sm">
          <div className="flex items-center justify-between gap-3 mb-1">
            <p className="text-[11px] font-bold text-sky-400">{openShortcut}</p>
            <button type="button" onClick={(e) => { e.stopPropagation(); setOpenShortcut(null); }} className="text-[10px] text-muted-foreground hover:text-foreground">
              {t("close")}
            </button>
          </div>
          {activeEntity ? (
            <p className="text-[11px] text-foreground leading-relaxed" style={{ fontFamily: language === "km" ? "Hanuman" : "inherit" }}>
              {language === "km" ? activeEntity.khmerName : activeEntity.englishName}
            </p>
          ) : (
            <p className="text-[11px] text-muted-foreground">{t("noGlossary")}</p>
          )}
        </div>
      )}
    </div>
  );
};

const UserSiteCategoryAccordion = ({
  categories,
  expandedId,
  setExpandedId,
  language,
  t,
}: {
  categories: UserSiteCategory[];
  expandedId: string | null;
  setExpandedId: (id: string | null) => void;
  language: Language;
  t: (key: string) => string;
}) => {
  const optionalNumber = (value?: number) =>
    value === undefined ? "—" : fmt(value);

  return (
    <div className="flex flex-col gap-3">
      {categories.map((category, index) => {
        const isOpen = expandedId === category.id;
        const accent = CAT_COLORS[index % CAT_COLORS.length];
        const enteredSites = category.details.reduce(
          (sum, detail) => sum + (detail.sites ?? 1),
          0,
        );
        const calculatedUsers = category.details.reduce(
          (sum, detail) => sum + (detail.users ?? 0),
          0,
        );
        const displayedUsers = category.userCount ?? calculatedUsers;
        const hasUserData =
          category.userCount !== undefined ||
          category.details.some((detail) => detail.users !== undefined);
        const isComplete = enteredSites === category.siteCount;

        return (
          <div
            key={category.id}
            className="bg-card/90 border border-border rounded-xl overflow-hidden backdrop-blur-xl"
            style={{ borderLeftColor: accent, borderLeftWidth: 3 }}
          >
            <button
              type="button"
              onClick={() => setExpandedId(isOpen ? null : category.id)}
              className="w-full flex items-center justify-between gap-4 px-5 py-4 text-left hover:bg-accent/35 transition-colors"
              aria-expanded={isOpen}
              aria-controls={`${category.id}-details`}
            >
              <div className="min-w-0">
                <p
                  className="text-sm font-semibold text-foreground leading-relaxed"
                  style={{
                    fontFamily: language === "km" ? "Hanuman" : "inherit",
                  }}
                >
                  {category.label[language]}
                </p>

                <p
                  className={`text-[11px] mt-1 ${isComplete && category.siteCount > 0
                    ? "text-emerald-500"
                    : "text-muted-foreground"
                    }`}
                >
                  {language === "km"
                    ? `${fmt(
                      category.siteCount,
                    )} អង្គភាព`
                    : `${fmt(
                      category.siteCount,
                    )} organizations`}
                </p>
              </div>

              <div className="flex items-center gap-4 sm:gap-6 flex-shrink-0">
                <div className="text-right min-w-[52px]">
                  <p className="text-sm font-semibold text-emerald-500">
                    {fmt(category.siteCount)}
                  </p>
                  <p className="text-[10px] text-muted-foreground">
                    {t("sites")}
                  </p>
                </div>

                <div className="text-right min-w-[58px]">
                  <p className="text-sm font-semibold text-sky-500">
                    {hasUserData ? fmt(displayedUsers) : "—"}
                  </p>
                  <p className="text-[10px] text-muted-foreground">
                    {t("users")}
                  </p>
                </div>

                <svg
                  width="16"
                  height="16"
                  viewBox="0 0 16 16"
                  fill="none"
                  className={`text-muted-foreground transition-transform duration-200 ${isOpen ? "rotate-90" : ""
                    }`}
                  aria-hidden="true"
                >
                  <path
                    d="M6 3L11 8L6 13"
                    stroke="currentColor"
                    strokeWidth="1.5"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  />
                </svg>
              </div>
            </button>

            {isOpen && (
              <div
                id={`${category.id}-details`}
                className="border-t border-border"
              >
                {category.details.length === 0 ? (
                  <div className="p-5">
                    <div className="rounded-lg border border-dashed border-border bg-background/45 px-4 py-6 text-center">
                      <p
                        className="text-sm font-medium text-foreground"
                        style={{
                          fontFamily:
                            language === "km" ? "Hanuman" : "inherit",
                        }}
                      >
                        {language === "km"
                          ? "មិនទាន់មានទិន្នន័យលម្អិត"
                          : "No detailed organization data yet"}
                      </p>

                    </div>
                  </div>
                ) : (
                  <div className="overflow-auto max-h-[430px]">
                    <table className="w-full min-w-[900px] text-xs relative">
                      <thead className="sticky top-0 bg-card z-10">
                        <tr className="border-b border-border">
                          <th className="text-left px-5 py-3 text-muted-foreground font-medium">
                            #
                          </th>
                          <th className="text-left px-5 py-3 text-muted-foreground font-medium">
                            {t("organization")}
                          </th>
                          <th className="text-right px-5 py-3 text-muted-foreground font-medium">
                            {t("users")}
                          </th>
                          <th className="text-right px-5 py-3 text-muted-foreground font-medium">
                            {t("active")}
                          </th>
                          <th className="text-right px-5 py-3 text-muted-foreground font-medium">
                            {t("inactive")}
                          </th>

                        </tr>
                      </thead>

                      <tbody>
                        {category.details.map((detail, detailIndex) => (
                          <tr
                            key={detail.id}
                            className="border-b border-border/50 hover:bg-accent/35 transition-colors"
                          >
                            <td className="px-5 py-3 text-muted-foreground">
                              {detailIndex + 1}
                            </td>
                            <td
                              className="px-5 py-3 font-medium text-foreground"
                              style={{
                                fontFamily:
                                  language === "km" ? "Hanuman" : "inherit",
                              }}
                            >
                              {detail.name[language]}
                            </td>
                            <td className="px-5 py-3 text-right text-sky-500 font-semibold">
                              {optionalNumber(detail.users)}
                            </td>
                            <td className="px-5 py-3 text-right text-emerald-500">
                              {optionalNumber(detail.activeUsers)}
                            </td>
                            <td className="px-5 py-3 text-right text-yellow-500">
                              {optionalNumber(detail.inactiveUsers)}
                            </td>

                          </tr>
                        ))}
                      </tbody>
                    </table>
                  </div>
                )}
              </div>
            )}
          </div>
        );
      })}
    </div>
  );
};

const CategoryAccordion = ({
  categories, expandedId, setExpandedId, colors, getName, language, t,
}: {
  categories: { id: string; name: string; details: CategoryDetail[];[key: string]: any }[];
  expandedId: string | null;
  setExpandedId: (id: string | null) => void;
  colors: string[];
  getName: (c: any) => string;
  language: Language;
  t: (key: string) => string;
}) => (
  <div className="flex flex-col gap-3">
    {categories.map((c, i) => {
      const isOpen = expandedId === c.id;
      const accent = colors[i % colors.length];
      const displayName = getName(c);
      return (
        <div key={c.id} className="bg-card/90 border border-border rounded-xl overflow-hidden backdrop-blur-xl">
          <button onClick={() => setExpandedId(isOpen ? null : c.id)} className="w-full flex items-center justify-between px-5 py-4 text-left hover:bg-accent/35 transition-colors">
            <div>
              <p className="text-sm font-semibold text-foreground" style={{ fontFamily: language === "km" ? "Hanuman" : "inherit" }}>{displayName}</p>
              <p className="text-[10px] text-muted-foreground mt-0.5">{t("clickDetails")}</p>
            </div>
            <div className="flex items-center gap-3">
              <span className="text-[10px] font-medium text-muted-foreground">{t("details")}</span>
              <svg width="14" height="14" viewBox="0 0 16 16" fill="none" className={`text-muted-foreground transition-transform flex-shrink-0 ${isOpen ? "rotate-90" : ""}`}>
                <path d="M6 3L11 8L6 13" stroke="currentColor" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round" />
              </svg>
            </div>
          </button>
          {isOpen && (
            <div className="border-t border-border p-4">
              <ExpandableDetailTable rows={c.details} accent={accent} categoryLabel={displayName} language={language} t={t} />
            </div>
          )}
        </div>
      );
    })}
  </div>
);

const HorizontalBarChart = ({ data, dataKey, color, reversed, labelPosition, yAxisOrientation, title, valueLabel, margin }: {
  data: any[];
  dataKey: string;
  color: string;
  reversed?: boolean;
  labelPosition: "right" | "insideLeft";
  yAxisOrientation: "left" | "right";
  title: string;
  valueLabel: string;
  margin?: { top?: number; right?: number; left?: number; bottom?: number };
}) => (
  <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl">
    <h2 className="text-sm font-semibold text-foreground mb-3">{title}</h2>
    <ResponsiveContainer width="100%" height={280}>
      <BarChart data={data} layout="vertical" margin={{ top: 0, right: 60, left: 8, bottom: 0, ...margin }} barSize={10}>
        <XAxis type="number" hide reversed={reversed} />
        <YAxis type="category" dataKey="name" orientation={yAxisOrientation} tick={{ fill: "var(--chart-axis)", fontSize: 11, fontFamily: "Hanuman" }} axisLine={false} tickLine={false} width={250} />
        <Tooltip content={({ active, payload, label }) => {
          if (!active || !payload?.length) return null;
          return (
            <div className="bg-popover border border-border rounded-lg px-3 py-2 shadow-xl text-xs">
              <p className="text-foreground font-semibold mb-1">{label}</p>
              <p style={{ color }}>{valueLabel}: {payload[0].value.toLocaleString()}</p>
            </div>
          );
        }} />
        <Bar dataKey={dataKey} fill={color} radius={[0, 4, 4, 0]}>
          <LabelList dataKey={dataKey} position={labelPosition} style={{ fill: "var(--chart-label)", fontSize: 11, fontFamily: "Hanuman" }} formatter={(v: number) => v.toLocaleString()} />
        </Bar>
      </BarChart>
    </ResponsiveContainer>
  </div>
);

export default function App() {
  const [page, setPage] = useState<"users" | "reports" | "reportTypes" | "queryTypes">("users");
  const [language, setLanguage] = useState<Language>(() => {
    if (typeof window === "undefined") return "km";
    return window.localStorage.getItem("dashboard-language") === "en" ? "en" : "km";
  });
  const [theme, setTheme] = useState<Theme>(() => {
    if (typeof window === "undefined") return "light";

    const savedTheme = window.localStorage.getItem("dashboard-theme");
    if (savedTheme === "light" || savedTheme === "dark") return savedTheme;

    return window.matchMedia("(prefers-color-scheme: dark)").matches
      ? "dark"
      : "light";
  });
  const [expandedReportId, setExpandedReportId] = useState<string | null>(null);
  const [expandedQueryId, setExpandedQueryId] = useState<string | null>(null);
  const [expandedUserSiteCategoryId, setExpandedUserSiteCategoryId] = useState<string | null>(null);

  useEffect(() => {
    window.localStorage.setItem("dashboard-language", language);
    document.documentElement.lang = language === "km" ? "km" : "en";
  }, [language]);

  useEffect(() => {
    const root = document.documentElement;
    const isDark = theme === "dark";

    root.classList.toggle("dark", isDark);
    root.style.colorScheme = theme;
    root.dataset.theme = theme;
    window.localStorage.setItem("dashboard-theme", theme);
  }, [theme]);

  const t = (key: string) => uiText[key]?.[language] ?? key;

  const reportCategoryChartData = useMemo(() => categoryData.map((category) => ({
    ...category,
    name: reportCategoryLabels[category.id]?.[language] ?? category.name,
  })), [language]);

  const queryCategoryChartData = useMemo(() => categoryQueryData.map((category) => ({
    ...category,
    fullName: categoryQueryLabels[category.name]?.[language] ?? category.name,
  })), [language]);

  const reportTop5ChartData = useMemo(() => reportTop5gen.map((item) => ({
    ...item,
    fullName: getLocalizedName(reportDetailMap[item.name], language) || item.fullName,
  })), [language]);

  const queryTop5ChartData = useMemo(() => queryTop5gen.map((item) => ({
    ...item,
    fullName: getLocalizedName(queryDetailMap[item.name], language) || item.fullName,
  })), [language]);

  const localizedReportNatBUData = useMemo(() => reportNatBUData.map((item) => ({ ...item, name: getOrganizationName(item.name, language) })), [language]);
  const localizedQueryNatBUData = useMemo(() => queryNatBUData.map((item) => ({ ...item, name: getOrganizationName(item.name, language) })), [language]);
  const localizedReportSubNatBUData = useMemo(() => reportsubNatBUData.map((item) => ({ ...item, name: getOrganizationName(item.name, language) })), [language]);
  const localizedQuerySubNatBUData = useMemo(() => querysubNatBUData.map((item) => ({ ...item, name: getOrganizationName(item.name, language) })), [language]);

  const CustomXAxisTick = ({ x, y, payload }: any) => {
    const words = String(payload.value).split(" ");
    const lines: string[] = [];
    let current = "";
    const lineLength = language === "km" ? 12 : 16;
    words.forEach((word: string) => {
      const test = current ? `${current} ${word}` : word;
      if (test.length > lineLength && current) { lines.push(current); current = word; }
      else current = test;
    });
    if (current) lines.push(current);
    return (
      <g transform={`translate(${x},${y + 8})`}>
        {lines.map((line, i) => (
          <text key={i} x={0} y={0} dy={i * 12 + 8} textAnchor="middle" dominantBaseline="hanging" fill="var(--chart-axis)" fontSize={12} fontFamily={language === "km" ? "Hanuman" : "inherit"}>
            {line}
          </text>
        ))}
      </g>
    );
  };

  return (
    <div className="min-h-screen bg-background text-foreground transition-colors duration-500 selection:bg-sky-400/25" style={{ position: "relative" }}>
      <ParticleBackground theme={theme} />
      <div className="max-w-[1400px] mx-auto px-6 py-8" style={{ position: "relative", zIndex: 1 }}>
        <div className="flex flex-wrap items-center justify-between gap-3 mb-6">
          <div className="flex items-center gap-2">
            <LanguageSwitcher language={language} setLanguage={setLanguage} t={t} />
            <ThemeSwitcher theme={theme} setTheme={setTheme} t={t} />
          </div>
          <div className="flex items-center bg-card/90 border border-border rounded-full p-1 gap-1 shadow-sm backdrop-blur-xl">
            <button onClick={() => setPage("users")} className={`px-4 py-1.5 rounded-full text-xs font-medium transition-all ${page === "users" ? "bg-foreground text-background" : "text-muted-foreground hover:text-foreground"}`}>
              {t("navUsersSites")}
            </button>
            <button onClick={() => setPage("reports")} className={`px-4 py-1.5 rounded-full text-xs font-medium transition-all ${(page === "reports" || page === "reportTypes" || page === "queryTypes") ? "bg-foreground text-background" : "text-muted-foreground hover:text-foreground"}`}>
              {t("navReportsQueries")}
            </button>
          </div>
        </div>

        {page === "users" && (
          <>
            <>
              <div className="grid grid-cols-1 lg:grid-cols-2 gap-4 mb-6">
                <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl flex flex-col gap-3">
                  <p className="text-muted-foreground text-sm font-medium tracking-widest uppercase font-hanuman">
                    {t("totalSites")}
                  </p>

                  <div className="flex items-baseline gap-2">
                    <p className="text-2xl font-semibold tracking-tight font-hanuman">
                      {fmt(totalSites)}
                    </p>

                    <TrendBadge value={sitesTrend.value} up={sitesTrend.up} />

                    <span className="text-xs text-muted-foreground">
                      {t("comparedLastMonth")}
                    </span>
                  </div>

                  <div className="border-t border-border pt-3 flex flex-col gap-2">
                    {siteGroups.map((g) => (
                      <div
                        key={g.label.km}
                        className="flex justify-between items-center"
                      >
                        <p className="text-xs font-medium text-muted-foreground">
                          {g.label[language]}
                        </p>

                        <div className="flex items-center gap-2">
                          <span className="text-sm font-semibold text-foreground">
                            {fmt(g.count)}
                          </span>

                          <TrendBadge
                            value={g.trend.value}
                            up={g.trend.up}
                            size="sm"
                          />
                        </div>
                      </div>
                    ))}
                  </div>
                </div>

                <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl flex flex-col gap-3">
                  <p className="text-muted-foreground text-sm font-medium tracking-widest uppercase font-hanuman">
                    {t("totalUsers")}
                  </p>

                  <div className="flex items-baseline gap-2">
                    <p className="text-2xl font-semibold tracking-tight font-hanuman">
                      {fmt(totalUsers)}
                    </p>

                    <TrendBadge value={usersTrend.value} up={usersTrend.up} />

                    <span className="text-xs text-muted-foreground">
                      {t("comparedLastMonth")}
                    </span>
                  </div>

                  <div className="flex h-2 rounded-full overflow-hidden gap-[2px]">
                    <div
                      className="bg-emerald-400"
                      style={{ flex: totalActive }}
                    />
                    <div
                      className="bg-yellow-400"
                      style={{ flex: totalInactive }}
                    />
                  </div>

                  <div className="flex gap-3 text-xs text-muted-foreground">
                    <span className="flex items-center gap-1">
                      <span className="w-2 h-2 rounded-full bg-emerald-400 inline-block" />
                      {fmt(totalActive)} {t("active")}
                    </span>

                    <span className="flex items-center gap-1">
                      <span className="w-2 h-2 rounded-full bg-yellow-400 inline-block" />
                      {fmt(totalInactive)} {t("inactive")}
                    </span>
                  </div>

                  <div className="border-t border-border pt-3 flex flex-col gap-2">
                    {userGroups.map((g) => (
                      <div
                        key={g.label.km}
                        className="flex justify-between items-center"
                      >
                        <p className="text-xs font-medium text-muted-foreground">
                          {g.label[language]}
                        </p>

                        <div className="flex gap-2 text-xs">
                          <span className="text-emerald-400 font-semibold">
                            {fmt(g.active)}
                          </span>

                          <span className="text-muted-foreground">·</span>

                          <span className="text-yellow-400 font-semibold">
                            {fmt(g.inactive)}
                          </span>
                        </div>
                      </div>
                    ))}
                  </div>
                </div>
              </div>
            </>

            <div className="mb-2 flex items-center gap-2"><h2 className="text-sm font-semibold text-foreground">{t("geographicDistribution")}</h2></div>
            <div className="h-[500px] w-full"><CambodiaMap language={language} theme={theme} /></div>

            <h2 className="text-sm font-semibold text-foreground mt-16 mb-4">
              {t("usersSitesByCategory")}
            </h2>

            <UserSiteCategoryAccordion
              categories={userSiteCategoryData}
              expandedId={expandedUserSiteCategoryId}
              setExpandedId={setExpandedUserSiteCategoryId}
              language={language}
              t={t}
            />
          </>
        )}

        {page === "reports" && (
          <>
            <div className="grid grid-cols-1 lg:grid-cols-2 gap-4 mb-6">
              <KpiCard label={t("totalReports")} value={fmt(60)} icon={FileText} color="text-sky-400" bg="bg-sky-400/10" onClick={() => setPage("reportTypes")} />
              <KpiCard label={t("totalQueries")} value={fmt(21)} icon={Search} color="text-emerald-400" bg="bg-emerald-400/10" onClick={() => setPage("queryTypes")} />
            </div>

            <div className="grid grid-cols-1 xl:grid-cols-2 gap-4 mb-4">
              <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl">
                <h2 className="text-sm font-semibold text-foreground mb-3">{t("reportsByCategory")}</h2>
                <ResponsiveContainer width="100%" height={320}>
                  <BarChart data={reportCategoryChartData} margin={{ top: 20, right: 4, left: 0, bottom: 20 }}>
                    <CartesianGrid strokeDasharray="3 3" stroke="var(--chart-grid)" vertical={false} />
                    <XAxis dataKey="name" tick={<CustomXAxisTick />} axisLine={false} tickLine={false} interval={0} height={100} />
                    <YAxis tick={{ fill: "var(--chart-axis)", fontSize: 12 }} axisLine={false} tickLine={false} width={30} />
                    <Tooltip content={<CustomBarTooltip valueLabel={t("reports")} />} cursor={{ fill: "var(--chart-hover)" }} />
                    <Bar dataKey="reports" radius={[5, 5, 0, 0]}>
                      <LabelList dataKey="reports" position="top" style={{ fill: "var(--chart-label)", fontSize: 12 }} />
                      {reportCategoryChartData.map((_, i) => <Cell key={i} fill={CAT_COLORS[i % CAT_COLORS.length]} />)}
                    </Bar>
                  </BarChart>
                </ResponsiveContainer>
              </div>

              <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl">
                <h2 className="text-sm font-semibold text-foreground mb-3">{t("queriesByFunction")}</h2>
                <ResponsiveContainer width="100%" height={360}>
                  <BarChart data={queryCategoryChartData} margin={{ top: 20, right: 4, left: 0, bottom: 20 }}>
                    <CartesianGrid strokeDasharray="3 3" stroke="var(--chart-grid)" vertical={false} />
                    <XAxis dataKey="name" tick={<CustomXAxisTick />} axisLine={false} tickLine={false} interval={0} height={100} />
                    <YAxis tick={{ fill: "var(--chart-axis)", fontSize: 12 }} axisLine={false} tickLine={false} width={30} />
                    <Tooltip content={<CustomBarTooltip valueLabel={t("queries")} />} cursor={{ fill: "var(--chart-hover)" }} />
                    <Bar dataKey="queries" radius={[5, 5, 0, 0]}>
                      <LabelList dataKey="queries" position="top" style={{ fill: "var(--chart-label)", fontSize: 12 }} />
                      {queryCategoryChartData.map((_, i) => <Cell key={i} fill={CAT_COLORS[i % CAT_COLORS.length]} />)}
                    </Bar>
                    <Legend verticalAlign="bottom" content={() => (
                      <div className="flex flex-wrap justify-center gap-x-4 gap-y-1 mt-3">
                        {queryCategoryChartData.map((entry, i) => (
                          <div key={entry.name} className="flex items-center gap-1.5"><span className="w-2 h-2 rounded-full inline-block flex-shrink-0" style={{ backgroundColor: CAT_COLORS[i % CAT_COLORS.length] }} /><span style={{ color: "var(--chart-label)", fontSize: 11 }}>{entry.name} — {entry.fullName}</span></div>
                        ))}
                      </div>
                    )} />
                  </BarChart>
                </ResponsiveContainer>
              </div>
            </div>

            <div className="grid grid-cols-1 xl:grid-cols-2 gap-4 mb-4">
              <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl">
                <h2 className="text-sm font-semibold text-foreground mb-3">{t("topReports")}</h2>
                <ResponsiveContainer width="100%" height={360}>
                  <BarChart data={reportTop5ChartData} margin={{ top: 20, right: 4, left: 20, bottom: 20 }}>
                    <CartesianGrid strokeDasharray="3 3" stroke="var(--chart-grid)" vertical={false} />
                    <XAxis dataKey="name" tick={<CustomXAxisTick />} axisLine={false} tickLine={false} interval={0} height={40} />
                    <YAxis tick={{ fill: "var(--chart-axis)", fontSize: 12 }} axisLine={false} tickLine={false} width={30} />
                    <Tooltip content={<CustomBarTooltip valueLabel={t("reports")} />} cursor={{ fill: "var(--chart-hover)" }} />
                    <Bar dataKey="reports" radius={[5, 5, 0, 0]}>
                      <LabelList dataKey="reports" position="top" style={{ fill: "var(--chart-label)", fontSize: 12 }} />
                      {reportTop5ChartData.map((_, i) => <Cell key={i} fill={CAT_COLORS[i % CAT_COLORS.length]} />)}
                    </Bar>
                    <Legend verticalAlign="bottom" content={() => (
                      <div className="flex flex-wrap justify-center gap-x-4 gap-y-1 mt-3">
                        {reportTop5ChartData.map((entry, i) => <div key={entry.name} className="flex items-center gap-1.5"><span className="w-2 h-2 rounded-full inline-block flex-shrink-0" style={{ backgroundColor: CAT_COLORS[i % CAT_COLORS.length] }} /><span style={{ color: "var(--chart-label)", fontSize: 11 }}>{entry.name}: {entry.fullName}</span></div>)}
                      </div>
                    )} />
                  </BarChart>
                </ResponsiveContainer>
              </div>

              <div className="bg-card/90 border border-border rounded-xl p-5 backdrop-blur-xl">
                <h2 className="text-sm font-semibold text-foreground mb-3">{t("topQueries")}</h2>
                <ResponsiveContainer width="100%" height={360}>
                  <BarChart data={queryTop5ChartData} margin={{ top: 20, right: 4, left: 20, bottom: 20 }}>
                    <CartesianGrid strokeDasharray="3 3" stroke="var(--chart-grid)" vertical={false} />
                    <XAxis dataKey="name" tick={<CustomXAxisTick />} axisLine={false} tickLine={false} interval={0} height={40} />
                    <YAxis tick={{ fill: "var(--chart-axis)", fontSize: 12 }} axisLine={false} tickLine={false} width={30} />
                    <Tooltip content={<CustomBarTooltip valueLabel={t("queries")} />} cursor={{ fill: "var(--chart-hover)" }} />
                    <Bar dataKey="queries" radius={[5, 5, 0, 0]}>
                      <LabelList dataKey="queries" position="top" style={{ fill: "var(--chart-label)", fontSize: 12 }} />
                      {queryTop5ChartData.map((_, i) => <Cell key={i} fill={CAT_COLORS[i % CAT_COLORS.length]} />)}
                    </Bar>
                    <Legend verticalAlign="bottom" content={() => (
                      <div className="flex flex-wrap justify-center gap-x-4 gap-y-1 mt-3">
                        {queryTop5ChartData.map((entry, i) => <div key={entry.name} className="flex items-center gap-1.5"><span className="w-2 h-2 rounded-full inline-block flex-shrink-0" style={{ backgroundColor: CAT_COLORS[i % CAT_COLORS.length] }} /><span style={{ color: "var(--chart-label)", fontSize: 11 }}>{entry.name}: {entry.fullName}</span></div>)}
                      </div>
                    )} />
                  </BarChart>
                </ResponsiveContainer>
              </div>
            </div>

            <div className="grid grid-cols-1 lg:grid-cols-2 gap-4 mb-6">
              <KpiCard label={t("totalGeneratedReports")} value={fmt(63516)} icon={FileText} color="text-amber-400" bg="bg-amber-400/10" />
              <KpiCard label={t("totalGeneratedQueries")} value={fmt(25331)} icon={Search} color="text-violet-400" bg="bg-violet-400/10" />
            </div>

            <h2 className="text-lg font-bold text-foreground mb-4">{t("nationalUsage")}</h2>
            <h4 className="text-xs text-muted-foreground">{t("nationalUsageSubtext")}</h4><br />
            <div className="grid grid-cols-1 xl:grid-cols-2 gap-4 mb-6">
              <HorizontalBarChart title={t("topReportUnits")} data={localizedReportNatBUData} dataKey="reports" valueLabel={t("reports")} color="#facc15" labelPosition="right" yAxisOrientation="left" margin={{ right: 60, left: 0 }} />
              <HorizontalBarChart title={t("topQueryUnits")} data={localizedQueryNatBUData} dataKey="queries" valueLabel={t("queries")} color="#38bdf8" reversed labelPosition="right" yAxisOrientation="right" margin={{ right: 60, left: 20 }} />
            </div>

            <h2 className="text-lg font-bold text-foreground mb-4">{t("subnationalUsage")}</h2>
            <h4 className="text-xs text-muted-foreground">{t("subnationalUsageSubtext")}</h4><br />
            <div className="grid grid-cols-1 xl:grid-cols-2 gap-4 mb-6">
              <HorizontalBarChart title={t("topReportUnits")} data={localizedReportSubNatBUData} dataKey="reports" valueLabel={t("reports")} color="#facc15" labelPosition="right" yAxisOrientation="left" margin={{ right: 80, left: 0 }} />
              <HorizontalBarChart title={t("topQueryUnits")} data={localizedQuerySubNatBUData} dataKey="queries" valueLabel={t("queries")} color="#38bdf8" reversed labelPosition="right" yAxisOrientation="right" margin={{ right: 80, left: 0 }} />
            </div>
          </>
        )}

        {page === "reportTypes" && (
          <>
            <button onClick={() => setPage("reports")} className="text-xs text-muted-foreground hover:text-foreground mb-6 flex items-center gap-1">← {t("back")}</button>
            <h2 className="text-lg font-bold text-foreground mb-1">{t("reportTypes")}</h2>
            <p className="text-xs text-muted-foreground mb-6">{t("clickCategory")}</p>
            <CategoryAccordion categories={categoryData} expandedId={expandedReportId} setExpandedId={setExpandedReportId} colors={CAT_COLORS} language={language} t={t} getName={(c) => reportCategoryLabels[c.id]?.[language] ?? c.name} />
          </>
        )}

        {page === "queryTypes" && (
          <>
            <button onClick={() => setPage("reports")} className="text-xs text-muted-foreground hover:text-foreground mb-6 flex items-center gap-1">← {t("back")}</button>
            <h2 className="text-lg font-bold text-foreground mb-1">{t("queryTypes")}</h2>
            <p className="text-xs text-muted-foreground mb-6">{t("clickCategory")}</p>
            <CategoryAccordion categories={categoryQueryData} expandedId={expandedQueryId} setExpandedId={setExpandedQueryId} colors={CAT_COLORS} language={language} t={t} getName={(c) => `${c.name} — ${categoryQueryLabels[c.name]?.[language] ?? c.name}`} />
          </>
        )}

        <footer className="border-t border-border mt-10 pt-6 pb-4 flex flex-col items-center gap-1.5">
          <p className="text-xs text-muted-foreground">{t("developedBy")} · OIM</p>
          <p className="text-sm font-semibold text-foreground">{t("reportingPeriod")}</p>
        </footer>
      </div>
    </div>
  );
}
